000100****************************************************************  ROR01152
000200****************************************************************  ROR01152
000300**  THIS PROGRAM IS OWNED BY THE "" INSIDELINE TEAM "".       **  ROR01152
000400**  IF U NEED TO CHANGE OR TEST THIS PROGRAM , PLEASE CONTACT **  ROR01152
000500*        " INSIDELINE TEAM " VIA  INSIDELINE@INGRAMMICRO.COM   *  ROR01129
000600****************************************************************  ROR01129
000700****************************************************************  ROR01152
000800 IDENTIFICATION DIVISION.                                                 
000900 PROGRAM-ID.                     ORP971.                                  
001000 AUTHOR.                         INGRAM MICRO.                            
001100*REMARKS.                                                                 
001200*    ***********************************************************          
001300*    * COMPILE = C                                             *          
001400*    *                            (M=MACRO  A=ASSEMBLER)       *          
001500*    *                            (R=ASSEMBLE RELOCATABLE)     *          
001600*    *                                MUST BE IN CC/24         *          
001700*    *                                                         *  ROR02128
001800*    *  USES  DB2 TABLES.   '' BIND '' REQUIRED                *  ROR02128
001900*    *                                                         *  ROR02128
002000*    * PROGRAM NAME: ORP971IM                                  *  ROK98016
002100*    *                                                         *          
002200*    * PURPOSE:  THIS IS THE ORDER START PROGRAM.              *          
002300*    *           IT WILL RECEIVE CONTROL VIA START FROM LU6.2  *          
002400*    *           RECEIVE TRANSACTION PROGRAM ...(ORPXXXIM)     *          
002500*    *                                                         *          
002600*    *                                                         *          
002700*    * INPUT:                                                  *          
002800*    *     1) CUSTOMER DATA BASE                               *          
002900*    *     2) ORDER DATA BASE                                  *          
003000*    *     3) BRANCH PROFILE VSAM                              *          
003100*    *     4) CUSTOMER BACKORDER FILE                          *          
003200*    *     5) TABLE FILE (CORPORATE, ORDER TYPE)               *          
003300*    *     6) SY_THPTY_CARR  (DB2)  (3RD-PARTY ACCOUNTS)       *  RPM02110
003400*    *                                                         *          
003500*    *                                                         *          
003600*    * OUTPUT:                                                 *          
003700*    *     1) ORDER DATA BASE                                  *          
003800*    *                                                         *          
003900*    * FUNCTIONS:                                              *          
004000*    *     1) PROGRAM WILL PROCESS NEW ORDER REQUEST FROM ELCOM*          
004100*    *        ELCOM WILL SUPPLY ADDRESS, PO #, SHIP VIA,       *          
004200*    *        BACKORDER AND SPLIT SHIP FLAG. PROGRAM WILL      *          
004300*    *        VALIDATE INPUT FOR ANY ERRORS. ORDER REQUEST     *          
004400*    *        RESPONSE WILL BE WRITTEN IN TDQ (LUOT) WITH      *          
004500*    *        APPROPRIATE ERROR INDICATOR..                    *          
004600*    *                                                         *          
004700*    * REVISION INFO:                                          *          
004800****************************************************************          
      * 07/17/26 MXU SE8990:ITALIAN DELIVERY ADDRS SETTING FOR GERMAN*  MXU26198
      *              ORDERS TO POPULATE THE CITY NAME IN ADDRS LINE4 *  MXU26198
      *              INSTEAD OF ADDRS LINE3                          *  MXU26198
      *          JYP SET CREDIT CHECK EXPECTED TO TRUE WHEN CUSTOMER *  JYP26198
      *              AND CORP LEVEL SWITCH IS TURNED ON FOR CREDIT   *  JYP26198
      *              ENGINE                                          *  JYP26198
      * 09/05/25 NXM EXCEPTION HANDLING FOR MX WHEN UPDATING TO CASH *  NXM25248
      *              TERMS 995 OR 990.                               *  NXM25248
      * 01/10/25 KXS CHANGES TO SUPPORT CISCO CCW-R CHAGNES          *  KXS25010
      * 10/18/24 AXZ ADDED LOGIC TO SET 35 AS SHIP FROM BRANCH FOR   *  AXZ24292
      *              ALL COMMSCARE ORDERS.                           *  AXZ24292
      * 09/20/24 NXC CHANGED WRK-STORAGE FIELDS DATATYPE TO OVERCOME *  NXC24264
      *              SQL COMPILE ISSUE DUE ISPW RULES :: COD1SUPR    *  NXC24264
      * 08/02/24 RYB ADDED WS-TO-COUNTRY-CODE 'PL' FOR POLAND COUNTRY*  RYB24215
      *              AS HPI STORE SENDS PURCHASE ORDERS TO GERMANY   *  RYB24215
      *              FOR SHIPMENT TO POLAND.                         *  RYB24215
      * 07/05/24 KXA SE 8935 - CUSTOMER SO NUMBER IN HEADER - ADDED  *  KXA24187
      *              NEW FIELD AS CUST-SO-REF2 THAT WILL COME FROM   *  KXA24187
      *              FRONT END AND IT WILL BE STORED IN ORSHED       *  KXA24187
      * 05/31/24 AYB SE 8924 GLN IMPLEMENTATION : ENABILING FUNCTION *  AYB24152
      *              OF GLOBAL LOCATION NUMBER(STORE NUMBER)         *  AYB24152
      *              GLOBALLY WHEN PASSED IN THE INPUT. THE PRIORITY *  AYB24152
      *              SHOULD BE SHIP TO SUFFIX->GLN->SHIP TO ADDRESS. *  AYB24152
      * 03/02/24 SK8 NEW TERM ID ADDED FOR EMAIL TO ORDERS           *  SK824062
      *          CDL SALES HOLD BYPASS PROJECT                       *  CDL24062
      * 09/22/23 SS1 FEDEX AIR 3RD PARTY LEADING ZEROS               *  SS123265
      * 09/08/23 SS9 CARRIER CHANGE FOR DIRECT SHIPMENTS             *  SS923251
      *          RP1 TO STORE THE OPER ID THRU THE TBXINLN TABLE     *  RP123251
      * 08/04/23 RP1 X4A NEW TERM ID SUPPORT                         *  RP123216
      * 06/02/23 BYA CISCO WARRANTY PROJECT                          *  BYA23153
      *          NXC XVS - LITE ACCEPT CORTRACT TYPE FOR SAP ORDERS  *  NXC23153
      *          NXC SE#8830- EMEA - NEW ORDER TYPE "SPECIAL PO"     *  NXC23153
      * 02/25/23 RP1 XVANTAGE PROJECT SUPPORT                        *  RP123056
      * 02/18/23 VYM SE-8791 ADDED TERM-ID 'BRLK' FOR BRLINK PROJ    *  VYM23049
      * 09/23/22 AYB SE:8751-SHIP FROM FIELD WAS NOT POPULATING AS   *  AYB22266
      *              EXPECTED (SAME AS IMPULSE/MANUAL ORDER) FOR     *  AYB22266
      *              GERMANY AND UK CUSTOMERS WITH BRANCH OTHER      *  AYB22266
      *              THAN 44 AND 20.                                 *  AYB22266
      *              THE ISSUE IS REPORTED FOR THESE CUSTOMERS WHO   *  AYB22266
      *              ARE DOING BUSINESS IN GERMANY/UK FROM OTHER     *  AYB22266
      *              COUNTRIES.                                      *  AYB22266
      * 08/26/22 RP1 CEP PROJECT SUPPORT                             *  RP122238
      * 08/19/22 TZM PROJECT - TERM ID IMPROVEMENT                   *  TZM22231
      * 07/22/22 PYN NEW COUNTRY CODE 'BL' INTRODUCED TO BRAZIL      *  PYN22203
      *          SK8 PULLING QUOTE NUMBERS FOR API CHANNELS          *  SK822203
      * 06/04/22 SS1 FLEXIBLE SUBSCRIPTION ENGINE                    *  SS122155
      *              ADDING DATA IN ORSHED FOR BILL ONLY ORDERS      *  SS122155
      *              FROM SAP BRIM (INVOICE INTERFACE: RB PROJECT)   *  SS122155
      * 04/22/22 PYN SE-8713 ADDED IMC1 TERM-ID FOR BRAZIL           *  PYN22112
      *              IMCORE ORDERS                                   *  PYN22112
      * 03/18/22 NXC MOVE STATE CODE WHEN SHIP-TO SUFFIX IS SENT     *  NXC22077
      *              FOR INDIA                                       *  NXC22077
      * 03/04/22 MXR PULLING QUOTE NUMBERS FOR CISCO PORTAL ORDERS   *  MXR22063
      *          FXS ADDRESS VALIDATION MEXICO                       *  FXS22063
      *          NR1 ITALY CONVERSION - Z3 COMPANY CODE CHANGES      *  NR122063
      * 02/04/22 NXC UPDATE ALLOWED SUB ORDER TYPE'S DURING ORDER    *  NXC22035
      *              CREATION AS PER BUSINESS REQUIREMENTS.          *  NXC22035
      *          ROR ALLOW DROP SHIP ADDRESS ON COD ORDERS FOR CHINA *  ROR22035
      * 01/21/22 BYA INC4521842 FIX: LIMIT APO-FPO VALIDATION TO US  *  BYA22021
      * 10/08/21 MS2 CNP - ALLOW ORHOF-NP-ORDER-IND A NEW VALUE FOR  *  MS221281
      *              STRAUBING ORDERS ORHOF-NP-TREAT-AS-STOCK        *  MS221281
      * 10/08/21 RP1 CHINA PAYMENT TERMS SUPPORT                     *  RP121281
      * 09/18/21 VXA CHINA SSEU IMPLEMENTATION - PHASE 3             *  VXA21261
      *          NXC MOVE IS-SALESMAN DETAILS TO ORDER HEADER FOR CTO*  NXC21261
      *          NZP SE 8592 - ORDER CREATE API NEW ENTRY METHOD     *  NZP21261
      *              INTRODUCTION OF "WTDP" TERM-ID                  *  NZP21261
      *          NR1 ORDER COMING FROM IM360 , FOR EUROPE AND EXPORT *  NR121261
      *              ORDERS , IF WE DONT RECEIVE CARRIER CODE THEN   *  NR121261
      *              MOVE DEFAULT CARRIER CODE                       *  NR121261
      * 08/06/21 VZM DEFAULT CARRIER SELECTION FOR FREIGHT FORWARDER *  VZM21218
      *              HERMES ORDER SIMULATE - MIAMI                   *  VZM21218
      * 07/09/21 NXC 8679 - EXPORT ORDER LOGIC CHANGES               *  NXC21190
      * 06/18/21 JZP HPE-CTO PROJECT: CHANGES TO CAPTURER            *  JZP21169
      *              PO-CONFIRM-FLAG.                                *  JZP21169
      *          FYT NORDICS CONVERSION.                             *  FYT21169
      * 05/07/21 BYA DPAS-CAPTURE DPAS PROGRAM IDENTIFIER            *  BYA21127
      *          FYT ALLOW SCHEDULED-ORDERS ONLY FOR APAC AS INTENDED*  FYT21127
      *          VZM ENABLE FREIGHT FORWARDER FOR HERMES-MIAMI.      *  VZM21127
      * 04/10/21 BYA CHANGES FOR DPAS PROJECT.                       *  BYA21100
      *          RP1 SUPPORT IMO QUOTE MANAGER ORDERING              *  RP121100
      * 03/19/21 VXA IM360 IMPLEMENTATION:                           *  VXA21078
      *              1.CHANGES TO SKIP THE OVERRIDE OF ADDRESS LINE3 *  VXA21078
      *              WITH CITY WHEN SHIP TO COUNTRY CODE IS ''IT''   *  VXA21078
      * 02/19/21 TXT CR2309 - ADDRES VALIDATION ENABLING FOR ECCOM   *  TXT21050
      *          NXC BREXIT CHANGES TO HANDLE SHIP-TO-CNTY-CD AND    *  NXC21050
      *              DEFAULT CARRIER TO "BS" FOR IRELAND (ROI)       *  NXC21050
      *          NXC FIX TO REPLACE THE CHARACTER   BY @ IN IMPULSE  *  NXC21050
      *              FOR ORSA-CUSTOMER-EMAIL ADDRESS IN EMEA.        *  NXC21050
      * 01/23/21 NXC BREXIT CHANGES FOR EXPORT ORDERS                *  NXC21023
      * 01/23/21 BYA JDA CHANGES                                     *  BYA21023
      * 01/09/21 MS2 CNP - ALLOW B2B/REPL ORDERS BASED ON NEW        *  MS221009
      *                    B2B/REPL CORP7 SWITCH.                    *  MS221009
      * 10/30/20 VXA CHANGES FOR TIBCO RED PROJECT                   *  VXA20304
      *          NZP SE 8592 - ORDER CREATE API NEW ENTRY METHOD     *  NZP20304
      *              INTRODUCTION OF "GRPA" TERM-ID                  *  NZP20304
      *          VYP SE8512- ADDITIONAL CHANGES DONE TO ACCEPT       *  VYP20304
      *              TAX CODE AND STATE CODE FROM POWER APPLICATION  *  VYP20304
      *              AND VALIDATE THEM                               *  VYP20304
      * 10/10/20 PXM IM360 CHANGES FOR -                             *  PXM20284
      *              1) POPULATING CARRIER DESCRIPTION ON ORDER      *  PXM20284
      *              2) CHANGES TO RESTRICT DUMMY SKU FUNCTIONALITY  *  PXM20284
      *                 FOR APAC COUNTRIES ONLY , THIS IS TO FIX     *  PXM20284
      *                 ADDITIONAL DUMMY SKU TO EUROPEAN ORDERS      *  PXM20284
      * 02/10/20 RYK CR#2243 - DO NOT LINK THE EXTENDED SO           *  RYK20276
      *              TO THE TERMS CODE AND USE THE EXTENDED          *  RYK20276
      *              SO SETTING ON THE CUSTOMER.                     *  RYK20276
      * 08/28/20 RP1 RENEWVUE CHANGES SUPPORT FOR NEW TERM ID RNEW   *  RP120241
      * 08/07/20 MS2 CISCO NET PRICING PROJECT                       *  MS220220
      *              STOCKING ORDER TYPE INDICATOR ON ORSHEDOF       *  MS220220
      * 07/26/20 MS2 SUPPORT IM360 BRAZIL                            *  MS220208
      * 07/11/20 PXM IM360 CHANGES - TO OVERRIDE FRT OUT CODE AS 'P' *  PXM20193
      *              WHEN RECIEVED FROM IM360                        *  PXM20193
      *              IM360 CHANGES - TO CREATE F TYPE FUTURE ORDER   *  PXM20193
      *              WITH FUTURE PROMISE DATE                        *  PXM20193
      * 05/03/20 RP1 TPFA NUM BYPASSED FOR CISCO VENP FEDEX ORDER    *  RP120124
      * 04/03/20 AZN SE2233:UPDATING THE ORSHEDOF WITH QUOTE ID      *  AZN20094
      *              FOR IM360 TERM ID.                              *  AZN20094
      * 01/31/20 AZN SE8512: EU VAT REQUIREMENT                      *  AZN20031
      *              WAIVE OFF THE HANDLING FEES FOR BILL ONLY       *  AZN20031
      *              ORDERS FOR POWER APPLICATIONS.                  *  AZN20031
004810* 01/17/20 TEH CHANGE TO APO/FPO ZIP RANGE                     *  TEH20017
      * 11/01/19 VXA CHANGES TO ADD NEW TERM ID CBLU FOR THE         *  VXA19305
      *              ORDERS COMING THRU CLOUD BLUE APPLICATION       *  VXA19305
      * 11/01/19 KXD CHANGES TO ADD NEW TERM ID FOR POWER APPLICATION*  KXD19305
      *              AS PART OF VENDOR PASS THROUGH PROJECT.         *  KXD19305
      * 10/11/19 RP1 CHANGES FOR CISCO PNP FREIGHT OUT CODE          *  RP119284
      * 10/05/19 KXD -CHANGES TO ADD NEW TERM ID FOR SAP ROLLOUTS    *  KXD19278
004810*              -CHANGES TO FIX RESENT ORDERS BEING REJECTED AS *  KXD19278
004810*              DUPLICATE IN CASE OF INCOMPLETE ORDERS (FOR     *  KXD19278
004810*              SHARPER IMAGES ONLY).                           *  KXD19278
      * 09/20/19 MP5 INTRODUCING 'VRPO' IN WS-TERMS-CHG-OK FOR VRP   *  MPP19263
      *              (VENDOR REPORTING PROJECT).                     *  MPP19263
      * 09/20/19 FYT CHANGES FOR DSS PROJECT, SET A NEW ORSHEDOF     *  FYT19263
      *              FIELD IF EMAIL-ADDRESS IS PRESENT IN REQUEST    *  FYT19263
      * 08/02/19 VXA CHANGES FOR PORTUGAL PROJECT                    *  VXA19214
004810* 05/03/19 DXB CHANGES TO SUPPORT VENP ORDERING TERMS CODE     *  DXB19123
004810* 03/08/19 ROR CHANGES TO SUPPORT WEB MOBILE APPLICATION- ARMOR*  ROR19067
004810* 02/08/19 TEH CHANGE TO PROCESS WEB2 ORDERS FROM SUBSTATION   *  TEH19031
004820*              SAME AS VIA RPC.                                *  TEH19031
004830* 01/19/19 DXB SUPPORT NEW CISCO PORTAL ORDERING.              *  DXB19019
004900* 10/05/18 ROR SUPPORT IM360 ORDERING.                         *  ROR18278
005000* 10/05/18 RYD JDA PROJECT MOVE Y TO ORH-BASE-RATE NOT SET        RYD18278
005100* 08/04/18 AM1 APPLE DEP PH2: IF DEP FIELDS ARE MISSING IN THE *  ABM18216
005200*              ORDER CREATE REQUEST , PUT THE ORDER ON HOLD    *  ABM18216
005300*              RATHER THAN REJECTING IT IF THE REQUEST IS      *  ABM18216
005400*              COMING FROM SEEBURGER XML.                      *  ABM18216
005500* 06/01/18 SXW CHANGES TO SUPPORT USMRI PROJECT                *  SXW18152
005600* 05/04/18 AZD API SIMPLIFICATION.                             *  AZD18124
005700* 05/04/18 DXB ORDER SIMULATED DEFECT FIX FOR HERMES ORDER     *  DXB18124
005800*              SIMULATION.                                     *  DXB18124
005900* 04/07/18 AM1 SUPPORT APPLE DEP PROJECT.                      *  ABM18097
006000* 01/12/18 AM1 ADDED NEW ENTRY METHOD CODES FOR PCG AND WEB IN *  ABM18012
006001*              TBXCODE1 TABLE.                                 *  ABM18012
006002* 11/03/17 ROR SUPPORT IM360 PROJECT.                          *  ROR17307
006003*          ROR  CHANGE PSB FROM ORB320 TO ORB971 FOR Q4 READY. *  ROR17307
006004*          TEH FIX FOR HERMES LOGIC                            *  TEH17307
006005* 10/06/17 AM1 FIX FOR NA ADDRESS VALIDATION                   *  ABM17279
006006*          NXC CHANGES FOR CISCO DIRECTSHIP PROJECT.           *  NXC17279
006007*          TEH HERMES ORDER SIMULATE CHANGES                   *  TEH17279
006008* 09/01/17 AM1 ALWAYS SET CARRIER CODE TO 'BO' FOR DE/AT       *  ABM17244
006009*              WED DIRECT SHIP ORDERS.                         *  ABM17244
006010* 08/05/17 FXS HERMES - CHANGES FOR OMP ORDER NUMBER.           * FXS17217
006011* 07/22/17 FXS CHANGES FOR HERMES PROJECT.                     *  FXS17203
006012* 06/23/17 ROR CHANGES FOR INDIA GST PROJECT.                  *  NXC17174
006013* 04/21/17 ROR ADDED CODE1 SUPPRESSION AND AUDIT LOGIC         *  ROR17111
006014*              FOR US AND CANADA.                              *  ROR17111
006015*              ADDED CANADA CODE1 LOGIC.                       *  ROR17111
006016* 02/10/17 NXC CHANGES FOR EMAIL EXTENSION                     *  NXC17041
006017* 10/29/16 ROR FLAG GOVERNMENT ORDERS  PROPERLY SO AS TO       *  ROR16303
006018*              RESTRICT VIEWING OF THOSE ORDERS BY UNAUTH USERS*  ROR16303
006019* 10/07/16 DXB  CHANGES FOR PCG MIGRATION PROJECT              *  DXB16281
006020*          -->  CHANGES RELATED TO DUP PO CHECKING.            *  DXB16281
006021* 10/09/15 ROR  ALWAYS  SET  CARRIER CODE TO 'BO' FOR          *  ROR15282
006022*                SWITZERLAND WEB DIRECT SHIP ORDERS.           *  ROR15282
006100*          -->  CA PARTNER LEVEL PRICING PROJECT.              *  ROR15282
006200*                OPEN UP  GOVT LOGIC FOR CANADA.               *  ROR15282
006300* 09/11/15 ROR TO SUPPORT DIRECTSHIP IMONLINE PROJECT          *  ROR15254
006400* 06/05/15 ROR SUPPORT GSS WORKFLOW PROJECT                    *  ROR15156
006500* 05/08/15 PZD SUPPORT CH IMONLINE PROJECT-MAY2015-RELEASE     *  PZD15128
006600* 04/10/15 ROR IMONLINE CH PROJECT.                            *  ROR15107
006700* 01/09/15 ROR SUPPORT SE#23445 . SMS & EMAIL FEATURE FOR PCG  *  ROR15009
006800* 10/04/14 ROR SE#23046 . TO SUPPORT HK POSTAL CODE REQUIREMENT*  ROR14277
006900* 02/07/14 ROR SUPPORT IMMOBILITY - UK PROJECT.                *  ROR14038
007000* 09/20/13 ROR SE # 21171 . TO ALLOW "BO" CARRIER .            *  ROR13263
007100*          --> SE # 22442 . TO ALLOW TERMS TO BE OVERRIDDEN.   *  ROR13263
007200* 05/25/12 ROR SE # 21171 . TO OVERLAY INCOMING  POST CODE WITH*  ROR12146
007300*              EIRE , FOR  ORDERS  DROPSHIPPING TO IRELAND     *  ROR12146
007400*              FOR ORDERS PLACED IN EUROPE.                    *  ROR12146
007500* 05/10/12 ROR FIX FOR CANADA POSTAL CODES BEGINNING           *  WTL12131
007600*              WITH K1A WHICH CAN BE USED INTERCHANGABLY       *  WTL12131
007700*              IN ONTARIO OR QUEBEC                            *  WTL12131
007800* 11/04/11 DAK REVISE SAP SO NBR TO IMPULSE ORDER HEADER       *  DAK11308
007900* 11/11/11 ROR TO BYPASS UK DROPSHIP ADDRESS VALIDATIONS FOR   *  ROR11315
008000*              ORDERS  PLACED IN COUNTRIES OTHER THAN UK.      *  ROR11241
008100* 08/30/11 ROR SUPPORT EUROPE SMALL ENHANCEMENT REQUEST.       *  ROR11241
008200*              DEFAULT CARRIER CODE TO "SI" IF NONE COMING IN, *  ROR11241
008300*              FOR ORDERS DROP SHIPPING TO "IE".               *  ROR11241
008400* 07/13/11 ROR SUPPORT EUROPE SMALL ENHANCEMENTS REQUEST       *  ROR11194
008500*               ALLOW ADDTL TERMID VALUES TO COME IN-EUCM      *  ROR11194
008600* 05/11/11 ROR ALLOW PRISM TO CHANGE THE TERMS- EPICENTER PROJ *  ROR11131
008700* 05/04/11 ROR EBS-EAI INITIATIVE. SALES MNGR CODE UPDATE.     *  ROR11124
008800* 11/03/10 ROR TO SUPPORT DBL SE.                              *  ROR10307
008900* 10/20/10 ROR PANEURO PROJECT --   IDENTIFY SAP ORDERS.       *  ROR10293
009000*               SET SHIP FROM BR , TERMID ACCORDINGLY.         *  ROR10293
009100* 09/23/10 ROR TO SUPPORT HP SE.                               *  ROR10266
009200* 06/23/10 ROR  ENDEAVOUR PROJECT.                                PKV10174
009300*               TREAT WEB2 JUST LIKE WE TREAT WEBO.               PKV10174
009400* 04/14/10 ROR EUROPE SE - TO REMOVE POSTAL CODE VALIDATION    *  PKV10104
009500*               FOR ORDERS DROPSHIPPING TO IRELAND.            *  PKV10104
009600*                IF NO POSTAL CODE COMING IN THIS CASE,        *  PKV10104
009700*                  DEFAUL TO "EIRE".                           *  PKV10104
009800* 01/13/10 ROR DSFR2 PROJECT - ASSIGN CARRIER CODE AS "GR" ,   *  ROR10013
009900*               WHEN NO CARRIER IS ENTERED.                    *  ROR10013
010000*              ASSIGN CARRIER CODE AS "AR" FOR EXPORT DIRECT   *  ROR10013
010100*               ORDERS , WHEN NO CARRIER IS ENTERED.           *  ROR10013
010200* 11/04/09 ROR FIX FOR ADOBE LICENSING ORDER ISSUE-            *  ROR09308
010300*                INC000000012827.                              *  ROR09308
010400* 10/28/09 PKV SEND SHIP-TO-ATTN BACK ON RESP AREA.            *  PKV09301
010500* 09/24/09 ROR SUPPORT ERUROPE EUCM ENHANCEMENT REQUEST        *  PKV09266
010600*              JIRA : EBSEU-57.                                *  PKV09266
010700* 09/17/09 ROR DIRECT SHIP FREIGHT RECOVERY 2 PROJECT          *  PKV09260
010800* 08/05/09 ROR BUG FIX ---  TO REMOVE TBXMAFC VALIDATION.      *  ROR09217
010900*                       AND TO REMOVE TBXMANC VALIDATION.      *  ROR09217
011000* 07/15/09 ROR DBL PROJECT.                                       ROR09195
011100* 12/04/08 ROR CHANGES TO SUPPORT ITRK PROJECT- TERMS CHECK     * ROR08339
011200* 10/09/08 ROR CHANGES RELATED TO ITRK PROJECT.                *  ROR08283
011300*          PKV MODIFIED DUP PO LOGIC.                          *  ROR08283
011400* 08/28/08 ROR POPULATE ORHOF-WAIVE-FRT-REC-CHRG-SW            *  ROR08241
011500* 07/29/08 TKC CHECK GROUP1 EXPORT SW FOR APO/FPO ORDER        *  TKC08211
011600* 04/03/08 TKC INSERT I1 EMAIL SEGMENT FOR DIRECT ORDER        *  TKC08093
011700* 02/29/08 TKC STAPLES PROJECT - SET ORSA ADDRESS ACCORDINGLY  *  TKC07345
011800* 02/26/08 ROR ALLOW EUCM TO OVERRIDE  FRTOUTCODE.             *  ROR08057
011900*              ALLOW TRANSACTIONS FROM SUBSTATION TO UPDATE    *  ROR08057
012000*               EMAIL ADDRESS ON THE ORDER.                    *  ROR08057
012100*              ALLOW TRANSACTIONS FROM SUBSTATION TO UPDATE    *  ROR08057
012200*               CARRIER ON DIRECT SHIP ORDER.                  *  ROR08057
012300* 11/13/07 ROR EBS ORDER ENTRY PROJECT.                        *  ROR07317
012400*          --> MAKE CHANGES TO GET  DEF SHIP-BILL FROM CUSBRBN *  ROR07317
012500*              WHEN NONE ARE SENT IN FOR EBS PROJECT.          *  ROR07317
012600* 07/13/07 TKC CHINA WEB PROJECT - CHINESE ADDRESSES           *  TKC07194
012700* 01/30/07 KXA CHECK AND SET TAT CARRIER CODE BASED ON ZIP     *  KXA07030
012800* 01/30/07 ROR FIX FOR EXPORT ORDERS COMING WITH NO CARR CODE. *  ROR07030
012900* 11/14/06 ROR FIX FOR STOREFRONT DIRECT SHIP ORDERS TO LEAVE  *  ROR06318
013000*              TERM-ID COMING IN AS IT IS...                   *  ROR06318
013100* 09/28/06 ROR FIX FOR NL 'S   UK DROPSHIP PROBLEM.            *  ROR06271
013200* 07/20/06 ROR DELL GFX PROJECT -  SPECIAL CODE FOR ITALY.     *  ROR06201
013300* 07/13/06 ROR DELL GFX PROJECT.                               *  ROR06194
013400* 04/27/06 ROR DO INVALID CHARACTER CHECKING FOR               *  ROR06117
013500*              CUSTOMER -TO -INGRAM P.O NUMBER FIELD FOR CUST'S*  ROR06117
013600*              THAT ARE NOT ALLOWED TO ENTER MIXED CASE P.O    *  ROR06117
013700* 04/20/06 ROR TO SEND BACK ADDRESS LINE-3 IN THE RESPONSE AREA.  ROR06110
013800*          TKC SET ERROR S4 WHEN RESELLER MISSING IN LA SELECT *  ROR06110
013900*              SOURCE ORDER                                    *  ROR06110
014000* 03/17/06 ROR MOVING THE MISSED 2 LINES OF CODE THAT DIDNT GO  * ROR06076
014100*              INTO PRODUCTION ON 03/16/06.                     * ROR06076
014200* 03/16/06 ROR CHANGES TO ALLOW BACKORDER FLAG = "P" TO COME IN.* ROR06075
014300*          --> CHANGES TO POPULATE ALL WARNINGS IN NEW WARN AREA* ROR06075
014400*              CLEANUP CODE RELATED TO WARNINGS 6100-PARA.      * ROR06075
014500*          --> REPLACE HARD CODED UK CARR VALIDATION LOGIC WITH * ROR06075
014600*              ORWUKCAR COPYBOOK. (P040- PARA)                  * ROR06075
014700*          GLS CHANGED STAMPS FROM ABCDE TO ROR06075            * ROR06075
014800* 11/17/05 ROR CHANGES RELATED TO SECURITY CHECKING FOR EAI.    * ROR05321
014900* 11/10/05 ROR OVERRIDE TERMS , TERM-ID , FRT FWRDR , FRT-CODE  * ROR05314
015000*               , O/S SALESMAN FOR LACM WHEN SENT IN.           * ROR05314
015100*              TO OVERRIDE SOME OF THE ABOVE FIELDS BY LACM,    * ROR05314
015200*               WE  GO THRU SECURITY CHECKS.                    * ROR05314
015300* 11/03/05 ROR TO ALLOW  "000" IN SHIP-TO-SUFFIX FIELD.        *  ROR05307
015400*              MOVE SPACE TO ORH-SHIP-TO-SUFFIX IN THIS COND.  *  ROR05307
015500*              REPLACE CORORH-REQUEST-FILLER-AREA(1:2) WITH A  *  ROR05307
015600*               NEW FIELD NAME CORORH-BUYER-ID.                *  ROR05307
015700*          -->  ADDED LOGIC TO HANDLE SEL SRC VALIDATIONS      *  ROR05307
015800*               FOR TRANSACTIONS COMING IN THRU EAI DIRECTLY,  *  ROR05307
015900*               AS WE DONT GO THRU DRIVER PGMS FOR THEM.       *  ROR05307
016000*          TKC ALLOW EXPORT ORDER SHIP TO COUNTRY AE           *  ROR05307
016100* 10/04/05 ROR REPLACE APPLE HARD CODING LOGIC TO SWITCH DRIVEN*  ROR05277
016200*              THIS WAY ANYONE CAN USE THIS FUNCTIONALITY.     *  ROR05277
016300*              THIS SW WILL BE USED TO KEEP THE ORDER ON HOLD ,*  ROR05277
016400*              INSTEAD OF ISSUING AN ERROR FOR CERTAIN ERRORS. *  ROR05277
016500*          --> HUNGARY CONVERSION PROJECT.                     *  ROR05277
016501*          TKC SET CNTRY CODE PROPERLY FOR DEF SHIP-TO-SUF EXP.*  ROR05277
016502* 07/14/05 TEH FOR CUSTOMERS WITH ECOM-BYPASS-GROUP1 SET, WE GO*  TEH05195
016503*              THRU GROUP1 ONLY TO PICK UP FIRM/RESIDENTIAL SW.*  TEH05195
016504*              THIS CHANGE ALLOWS CUSTOMERS TO OVERRIDE THE    *  TEH05195
016505*              SETTING RETURNED FROM GROUP1.                   *  TEH05195
016506*              REMOVE HIGH RISK LEVEL DUP P.O. CUSTOMER NBRS.  *  TEH05195
016507* 06/16/05 ROR FRT FORWARDER CHECK LOGIC .                     *  ROR05167
016508*          -->  OPEN UP I/S SALESMAN FOR L.A STOREFRONTS ALSO. *  ROR05167
016509*          GLS  UPDATE REVISION LEVEL STAMP                    *  ROR05167
016510* 04/28/05 ROR OPEN UP L.A STORE FRONT LOGIC FOR ALL STOREFRONTS  ROR05118
016511* 04/05/05 TEH  REMOVE LOW RISK LEVEL DUP P.O. CUSTOMER NBRS.  *  TEH05097
016512* 03/24/05 ROR USE 88 LEVEL(TERM-ID) FOR LATIN AM STOREFRONTS. *  ROR05083
016513* 03/10/05 TEH  DELL AUSTRALIA - RENAME UNISYS ERRORS TO       *  TEH05069
016514*               GENERIC NAMES.  ADD LOGIC TO PROCESS SCHEDULED *  TEH05069
016515*               ORDERS FROM ASIA PAC.                          *  TEH05069
016516*          GLS  UPDATE REVISION LEVEL STAMP                    *  TEH05069
016517* 02/15/05 TEH  ADDED VALUE TO 88 LEVEL CHECK-CUST-DUP-PO IN   *  TEH05046
016518*               CUSBRN COPYBOOK.  WHEN CUSTOMER PROFILES ARE   *  TEH05046
016519*               UPDATED, WE CAN REMOVE HARDCODING.             *  TEH05046
016520*               DELETED REVISION NOTES PRIOR TO 2000.  REMOVE  *  TEH05046
016521*               OBSOLETE CODE RELATED TO BESTBUY.              *  TEH05046
016522* 01/31/05 TKC  CHANGE 3RD PARTY DB2 TABLE SYTTHPT TO WWT3ACT  *  TKC05031
016523* 01/21/05 TEH  ADD NEW SARCOM ACCOUNT.                        *  TEH05021
016524* 12/21/04 TEH  PREVENT 60-485960 FROM PLACING SHIP COMPLETE   *  TEH04357
016525*               ORDERS.                                        *  TEH04357
016526* 10/15/04 ROR  BYPASS ADDRESS VALIDATIONS FOR AMAZON UK , DE. *  ROR04289
016527*               BYPASS CARRIER VALIDATIONS FOR AMAZON UK , DE. *  ROR04289
016528* 09/30/04 TEH  REMOVE OBSOLETE WEB FREE FREIGHT LOGIC FOR     *  ROR04274
016529*               CHOICE ADVANTAGE PROJECT.                      *  ROR04274
016530* 08/16/04 MXK  ADDED BRAZIL NEW COMPANY CODE (BP)             *  MXK04170
016531* 08/11/04 ROR  LOGIC RELATED TO SETTING ORSH-FRT-OUT-CODE     *  ROR04224
016532*               PROPERLY FOR EXPORT ORDERS.                    *  ROR04224
016533* 08/03/04 ROR  LOGIC RELATED TO SETTING ORSH-CARRIER-SW       *  ROR04216
016534*               PROPERLY FOR EXPORT ORDERS.                    *  ROR04216
016535* 07/22/04 ROR  ADD APPLE BR-80 EXPORT ACCOUNT . 50-346907.    *  ROR04204
016536*               ADD LOGIC TO GO THRU  S1120- PARA FOR ANY      *  ROR04204
016537*                DROPSHIP ADDRESS THAT HAS CANADIAN ADDRESS.   *  ROR04204
016538* 06/15/04 TEH  ADD ECOM BYPASS GROUP1 SWITCH TO IGNORE ADDRESS*  TEH04167
016539*               CORRECTIONS FROM GROUP1.                       *  TEH04167
016540* 06/10/04 ROR  FIX TO REMOVE HARDCODING OF "CA", US".         *  ROR04162
016541*          -->  FIX TO UPDATE ORH-COUNTRY-CODE PROPERLY.       *  ROR04162
016542* 05/14/04 TEH  ALLOW USE OF SHIP TO SUFFIX WITH AN ATTENTION  *  TEH04135
016543*               LINE.                                          *  TEH04135
016544* 04/25/04 ROR  DECLARED VALUE PROJECT.                        *  ROR04116
016545* 03/31/04 TEH  OPEN UP TERMS FOR 'AV'.  THIS FOR EAGENCY.     *  TEH04091
016546* 04/08/04 TKC  CHANGE TO VALIDATE EUROPE POSTAL CODE BY SHIP  *  TKC04099
016547*               TO COUNTRY IN S0057 EXCEPT NL.                 *  TKC04099
016548* 04/04/04 ROR  UPSMI PROJECT.                                 *  ROR04094
016549*          -->  CLEAN UP OLD CODE AND RESTRUCTURED A BIT.      *  ROR04094
016550*          -->  UNISYS , AUCTION, OLDEXPORT..                  *  ROR04094
016551* 03/16/04 JMW  VALUE PRICING PROJ(CHOICE ADVANGAGE) PROJ.        JMW04076
016552*          TEH  ADD 'DC' COMPANY CODE TO GERMANY FOR COMPUSHACK   TEH04076
016553*          TKC  UK - MOVE CUA-ZIP-L TO ORH-POSTAL-CODE.           TEH04076
016554* 03/04/04 ROR  OPEN UP FRT FORWARDER LOGIC FOR STORE FRONTS.  *  ROR04064
016555*               CLEAN UP OBSELETE CODE AND RESTRUCTURE A BIT.  *  ROR04064
016556*               FIX FOR EAGLE PROJECT.                            ROR04064
016557* 02/05/04 ROR  ENHANCEMENT & FIX TO THIRD PARTY FREIGHT LOGIC *  ROR04036
016558*               CLEANUP OBSELETE CODE.                         *  ROR04036
016559* 01/30/03 SXG  THIRD PARTY FREIGHT PROJECT.                   *  SXG04030
016560* 11/11/03 ROR  CHANGES RELATED TO DUPLICATE P.O HISTORY CHECK *  ROR03315
016561*               FOR  EUROPE.                                   *  ROR03315
016562*          -->  FIX AUSTRALIA'S DROP-SHIP ADDRESS ISSUE.          ROR03315
016563*          -->  FIX IMPROPER UPDATE OF ZIPCODE ISSUE.             ROR03315
016564* 11/03/03 SXG  FIX THE PROBLEM WITH BILL TO SUFFIX.           *  SXG03308
016565* 11/01/03 SXG  EAGLE RPL/COLUMBUS PROJECT.                    *  SXG03305
016566*           -   REMOVE DENIAL FILE CHECKING (EXLMST) FOR EAGLE *  SXG03305
016567*               RPL PROJECT. THIS WILL BE DONE IN RPL SUBROUTINE. SXG03305
016568*           -   CHGS FOR EAGLE COLUMBUS EXPORT LOGIC.             SXG03305
016569*           -   WITH THE NEW MODEL, APO/FPO ORDERS WILL BE        SXG03305
016570*               AVAILABLE IN ALL BRANCHES.(EARLIER ONLY BR 10).   SXG03305
016571*           -   FIX THE EXISTING BUG - BEFORE GOING TO S1070-     SXG03305
016572*               PARA THE SHIP TO SUFFIX IS BEING SENT INSTEAD OF  SXG03305
016573*               BILL-TO SUFFIX.                                   SXG03305
016574*           -   FIX THE EXISTING BUG - WE ARE NOT VALIDATING THE  SXG03305
016575*               SHIP TO COUNTRY CODE AGAINST TBXCNTRY TABLE. IF   SXG03305
016576*               THE COUNTRY CODE DOES NOT EXIST IN TBXCNTRY, SEND SXG03305
016577*               ERROR MESSAGE.                                    SXG03305
016578* 10/27/03 SXG  FIX THE ISSUE WITH DIRECT SHIP ORDERS WHEN FRM    SXG03300
016579*               SWITCH IS TURNED ON.                              SXG03300
016580* 10/07/03 TKC  SET CARRIER SW T Y WHEN CARRIER CODE IS SENT      TKC03280
016581* 09/28/03 TKC  ADD NEW FREIGHT RULE MODULE LOGIC FOR WE PAY      TKC03271
016582*               WE PICK PROJECT                                   TKC03271
016583* 09/04/03 SXG POPULATE  ORH-CURRENCY-RATE ACCORDING TO TBXCONR*  SXG03247
016584*              TABLE.                                          *  SXG03247
016585* 07/31/03 SXG TURN ON DUPLICATE P.O. CHECK FOR AMAZON 50462121*  SXG03212
016586* 07/29/03 ROR  CHANGE TO PROPERLY UPDATE DISC PCT FOR SPAIN.  *  ROR03210
016587*          -->  CHANGE TO ACCEPT TERMS FOR MEXICO STORE FRONTS.*  ROR03210
016588* 06/05/03 ROR FIX NETHERLANDS SHIPPING TO U.K,I.E  ISSUE.     *  ROR03156
016589* 05/13/03 ROR FIX NETHERLANDS ZIPCODE ISSUE.                  *  ROR03133
016590*          -->  TURN ON DUPLICATE P.O CHECK FOR PRO-VANTAGE    *  ROR03133
016591*          SXG  TURN OFF THE BASERATE FOR INSIGHT AS INSIGHT IS   ROR03133
016592*               NOT UTILIZING IT.                                 ROR03133
016593* 04/15/03 ROR  ALWAYS  SET  CARRIER CODE TO 'BO' FOR             ROR03105
016594*                FRANCE WEB DIRECT SHIP ORDERS.                   ROR03105
016595*          -->  ALLOW NETHERLANDS TO DROP-SHIP TO OTHER COUNTRIES.ROR03105
016596*               DONT DO ANY VALIDATIONS IN THIS CASE.             ROR03105
016597*               ABOVE LOGIC APPLIES ONLY FOR XML/IL.              ROR03105
016598* 04/03/03 SXG  CONVERT INSIGHT CARRIER CODES INTO TRANSIT DAYS*  SXG03091
016599* 03/13/03 ROR  DONT GO TO S1030- FOR VERTEX  VALIDATION!         ROR03072
016600*          -->  FIX TAX ISSUE BY UPDATING ORH-SHIP-TO-STATE WITH  ROR03072
016601*               THE VALUE THAT WE GET BACK FROM GRP1 , INSTEAD OF ROR03072
016602*               UPDATING IT WITH  CUSTOMER  SENT STATE.           ROR03072
016603* 02/28/03 SXG  CHGS FOR WE PICK/WE PAY & ALASKA/HAWAII PROJECT.  SXG03059
016604*          DXF  CORRECTED REVISION STAMP                          SXG03059
016605* 01/31/03 TEH  BRANCH 32 CUSTOMERS FROM NORWAY MOVED TO SWEDEN.  TEH03031
016606*               BRANCH 30 CUSTOMERS FROM DENMARK MOVE TO SWEDEN.  TEH03031
016607* 01/28/03 TKC  ADD EMAIL ADDRESS FOR BACKORDER NOTIFICATION      TKC03028
016608* 01/16/03 ROR  ADD ATOMIC PARK TO BASERATE.                      ROR03016
016609*               TURN BASERATE OFF FOR CANADA CUSTOMER 40-024496   ROR03016
016610*               AND 40-024506                                     ROR03016
016611* 12/10/02 ROR  ADD LOGIC TO UPDATE ORH-RESELLER-SPLIT-PCT        ROR02344
016612*                FOR SELECT SOURCE ORDERS.                        ROR02344
016613*               ADD LOGIC TO UPDATE FIRMNAME FOR SARCOM ONLY.     ROR02344
016614* 11/14/02 ROR  ADD LOGIC TO HANDLE FIRM NAME  FOR GROUP1 .       ROR02318
016615*          ROR  TURN ON DUPLICATE P.O CHECK FOR INSIGHT.          ROR02318
016616* 10/24/02 ROR  ADD NASCORP TO BASERATE.                          ROR02297
016617* 09/30/02 TKC  IMS EXPANSION PHASE 2 - USE STANDARD PSB NAME  *  TKC02273
016618*          ROR  ENABLE DUPLICATE P.O CHECK FOR BUY.COM            TKC02273
016619* 08/26/02 BIM  BYPASS 3RD-PRTY-ACC EDIT AGAINST DB2 TABLE     *  BIM02238
016620*               SYTTHPT, FOR UPS, RPS, & BAX.                  *  BIM02238
016621* 08/22/02 ROR  FIX FOR UPDATING ORH-CURRENCY-CODE PROPERLY       ROR02234
016622*                FOR BRAZIL , ARGENTINA , MEXICO.                 ROR02234
016623* 07/22/02 GZS  ALLOW CARRIER CE FOR N IRELAND,ISLE OF MAN        GZS02203
016624* 08/07/02 ROR  IGNORE  ZONE-ERROR-SW  FOR  CANADA COD ORDERS ..  ROR02219
016625*                AS  THERE'S NOTHING LIKE COD IN CANADA ANYMORE.  ROR02219
016626* 07/10/02 ROR  FIX FOR UPDATING ORH-CURRENCY-CODE PROPERLY.      ROR02190
016627*          -->  ALLOW 'UR' CARRIER TO BE USED BY IRELAND ALSO.    ROR02190
016628* 06/13/02 TEH  ADD BUY.COM TO BASERATE.                          TEH02164
016629* 06/07/02 TEH  REMOVE INSIGHT FROM BASERATE.                     TEH02157
016630* 05/31/02 TKC  APX/AIRBORNE, UPS STRIKE CONTINGENCY PROJECT      TKC02151
016631*          TEH  ADD 50274426 TO BASERATE.                         TEH02151
016632*          TEH  ADD INSIGHT TO BASERATE.                          TEH02151
016633* 05/08/02 ROR  ADD DB2 3RD PARTY FRT ACCT NBR VALIDATIONS FOR    ROR02128
016634*                 RPS/BAX CARRIERS .                              ROR02128
016635*               MODIFY 3RD PARTY LOGIC TO HANDLE AGENCY ORDERS.   ROR02128
016636* 05/01/02 ROR  ENABLE DUPLICATE P.O CHECK FOR OFFICE MAX.        ROR02120
016637* 04/09/02 RPM  PAR#15495A.  ADDED DB2 ACCESS FOR 3RD PARTY       RPM02110
016638*               ACCOUNTS.                                         RPM02110
016639* 04/02/02 ROR  GIVE NEW ERROR 'X2' IF WE DONT GET A GOOD RESP *  ROR02092
016640*                FROM TBXCNTY2 READ FOR EXPORT ORDERS!         *  ROR02092
016641* 03/19/02 ROR  MADE  CHANGES RELATED  TO LATIN-AMERICA.    .  *  ROR02073
016642* 02/28/02 ROR  FIX PRODUCTION ISSUE..NOTICED WHILE TESTING!   *  ROR02059
016643*          TKC  ADD APPLE NEW STORE ACCOUNT 50-140191.         *  ROR02059
016700* 01/25/02 TKC  SARCOM CAN'T DO CONSOLIDATED ORDER AND         *  TKC02025
016800*                 ONLY CONFIG ORDER CAN BE SHIP-COMPLETE       *  TKC02025
016900* 02/05/02 ROR  CHANGE TO ACCEPT TERMS FOR BRAZIL.             *  ROR02036
017000*          -->  BYPASS  DUPLICATE P.O CHECK FOR WORLD WIDE WEB *  ROR02036
017100*                WITH P.O = 'SITESCOPETESTORDER'               *  ROR02036
017200* 01/16/02 TEH  ADD 70-186481 TO DUP PO CHECK.                 *  TEH02016
017300* 01/15/02 TEH  IMS EXPANSION PROJECT.                         *  TEH02015
017400*               ADD 30-574436 TO BASERATE.                     *  TEH02015
017500* 12/10/01 ROR  CUSTOMERS  WHO CAN  PLACE ONLY CREDIT CARD -   *  ROR01344
017600*                ORDERS  SHOULD NOT BE BLOCKED..               *  ROR01344
017700* 11/28/01 ROR  SEND BACK ENTRY DATE AND TIME IN RESP AREA.    *  ROR01332
017800* 11/12/01 ROR  CHANGES  RELATED TO APPLE PROJET.              *  ROR01316
017900*               IF CARR IS SENT..OR...DEF CARR  HAS  PROBLEMS  *  ROR01316
018000*                  ---> TURN BASERATE OFF.                     *  ROR01316
018100*               IF DEF CARR .OR.. CARR SENT IN,HAS ANY PROBS   *  ROR01316
018200*               IF VERTEX REJECTS THE ADDR OR ZIP CODE IS V.BAD*  ROR01316
018300*                  ---> KEEP ORDER ON HOLD ,CHANGE CARR TO 'XC'*  ROR01316
018400*          -->  DUPLICATE P.O CHECK FOR APPLE ACCOUNT.         *  ROR01316
018500*          -->  APPLY SAME LOGIC FOR  PHOTO-ALLEY AS WE ARE    *  ROR01316
018600*               DOING TODAY FOR BEST-BUY RELATED TO APO/FPO.   *  ROR01316
018700*          -->  CUSTOMERS  WHO CAN  PLACE ONLY CREDIT CARD -   *  ROR01316
018800*                ORDERS  SHOULD BE BLOCKED.                    *  ROR01316
018900* 11/13/01 TEH  ADD 'OT' AS CARRIER RECEIVING PREPAID FREIGHT  *  TEH01317
019000*               FOR 'UK' FULFILLMENT ORDERS ONLY.              *  TEH01317
019100*               ADD 20-316250 TO DUP PO CHECK.                 *  TEH01317
019200* 10/30/01 ROR  DONT GIVE ANY ERROR WHEN TRYING TO DROP-SHIP TO*  ROR01303
019300*                FINLAND FROM SWEDEN ..OR..SWEDEN FROM FINLAND.*  ROR01303
019400* 09/25/01 TKC  ALLOW MUSTANG PROJECT TO SEND THEIR TERM ID    *  TKC01268
019500*               TRUN BASERATE ON FOR '40317756'                *  TKC01268
019600* 09/24/01 ROR  DUPLICATE P.O CHECK FOR '14206261'             *  ROR01267
019700* 08/16/01 MJF  MODIFIED FOR ALPHANUMERIC ORDER NUMBERS.       *  MJF01228
019800*               DELETED UNUSED WORKING STORAGE DATA ELEMENTS.  *  MJF01228
019900* 08/01/01 TEH  ADD AMAZON AND COMPUTER NERDS TO P.O. CHECK.   *  TEH01213
020000*               CHANGE CALL TO ORP321 TO ORP329 PER M. VANESIAN*  TEH01213
020100*               FIX ERROR SW BUG.                              *  TEH01213
020200* 07/24/01 ROR  COMMENTED HARD-DIVERTED LOGIC...AS  WE  ARE    *  ROR01205
020300*                DOING  THAT IN ORP673  NOW.                   *  ROR01205
020400* 06/22/01 ROR  CHANGES  TO  FRANCE  CARRIER  LOGIC.           *  ROR01173
020500* 06/01/01 ROR  FIX  FOR  MASKING  FRANCE CARRIER ERROR.       *  ROR01152
020600*          -->  CHANGES TO  BUY.COM (U.K) LOGIC.               *  ROR01152
020700* 05/22/01 ROR  CHANGES RELATED TO SARCOM                      *  ROR01142
020800*               TO SHIP FROM BR---36 INSTEAD  OF '75'  FOR     *  ROR01142
020900*               CONSOLIDATED PP& S ORDERS..                    *  ROR01142
021000* 05/07/01 ROR  CHANGES RELATED TO FRANCE CARRIER  LOGIC.      *  ROR01129
021100*          -->  TURN BASERATE ON FOR 72-110946,160701,160721.  *  ROR01129
021200*                    30-274346,30-581496,30-571296,30-162431   *  ROR01129
021300* 04/26/01 ROR  CHANGES TO APO-FPO PROCESS RELATED TO BEST-BUY.*  ROR01116
021400*          -->  DELETE THE MOVES TO OET FIELD'S AS WE DONT USE.*  ROR01116
021500*          -->  CHANGES TO U.K  LOGIC. # BUG 13490.            *  ROR01116
021600*          -->  FIX TO ALWAYS UPDATE ORH-CAPS-ID-CODE WITH..   *  ROR01116
021700*                CAPS-ID-CODE VALUE ON BILL-TO-SUFFIX.         *  ROR01116
021800*          MYA  ADDED COPYBOOK TO PROCESS TABLE DRIVEN         *  ROR01116
021900*                LOGIC FOR FRENCH CCS.                         *  ROR01116
022000* 04/06/01 MCV  MOVE DUPLICATE P.O. CHECK TO ORP321            *  MCV01116
022100* 04/06/01 ROR  CHANGES RELATED TO BEST-BUY.                   *  ROR01096
022200* 03/29/01 ROR  CHANGES RELATED TO DUPLICATE P.O HISTORY CHECK *  ROR01088
022300*               FOR  ASIA-PACIFIC --->                         *  ROR01088
022400*               CHECK BASED ON THE  FLAG ON CUSTOMERS PROFILE. *  ROR01088
022500*          -->  TURN BASE-RATE ON -> 40041483                  *  ROR01088
022600*          -->  DUPLICATE P.O CHECK FOR BESTBUY,TEST CUSTOMER  *  ROR01088
022700*          -->  TURN BASERATE OFF FOR BESTBUY ORDERS IF        *  ROR01088
022800*               THIRD-PARTY-FREIGHT > SPACES.                  *  ROR01088
022900*          -->  ALWAYS GO WITH CUSTOMER'S DEFAULT FOR BESTBUY  *  ROR01088
023000*                IF NO DEFAULT...GO  WITH '80'.                *  ROR01088
023100* 03/09/01 ROR  FIX FOR INVALID FRT CHARGES IN U.K             *  ROR01068
023200*          -->  CHANGE FOR  SPAIN RELATED TO COD ORDERS.       *  ROR01068
023300* 02/20/01 ROR  CHANGES RELATED TO DUPLICATE P.O HISTORY CHECK *  ROR01051
023400*               FOR  NETHERLANDS  --->                         *  ROR01051
023500*               CHECK BASED ON THE  FLAG ON CUSTOMERS PROFILE. *  ROR01051
023600*          -->  TURN ON BASERATE FOR 50077506,50201786 IN U.S  *  ROR01051
023700*          TEH  TURN BASERATE OFF FOR SARCOM ORDERS IF CORORH- *  ROR01051
023800*               THIRD-PARTY-FREIGHT > SPACES.                  *  ROR01051
023900* 12/25/00 TEH  TURN ON BASERATE FOR ALL CHANNEL AGENCY ORDERS *  TEH00325
024000* 12/12/00 ROR  TURN BASERATE OFF FOR FOLL CANADIAN CUSTOMERS  *  ROR00347
024100*               COMPAQ(40598500) & FUTURESHOP (10577640)       *  ROR00347
024200* 11/22/00 ROR  ADDED LOGIC RELATED TO AVL RELATED ORDERS  !   *  ROR00326
024300*          -->  TO UPDATE SALESMAN-ID AND  BYPASS-AUTH FLAG    *  ROR00326
024400*          -->  ADDED CUSTOMER PO DUPLICATE HISTORY -          *  ROR00326
024500*               VERIFICATION FOR ASIA-PACIFIC & NETHERLANDS    *  ROR00326
024600*          -->  CHANGE RELATED TO FRT-OUT CODE FOR UK.         *  ROR00326
024700* 11/20/00 ROR  FIX  FOR  ITALY'S  PACKING SLIP  PROBLEM..     *  ROR00325
024800* 11/13/00 ROR  ENHANCEMENT TO GOVT LOGIC !!                   *  ROR00318
024900* 11/08/00 ROR  TURN BASERATE ON FOR ALL CANADIAN CUSTOMERS!   *  ROR00313
025000*          -->  CANT HAVE  THIRD  PART FRT ACCOUNT  FOR        *  ROR00313
025100*                 EXPORT ORDERS...ERROR  "X7"                  *  ROR00313
025200*          -->  NO ERROR,IF EXP ORDERS DONT HAVE DEF SHIP-TO   *  ROR00313
025300*          -->  CHANGE RELATED TO THIRD-PARTY-FRT-ACCT LOGIC   *  ROR00313
025400*                WHEN 3RD PART-FRT-ACCT  ENTERED IS ZEROES !!  *  ROR00313
025500*          -->  MODIFIIED 3RD PARTY FRT LOGIC RELATED TO EAGLE.*  ROR00313
025600*          -->  IF UPS CARRIER..& 3 RD-PARTY-FRT-ACCT ENTERED  *  ROR00313
025700*                  ..VALIDATE  AGAINST TBXUPS TABLE !!         *  ROR00313
025800* 10/30/00 ROR  CHANGES RELATED TO GOVERNMENT LOGIC SO AS TO   *  ROR00304
025900*                HANDLE  TWO BYTE END-USER-TYPE FIELD !        *  ROR00304
026000* 10/17/00 PLB  ADD TBIDIVRT FOR HARD DIVERT.                  *  PLB00269
026100* 10/01/00 TEH  UPDATE ORH-RESIDENTIAL-SW FOR UPS PROJECT.     *  TEH00275
026200* 10/02/00 ROR  ERROR 'ED'' --> ORDERS WITH COD TERMS &DROPSHIP*  ROR00276
026300*          -->  UPDATE ORH-FREIGHT-FORWARDER !!                *  ROR00276
026400*          -->  VALIDATION FOR  TERMS ENTERED AND  UPDATING    *  ROR00276
026500*          -->  TURN BASE-RATE ON FOR SYSTEM-ID = 'AS'         *  ROR00276
026600* 09/15/00 TEH  EXPAND 'EV' ERROR.  FIX ZIP CODE MOVE.         *  TEH00259
026700*               RESET ERROR CODES SET IN DATABASE CALLS IF NO  *  TEH00259
026800*               ERROR OCCURRED. ADD 41-385356 TO BASERATE.     *  TEH00259
026900*               ADD 10-577640 (CANADA) TO BASERATE.            *  TEH00259
027000*               SET BASERATE OFF FOR DIRECT SHIP ORDERS.       *  TEH00259
027100* 09/01/00 TEH  ADD ANOTHER VALID CARRIER 'UZ' FOR U.K.        *  TEH00245
027200*               PUT IN A CHECK NUMERIC FOR CUB TERMS AND       *  TEH00245
027300*               INITIALIZE WS-TERMS WITH THAT VALUE RIGHT AWAY *  TEH00245
027400*               ADD 10/23-111720 TO BASERATE.                  *  TEH00245
027500* 08/21/00 TEH  ADD SUFFIX TO UPDATE OF ORH-RESELLER-NBR.      *  TEH00234
027600*               ADD PACIFIC BUSINESS 10/23-032734 TO BASERATE  *  TEH00234
027700* 08/04/00 ROR  UPDATE ORH-RESELLER-NBR CORRECTLY !.           *  ROR00217
027800*          -->  ADDED CUSTOMER PO DUPLICATE HISTORY -          *  ROR00217
027900*                   VERIFICATION FOR '50444746'                *  ROR00217
028000* 08/02/00 -->  TURN BASE-RATE ON -> 30308396                  *  ROR00215
028100*          ROR  TURN PRICE RE-CALC-SW ON FOR ALL THE ORDERS !  *  ROR00215
028200* 07/31/00 -->  TURN BASE-RATE ON -> 15137030,60937690,60016437*  ROR00213
028300* 07/21/00 ROR  FIX FOR DUPLICATE P.O CHECK !!                 *  ROR00203
028400* 07/14/00 ROR  MODIFIED  LOGIC TO UPDATE THE  ORH-TERM-ID !!  *  ROR00199
028500*         --->  MODIFICATION TO AUSTRALIAN TAX LOGIC !!        *  ROR00199
028600*         --->  ADDED  LOGIC TO REMOVE THE..WAIVE  OF  HANDLING*  ROR00199
028700*               - CHARGE FOR  AUCTION ORDERS  LOGIC.... !!!    *  ROR00199
028800*          -->  MODIFIED  DIRECT SHIP ORDERS  LOGIC...         *  ROR00199
028900*          -->  ADD CODE TO HANDLE CICS 'ADCI' & 'U980' ABENDS.*  ROR00199
029000*          -->  ENHANCEMENT TO BASE-RATE LOGIC !!              *  ROR00199
029100*          -->  LOGIC TO CLEAN CANADIAN ZIP CODE COMMING IN..!!*  ROR00199
029200* 06/08/00 MXB  NEW TNT CARRIER   NX                           *  MXB00160
029300* 06/23/00 ROR  MODIFIED  DEFAULT CARRIER LOGIC !!             *  ROR00178
029400* 06/20/00 ROR  MODIFIED  LOGIC RELATED TO EXPORT ORDERS...... *  ROR00175
029500*               ORDERS TO AMERICAN SAMOA , NORTHERN MARIANNA - *  ROR00175
029600*               -ISLANDS SHOULD BE TREATED AS EXPORT ORDERS... *  ROR00175
029700*          -->  TURN BASE-RATE ON FOR 50444746 ...USA          *  ROR00175
029800*          -->  SPACE THE CARRIER CODE FOR '15266946' EVEN IF  *  ROR00175
029900*                THEY GIVE ONE..SO THAT WE GET THE DEFAULT ONE!*  ROR00175
030000*          -->  ADDED CUSTOMER PO DIPLICATE HISTORY -          *  ROR00175
030100*                   VERIFICATION FOR '50240666'                *  ROR00175
030200*          -->  MADE CHANGE RELATED TO END-USER LOGIC.         *  ROR00175
030300* 06/01/00 GCH  ADD CODE TO USE NEXT ALPHANUMERIC ORDER           GCH00153
030400*               OR NUMERIC ORDER NUMBER LINK TO PROGRAM           GCH00153
030500*               SYU601.                                           GCH00153
030600* 05/18/00 FVB  ADD HP TO BASERATE.                            *  FVB00151
030700* 05/30/00 ROR  ADDED CUSTOMER PO DIPLICATE HISTORY -          *  ROR00151
030800*                   VERIFICATION FOR LATIN AMERICAN COUNTRIES  *  ROR00151
030900* 05/30/00 ROR  MODIFIED  LOGIC  RELATED  TO EXPORT ORDERS..   *  ROR00151
031000* 05/18/00 ROR  ADDED ACOP-GSA LOGIC                           *  ROR00140
031100*          -->  MODIFIED LOGIC RELATED TO DIRECT SHIP ORDERS   *  ROR00140
031200*          -->  MODIFIED LOGIC RELATED TO 'ORDERS WITH         *  ROR00140
031300*               SYSTEM-ID = 'DS'..ALWAYS GO WITH BR '27'       *  ROR00140
031400*          -->  INCREASED SIZE OF WS-ORSHED-SAVE FOR EXPANSION *  ROR00140
031500*          -->  TURN BASE-RATE ON FOR 40539001,40571890..CANADA*  ROR00140
031600*          -->  TURN BASE-RATE ON FOR 70008721 ...USA          *  ROR00140
031700* 05/04/00 ROR  BETA-TESTING FOR CANADA BASE RATE              *  FVB00129
031800*          FVB  MODIFY TB-MANIF TABLE READ LOGIC.              *  FVB00129
031900*          ROR  ADD ERROR  CHECK..                             *  FVB00129
032000* 04/24/00 TEH  ADD UPDATE OF THE ORH-AOD-SW TO OVERRIDE THE   *  TEH00115
032100*               REQUIREMENT FOR AN ADULT SIGNATURE.            *  TEH00115
032200* 05/03/00 ROR  IF ITS AN EXP ORDER B'CAUSE OF BILL-TO ONLY... *  ROR00115
032300*               TREAT IT AS A REGULAR U.S ORDER..BUT  FLAG IT  *  ROR00115
032400*               AS AN EXPORT ORDER AT  THE  END.. !!!          *  ROR00115
032500*          -->  LOGIC TO ALLOW  NON-GOVT ORDERS...  TO USE     *  ROR00115
032600*               ACOP IN ORP673 .. IF THEY  ARE  ELIGIBLE  !!   *  ROR00115
032700*          -->  LOGIC TO BYPASS POSTAL-CODE/CARRIER CHECK FOR  *  ROR00115
032800*               BUY.COM (U.K)                                  *  ROR00115
032900* 04/24/00 FVB  MODIFY UK CARRIER LOGIC.                       *  FVB00115
033000*               COD TERMS FOR LATIN-AM-COMPANY                 *  FVB00115
033100* 04/24/00 FVB  SKIP Z9000-ZIP LOGIC FOR APO-FPO ORDERS.       *  FVB00115
033200* 04/10/00 FVB  ADD HARD DIVERT LOGIC.                         *  FVB00101
033300*               ADD ADDITIONAL CARRIER FOR BUY.COM 'BT' REGION.*  FVB00101
033400* 04/10/00 FXE  REMOVE )                                       *  FVB00101
033500* 04/10/00 ROR  CHANGED LOGIC FOR  UNISYS..... SO AS TO  LOOP  *  ROR00101
033600*               THRU ALL MISC SEGMENTS  TILL REQD ONE IS FOUND *  ROR00101
033700* 03/30/00 ROR  FIX  FOR  ITALY'S  PACKING SLIP  PROBLEM..     *  ROR00090
033800* 03/29/00 ROR  FIX  FOR  ITALY'S  PACKING SLIP  PROBLEM..     *  ROR00089
033900* 03/21/00 TEH  POPULATE ORH-CAPS-BUYER FOR WEB ORDERS.        *  TEH00081
034000* 03/28/00 ROR  TURN OFF BASE-RATE FOR CANADA                  *  ROR00081
034100* 03/13/00 ROR  LOGIC RELATED TO EXPORT ORDERS...              *  ROR00080
034200*         --->  .EXP ORDERS SHOULD HAVE DEF SHIP-FROM ON CUSADR*  ROR00080
034300*         --->  ..CANT EXPORT TO D-COUNTRIES UNLESS CUSTOMER IS*  ROR00080
034400*                      ALLOWED TO DO SO..                      *  ROR00080
034500*         --->  FOR EXPORT ORDERS  DONT GO THRU Z9000-ZIPBR    *  ROR00080
034600*         --->  LOGIC TO VALIDATE BILL-TO & SHIP-TO ADDRESS'S  *  ROR00080
034700*               AGAINST DENIAL FILE & GIVE BACK WARNINGS...    *  ROR00080
034800*         --->  PROVIDE TAXING ON THE SHIP TO LEVEL FOR CANADA *  ROR00080
034900*         --->  FIX  FOR  ITALY'S  PACKING SLIP  PROBLEM..     *  ROR00080
035000*         --->  TURN ON BASE RATE FOR 40-114680,70-350596      *  ROR00080
035100* 03/15/00 ROR  ORSH-PROMISE-DATE  SHOULD BE  ZEROES  FOR 'NO' *  ROR00071
035200*               IN ORDER TO GET CORRECT PROMISE DATE.. (ORP678)*  ROR00071
035300* 02/29/00 ROR  TURN ON BASE RATE FOR 10-291886,70-354656      *  ROR00060
035400*         --->  ADDED  LOGIC TO GO THRU VERTEX & APO-FPO CHECK *  ROR00060
035500*               ..EVEN IF WE DONT GO THRU GRP1 FOR US &        *  ROR00060
035600*               ...DROP-SHIP ADDRESS                           *  ROR00060
035700*         --->  DONT GO THRU VERTEX IF ITS APO-FPO ORDER       *  ROR00060
035800*         --->  RESTRICT UNISYS AND GOVT LOGIC ONLY TO U.S     *  ROR00060
035900*         --->  LOGIC RELATED TO WARNS AND ERR'S  IN RESP AREA *  ROR00060
036000* 01/27/00 FVB  ADD LOGIC TO SET DEFAULT CARRIER FOR FRANCE.   *  FVB00038
036100* 01/26/00 FVB  RESET WS-ORSSHH-QUAL AFTER S3120-EDIT          *  FVB00026
036200* 01/10/00 ROR  CHANGE I/P TO VERTEX..IF  GROUP1  TURNED OFF   *  ROR00011
036300*               TURN BASE RATE ON FOR US ONLY.                 *  ROR00011
036400* 01/03/00 ROR  GIVE BACK WARNING  INSTEAD OF ERROR...IF  A    *  ROR00003
036500*               MATCH IS FOUND IN DENIAL FILE                  *  ROR00003
058100****************************************************************          
058200*                                                                         
058300 ENVIRONMENT DIVISION.                                                    
058400*                                                                         
058500 DATA DIVISION.                                                           
058700 WORKING-STORAGE SECTION.                                                 
058800*                                                                         
       77  WS-REVISION-LEVEL-STAMP     PIC X(08)   VALUE 'MXU26198'.    MXU26198
       77  WS-LAST-CONTAINER-CHANGE    PIC X(10) VALUE 'IM00010515'.    MXU26198
059000 77  WS-SUBROUTINE               PIC X(08).                       MCV01116
059100 77  WS-CAMEIN-ON-LINK-SW        PIC X VALUE ' '.                 GTH96198
059200     88  LINK-IN                            VALUE 'Y'.            GTH96198
059300 77  WS-ACCOUNT                  PIC X(15) VALUE ' '.             SXK96332
059400 77  WS-FED-ACCOUNT              PIC 9(12) VALUE 0.               SXK96332
059500 77  WS-AIRB-ACCOUNT             PIC 9(09) VALUE 0.               SXK96332
059600 77  WS-PRESENT-DATE             PIC X(08) VALUE SPACES.          ROR99135
059700 77  WS-PROMISE-DATE             PIC X(08)  VALUE SPACES.         ROR99135
       77  WS-EXPECTED-DELIVERY-DATE   PIC X(08)  VALUE SPACES.         BYA21100
       77  WS-ORSHOF-EDD-CCYYDDD       PIC S9(7)  COMP-3.               BYA21100
       77  WS-ORH-PRIORITY-CODE        PIC 9(1).                        BYA21100
059900 77  WS-GOVT-END-USER-TYPE       PIC X(02)  VALUE SPACES.         ROR99135
060000 77  WS-ABSTIME                  PIC S9(15) COMP-3 VALUE +0.      ROR99145
060100 77  WS-CREDIT-BAL               PIC S9(15)V99 COMP-3 VALUE +0.   ROR99145
060200 77  WS-ADDR-ERR-TYPE            PIC X(02)  VALUE SPACES.         ROR99214
060210 77  WS-HOLD-SEQ-PGM             PIC X(08)  VALUE 'ORP688  '.     ABM18216
060300 01  WS-TELIS-IS-SW1             PIC X(01)  VALUE SPACES.         ROR99273
060400 01  WS-TELIS-IS-SW2             PIC X(01)  VALUE SPACES.         ROR99273
060500 01  WS-TELIS-CODE               PIC X(05)  VALUE SPACES.         ROR99273
060510 01  WS-PROMISE-DATE1            PIC X(05)  VALUE SPACES.         TEH05069
060520 01  WS-PROMISE-DATE1-NUM        PIC S9(05) COMP-3  VALUE +0.     TEH05069
060600 01  WS-DATE.                                                     ROR99145
060700     05 WS-MM                    PIC X(02) VALUE ZEROES.          ROR99145
060800     05 WS-DD                    PIC X(02) VALUE ZEROES.          ROR99145
060900     05 WS-YY                    PIC X(02) VALUE ZEROES.          ROR99145
061000 01  WS-REVISION-AND-MISC-AREA.                                           
061100     05  WS-ABEND-ERROR-CODE     PIC X(06).                       MCV94145
061200     05  WS-ABEND-FUNCTION       PIC X(02).                       MCV94145
061300     05  WS-ABEND-RESOURCE       PIC X(08).                       MCV94145
061400     05  WS-ABEND-RESPONSE       PIC S9(08) COMP.                 MCV94145
061500     05  WS-ABEND-RESPONSE2      PIC S9(08) COMP.                 MCV94145
061600*    05  WS-PSB-NAME             PIC  X(8)     VALUE 'ORB320  '.  ROR17307
061610     05  WS-PSB-NAME             PIC  X(8)     VALUE 'ORB971  '.  ROR17307
061700     05  WS-UNQUAL-SSA           PIC  X(09).                              
061800     05  WS-ORDER-NBR            PIC  X(05).                      MCV94235
061900     05  WS-TS-REC-LENGTH        PIC S9(04)    COMP.                      
062000     05  WS-TS-ITEM-NBR          PIC S9(04)    COMP VALUE +1.             
062100     05  WS-ZIP-CODEX            PIC  X(09).                      MCV93293
062200     05  WS-ZIP-CODE             REDEFINES                        MCV93293
062300         WS-ZIP-CODEX            PIC  9(09).                      MCV93293
062400     05  WS-FLOOR-TERMS          PIC S9(03) COMP-3.               MCV94181
062500     05  WS-ELCOM-INGRAM-CUST    PIC X(08)       VALUE '60885460'.MCV94235
062600     05  WS-ELCOM-ALLIANCE-CUST  PIC X(08)       VALUE '23885460'.RXD94286
062700     05  WS-ELCOM-INGRAM-CUST-2  PIC X(08)       VALUE '60187746'.ROK99056
062800     05  WS-ELCOM-ALLIANCE-CUST-2 PIC X(08)      VALUE '23187746'.ROK99056
062900     05  WS-ELCOM-PRIMARY-SRC-CUST PIC X(08)     VALUE '60620750'.RXD95362
063000     05  WS-READ-SHIP-TO-SEG       PIC X(01)     VALUE SPACES.    SXK96332
063100         88  WS-READ-SHIP-TO               VALUE 'Y'.             SXK96332
063200     05  WS-CUST-SPECIFIC-SW     PIC X(01)  VALUE SPACES.         ROR99330
063300     05  WS-TBXPRG-ALREADY-READ  PIC X(01)  VALUE SPACES.         ROR99330
063400     05  WS-CUSTOMER-NBR         PIC X(06).                       ROR00151
063500     05  WS-CUSTOMER-BR-NBR      PIC X(08).                       ROR00175
063600         88  WS-SARCOM             VALUES   '40023798' '41649001'.TEH05021
065500         88  WS-APPLE              VALUES  '50140191'             ROR02059
065600        '50346906' '50370606' '50346907' '72713881' '72713911'    ROR05277
065610        '72713931'.                                               ROR05277
065700         88  WS-APPLE-IMAC         VALUES  '50346906'.            ROR01316
065800         88  WS-APPLE-STORE        VALUES  '50140191' '50370606'. ROR02059
065900         88  WS-APPLE-EXP-BR80     VALUES  '50346907'.            ROR04204
066000         88  WS-AMAZON-UK          VALUES  '2023387A'.            ROR04289
066100         88  WS-AMAZON-DE          VALUES  '44476225'.            ROR04289
066101     05  WS-CUSTOMER-CO-BR-NBR.                                   TEH04357
066110         88  WS-BOTTOM-LINE        VALUE   'MD60485960'.          TEH04357
066120         10  WS-CUST-CO          PIC X(02)  VALUE SPACES.         TEH04357
066130         10  WS-CUST-BR          PIC X(02)  VALUE SPACES.         TEH04357
066140         10  WS-CUST-NBR         PIC X(06)  VALUE SPACES.         TEH04357
066150     05 WS-HOLD-ON-ERROR-SW      PIC X(01)  VALUE SPACE.          ROR05277
066160         88 WS-HOLD-ON-ERROR                VALUE 'Y'.            ROR05277
066170     05 WS-HOLD-ON-ERROR-TYPE    PIC X(01)  VALUE SPACES.         ROR05277
066180     05 WS-HOLD-ON-ASSIGN-OT     PIC X(01)  VALUE SPACE.          ROR07030
066190     05 WS-ASSIGN-OT-TO-NORDIC-SW PIC X(01) VALUE SPACE.          ROR07030
066200        88 WS-ASSIGN-OT-TO-NORDIC           VALUE 'Y'.            ROR07030
066300     05 WS-HOLD-ON-CARR-ERR-SW   PIC X(01)  VALUE SPACE.          ROR06075
066400        88 WS-HOLD-ON-CARR-ERR              VALUE 'Y'.            ROR06075
066500     05 WS-HOLD-ON-3PTY-ERR-SW   PIC X(01)  VALUE SPACE.          ROR06075
066600        88 WS-HOLD-ON-3PTY-ERR              VALUE 'Y'.            ROR06075
066700     05 WS-HOLD-ON-ADDR-GRP1-ERR-SW PIC X(01)  VALUE SPACE.       ROR06075
066800        88 WS-HOLD-ON-ADDR-GRP1-ERR         VALUE 'Y'.            ROR06075
066900     05 WS-HOLD-ON-APO-FPO-ERR-SW   PIC X(01)  VALUE SPACE.       ROR06075
066901        88 WS-HOLD-ON-APO-FPO-ERR           VALUE 'Y'.            ROR06075
066902     05 WS-HOLD-ON-ERR-DEP-SW       PIC X(01)  VALUE SPACE.       ABM18216
066903        88 WS-HOLD-ON-ERR-DEP               VALUE 'Y'.            ABM18216
066904     05 WS-DROPSHIP-MD-SW        PIC X(01)   VALUE SPACES.        ROR99330
066905     05 WS-DROPSHIP-FT-SW        PIC X(01)   VALUE SPACES.        ROR17111
066906     05 WS-ROUTE-SW              PIC X(01)  VALUE  SPACES.        ROR00060
066907     05 WS-GROUP1-EXPORT-SW      PIC X(1)    VALUE SPACES.        ROR00060
066908     05  WS-CHECK-REGION         PIC X(02).                       ROR00060
067000         88  WS-US-REGION          VALUES                         ROR00060
067100                       'AS' 'GU' 'MP' 'PR' 'US' 'VI'.             ROR05307
067200     05  WS-CHECK-CUSTOMER       PIC X(08)  VALUE  SPACES.        ROR00080
067300     05  WS-SHIP-TO-SUFFIX-SW    PIC X(1)   VALUE SPACE.          ROR00151
067400         88 WS-SHIP-TO-SUFFIX               VALUE 'S'.            ROR00151
067500         88 WS-DEF-SHIP-TO-SUFFIX           VALUE 'D'.            ROR00151
      *    SE8924 GLN IMPLEMENTATION VARIABLES                          AYB24152
           05  WS-PARTNER-FOUND-SW      PIC X(01)  VALUE SPACE.         AYB24152
               88  PARTNER-FOUND                   VALUE 'Y'.           AYB24152
           05  WS-SQLCODE-MASK         PIC +999999999.                  AYB24152
      *                                                                 AYB24152
067600     05  WS-R-WARN-CODE.                                          ROR06075
067700         10  WS-R-WARN-FLAG      PIC X(1)   VALUE SPACE.          ROR06075
067701         10  WS-R-WARN-TYPE      PIC X(1)   VALUE SPACE.          ROR06075
067702     05  WS-HOLD-USPS-SW         PIC X(1)   VALUE SPACE.          TEH00275
067703     05  WS-GRP1-PO-BOX-IND      PIC X(1)   VALUE SPACE.          TKC02151
067800     05  WS-CO-DEFAULT-CARRIER   PIC X(1)   VALUE 'N'.            TKC03271
067900     05  WS-USE-FRM-SW           PIC X(1)   VALUE SPACE.          TKC03271
068000         88 WS-USE-FRM                      VALUE 'Y'.            TKC03271
068100     05  WS-EXPORT-FULFILLMENT-SW PIC X(01) VALUE ' '.            SXG03305
068200         88 WS-EXPORT-FULFILLMENT          VALUE 'Y'.             SXG03305
068300     05  WS-BILL-TO-E-CNTRY-SW   PIC X(01) VALUE ' '.             SXG03305
068400         88 WS-BILL-TO-E-CNTRY             VALUE 'Y'.             SXG03305
068500     05  WS-SHIP-TO-E-CNTRY-SW   PIC X(01) VALUE ' '.             SXG03305
068600         88 WS-SHIP-TO-E-CNTRY             VALUE 'Y'.             SXG03305
068700     05  WS-ST-NON-US-EXPORT-SW  PIC X(01) VALUE ' '.             SXG03305
068800         88 WS-ST-NON-US-EXPORT            VALUE 'Y'.             SXG03305
068900     05  WS-BI-NON-US-EXPORT-SW  PIC X(01) VALUE ' '.             SXG03305
069000         88 WS-BI-NON-US-EXPORT            VALUE 'Y'.             SXG03305
069100     05  WS-NON-EXP-ST-DOMESTIC-SW PIC X(01) VALUE ' '.           SXG03305
069200         88 WS-NON-EXP-ST-DOMESTIC         VALUE 'Y'.             SXG03305
069300     05  WS-NON-EXP-BI-DOMESTIC-SW PIC X(01) VALUE ' '.           SXG03305
069400         88 WS-NON-EXP-BI-DOMESTIC         VALUE 'Y'.             SXG03305
069500     05  WS-CORORH-SHIP-TO-CNTRY-CODE                             ROR04162
069600                                   PIC X(02) VALUE SPACES.        ROR04162
069610     05  WS-SCHEDULED-ORDER-SW     PIC X(01) VALUE SPACE.         TEH05069
069620         88  WS-SCHEDULED-ORDER              VALUE 'Y'.           TEH05069
069630     05  WS-EURO-AP-DUMMY-SKU      PIC X(12) VALUE 'L530291'.     TEH05069
069640     05  WS-FUTURE-PROMISE-DATE    PIC 9(05) VALUE ZERO.          TEH05069
069650     05  WS-FUTURE-PD  REDEFINES WS-FUTURE-PROMISE-DATE.          TEH05069
069660       07  WS-FUTURE-PD.                                          TEH05069
069670         10  FILLER                PIC XX.                        TEH05069
069680         10  WS-FUTURE-PD-DAYS     PIC 999.                       TEH05069
069610     05  WS-OVERRIDE-CARR-DES-SW   PIC X(01) VALUE SPACE.         PXM20284
069620         88  WS-OVERRIDE-CARR-DES            VALUE 'Y'.           PXM20284
                                                                        NXC21050
           05 EMAIL-CHAR-FMT-AREA.                                      NXC21050
              10  SUB4                   PIC S9(08) VALUE +0 COMP.      NXC21050
              10  WS-FRMT-EMAIL-ADDR     PIC  X(78) VALUE SPACES.       NXC21050
069700*                                                                         
069800 01  WS-MISC-AREA.                                                        
069900     05  WS-ABEND-INFORMATION.                                    ELB93350
070000         10  WS-ABEND-ERROR-SW       PIC X(1).                    MCV94235
070100         10  WS-ABEND-VSAM-STS       PIC 9(2).                    MCV94235
070200         10  WS-ABEND-DLI-STS        PIC X(2).                    MCV94235
070300         10  WS-ABEND-FILE-NAME      PIC X(10).                   MCV94235
070400     05  WS-TIME-SENT            PIC  ZZZZZZZZ.                           
070500     05  WS-TIME-SENT-X REDEFINES WS-TIME-SENT                            
070600                                 PIC  X(08).                              
070700     05  WS-CUSTOMER-KEY.                                                 
070800         10  WS-CUST-BILL-TO-NBR.                                 PXP95004
070900             15  WS-CUST-BR-NBR  PIC  X(02).                      MCV94235
071000             15  WS-CUST-NUMBER  PIC  X(06).                      MCV94235
071100         10  WS-CUST-SUFFIX      PIC  X(03).                      MCV94181
071200             88  WS-SUFFIX-000                 VALUE '000'.       MCV94181
071300             88  WS-SUFFIX-FLOORING            VALUE '111' THRU   ELB96108
071400                                                     '139'.       PXP97170
071500     05  WS-TERMS            PIC S9(3) COMP-3.                    SXK96332
071600         88 WS-COD-ORDER    VALUE +000 +004 +900 +996.            SXK96332
071610     05  WS-DEFAULT-TERMS        PIC X(03).                       ROR05314
071700     05  WS-TD-QUEUE-LUOT.                                                
071800         10  WS-TD-QUE-LUOT-BR   PIC X(02)     VALUE 'LU'.                
071900         10  WS-TD-QUE-LUOT-SYS  PIC X(02)     VALUE 'OT'.                
072000*                                                                         
072100 01  WS-MISC-LSB-FLDS.                                            PWL96284
072200     05  WS-CUA-SHIP-FROM        PIC X(02).                       PWL96284
072300     05  WS-BR-NBR-SHIP-FROM     PIC X(02).                       PWL96284
072400     05  WS-INVENTORY-BR         PIC X(02).                       PWL96284
072500     05  WS-X                    PIC 9(03)  VALUE ZERO.           PWL96284
072600     05  WS-STOP-BRSEQ-LOOP-SW   PIC X     VALUE 'N'.             PWL96284
072700         88  WS-STOP-BRSEQ-LOOP            VALUE 'Y'.             PWL96284
072800     05  WS-LSB-CENTRAL-STOCK-BR PIC X(02).                       PWL96284
072900     05  WS-LSB-CENTRAL-STOCK-SW PIC X(02).                       PWL96284
073000*** FOR COMPILING PURPOSE OF ORSLSPBR                             PWL97031
073100     05  WS-INSBRN-IO-SW         PIC X(1)        VALUE ' '.       PWL97031
073200         88  WS-INSBRN-NORESP                    VALUE 'Y'.       PWL97031
073300         88  WS-INSBRN-NOTFND                    VALUE 'N'.       PWL97031
073400     05  SAVE-WS-INSBRN-NBR      PIC X(02)  VALUE SPACE.          PWL97031
073500     05  WS-AVAIL-QTY            PIC S9(7)  COMP-3 VALUE +0.      PWL97031
073600     05  WS-AVAIL-BEFORE         PIC S9(7)  COMP-3 VALUE +0.      PWL97031
073700     05  WS-AVAIL-SAVE           PIC S9(7)  COMP-3 VALUE +0.      PWL97031
073800         COPY SPW00001.                                           ROR00080
073900     COPY INSBRN.                                                 PWL97031
074000     COPY INKBRN.                                                 PWL97031
074100***                                                                       
074200*                                                                         
074300 01  WS-PROGRAM-SWITCHES.                                                 
074400     05  WS-CUSHED-IO-SW         PIC X(1).                        MCV94235
074500         88  WS-CUSHED-NORESP                VALUE 'Y'.                   
074600         88  WS-CUSHED-NOTFND                VALUE 'N'.                   
074700     05  WS-CUSHEDOF-IO-SW       PIC X(1).                        TEH04167
074800         88  WS-CUSHEDOF-NORESP              VALUE 'Y'.           TEH04167
074900         88  WS-CUSHEDOF-NOTFND              VALUE 'N'.           TEH04167
075000     05  WS-CUSADR-IO-SW         PIC X(1).                        MCV94235
075100         88  WS-CUSADR-NORESP                VALUE 'Y'.                   
075200         88  WS-CUSADR-NOTFND                VALUE 'N'.           MCV95136
075300     05  WS-CUSBRN-IO-SW         PIC X(1).                        MCV94235
075400         88  WS-CUSBRN-NORESP                VALUE 'Y'.                   
075500         88  WS-CUSBRN-NOTFND                VALUE 'N'.                   
075600     05  WS-ORSHED-IO-SW         PIC X(1).                        MCV94235
075700         88  WS-ORSHED-NORESP                VALUE 'Y'.                   
075800         88  WS-ORSHED-NOTFND                VALUE 'N'.                   
075900     05  WS-ORSHEDOF-IO-SW       PIC X(1).                        TEH02015
076000         88  WS-ORSHEDOF-NORESP              VALUE 'Y'.           TEH02015
076100         88  WS-ORSHEDOF-NOTFND              VALUE 'N'.           TEH02015
076200         88  WS-ORSHEDOF-DUPREC              VALUE 'D'.           TEH02015
076300     05  WS-ORSSTO-IO-SW         PIC X(1).                        MCV94235
076400         88  WS-ORSSTO-NORESP                VALUE 'Y'.                   
076500         88  WS-ORSSTO-NOTFND                VALUE 'N'.                   
076600     05  WS-ORSSHH-IO-SW         PIC X(1).                        MCV94235
076700         88  WS-ORSSHH-NORESP                VALUE 'Y'.                   
076800         88  WS-ORSSHH-NOTFND                VALUE 'N'.                   
076900     05  WS-ORSSHHOF-IO-SW       PIC X(1).                        TEH02015
077000         88  WS-ORSSHHOF-NORESP              VALUE 'Y'.           TEH02015
077100         88  WS-ORSSHHOF-NOTFND              VALUE 'N'.           TEH02015
077200         88  WS-ORSSHHOF-DUPREC              VALUE 'D'.           TEH02015
077300     05  WS-LU6ORH-ERROR-SW      PIC X(1).                        MCV94235
077400         88  WS-LU6ORH-ERROR-ALL-OK          VALUE ' '.                   
077500     05  WS-LU6ORH-WARNING-SW    PIC X(1).                        ROR99015
077600         88  WS-LU6ORH-WARNING-ALL-OK        VALUE ' '.           ROR99015
077700     05  WS-LU6ORH-ERROR-FLAG    PIC X(02).                       ROR99135
077800         88  WS-LU6ORH-ERROR-NO-ERRORS       VALUE '  '.          ROR99135
077900     05  WS-WARN-BASERATE-ON-SW  PIC X(01)   VALUE SPACES.        TKC02151
078000         88 WS-WARN-BASERATE-ON              VALUE 'K'.           TKC02151
078100     05  WS-SHIP-TO-ADDRESS-SW   PIC X(1).                        MCV95136
078200         88  WS-SHIP-TO-ADDRESS              VALUE 'Y'.           MCV95136
078300         88  WS-NO-SHIP-TO-ADDRESS           VALUE 'N'.           MCV95136
078400     05  WS-SPCL-ADDRESS-SW      PIC X(1).                        TKC07194
078500     05  WS-SHIP-TO-ADDRESS-SPCL PIC X(1).                        TKC07194
078501     05  WS-SHIP-TO-ATTNAME-SPCL PIC X(1).                        TKC07194
078502     05  WS-CUSMSC-IO-SW         PIC X(1)        VALUE ' '.       ROR99015
078503         88  WS-CUSMSC-NORESP                    VALUE 'Y'.       ROR99015
078600         88  WS-CUSMSC-NOTFND                    VALUE 'N'.       ROR99015
078700     05 WS-GOV-REC-SW            PIC X VALUE ' '.                 ROR99015
078800         88 WS-GOV-REC-FND                  VALUE 'Y'.            ROR99015
078900     05 WS-CARR-ENTERED-SW       PIC X VALUE 'Y'.                 ROR00326
079000         88 WS-CARR-NOT-ENTERED             VALUE 'N'.            JDN99097
079100         88 WS-CARR-WAS-ENTERED             VALUE 'Y'.            JDN99097
079200*  RIGHT NOW WE HAVE THESE FIELDS HERE.                           ROR05314
079300*  BUT IN FUTURE , WE WILL MOVE THEM TO A COMMON COPYBOOK  THAT   ROR05314
079400*   WILL BE USED IN ALL I/L PROGRAMS.                             ROR05314
079500*                                                                 ROR05314
079600*  MIGHT HAVE ISSUES WITH USING "LACM" IN TERM-ID FIELD           ROR05314
079700*   REALTED TO FREIGHT CALCULATIONS.    NEED TO DO MORE RESEARCH  ROR05314
079800*                                                                 ROR05314
079900     05  WS-FRT-OUT-CHG-TERM-ID  PIC X(04).                       ROR05314
080000         88 WS-FRT-OUT-CHG-OK              VALUES 'LACM' 'ITRK'   ROR08057
080100                                                  'GSSW' 'G360'   ROR17307
080200                                                  'EUCM' 'WEB2'   RP119284
                                                        'VENP' 'PWRS'   PYN22112
                                                        'IMC1'.         PYN22112
080300     05  WS-FRT-FWD-CHG-TERM-ID  PIC X(04).                       ROR05314
080400         88 WS-FRT-FWD-CHG-OK              VALUES 'LACM' 'ITRK'   ROR15156
080500                                                  'GSSW' 'G360'   KXD19305
                                                        'PWRS' 'IMC1'.  PYN22112
080600     05  WS-TERMS-CHG-TERM-ID    PIC X(04).                       ROR05314
080700         88 WS-TERMS-CHG-OK                VALUES 'LACM' 'ITRK'   ROR11131
080800                                                  'GSSW' 'G360'   ROR17307
080900                                                  'PRSM' 'EUCM'   DXB19123
080900                                                  'VENP' 'VRPO'   KXD19305
                                                        'PWRS' 'HERM'   PYN22112
                                                        'BRIM'          SS122155
                                                        'IMC1'.         PYN22112
081000     05  WS-TERM-ID-CHG-TERM-ID  PIC X(04).                       ROR05314
081100         88 WS-TERM-ID-CHG-OK              VALUES 'LACM' 'ITRK'   ROR08283
081200                                                  'GSSW' 'G360'   ROR17307
081300                                                  'EUCM' 'SAPO'   FXS17203
081400                                                  'HERM' 'VENP'   KXD19278
                                                        'RPD2' 'VRPO'   KXD19305
                                                        'PWRS' 'CBLU'   RP120241
                                                        'RNEW' 'SBRM'   SS122155
                                                        'BRIM' 'XVFC'   RP122238
                                                        'RNEW' 'IMC1'   VYM23049
                                                        'BRLK'.         VYM23049
081500     05  WS-TERM-ID              PIC X(04).                       ROR08283
081600         88 WS-TERM-ID-FROM-IMTELLITRACK   VALUES 'ITRK'.         ROR08283
081700         88 WS-TERM-ID-FROM-GSS-WORKFLOW   VALUES 'GSSW'.         ROR15156
081800         88 WS-TERM-ID-FROM-LATIN-CRM      VALUES 'LACM'.         ROR08283
081900         88 WS-TERM-ID-FROM-EUROPE-CRM     VALUES 'EUCM'.         ROR08283
082000         88 WS-TERM-ID-FROM-SAP            VALUES 'SAPO'.         ROR10293
082100         88 WS-TERM-ID-FROM-WEB-ENDEAVOUR  VALUES 'WEB2'.         ROR15254
               88 WS-TERM-ID-FROM-WEB-MOBILE     VALUES 'WEBM'.         ROR19067
082200         88 WS-TERM-ID-PCG                 VALUES 'WEBX' 'WEBS'   NZP20304
                                                        'GRPA' 'WTDP'.  NZP21261
082202         88 WS-TERM-ID-FROM-API-SIMPLI     VALUES 'WEBS'.         AZD18124
082203         88 WS-TERM-ID-FROM-IM360          VALUES 'G360'.         ROR17307
               88 WS-TERM-ID-FROM-X4A            VALUES 'TRNW' 'TREG'   RP123216
                                                        'TQ2O' 'TPLA'.  RP123216
               88 WS-TERM-ID-FROM-IMCORE         VALUES 'IMC1'.         PYN22112
               88 WS-TERM-ID-FROM-BRLK           VALUES 'BRLK'.         VYM23049
082204         88 WS-TERM-ID-FROM-IMVND          VALUES 'VENP'.         DXB19019
082205         88 WS-TERM-ID-FROM-HERMES         VALUES 'HERM'.         ROR17307
082205         88 WS-TERM-ID-FROM-SAP-ROLLOUTS   VALUES 'RPD2'.         KXD19278
082205         88 WS-TERM-ID-FROM-POWER-APPL     VALUES 'PWRS'.         KXD19305
082205         88 WS-TERM-ID-FROM-VRP            VALUES 'VRPO'.         MPP19263
082205         88 WS-TERM-ID-FROM-CLOUD-BLUE     VALUES 'CBLU'.         VXA19305
082204         88 WS-TERM-ID-FROM-IMRNV          VALUES 'RNEW'.         RP120241
082204         88 WS-TERM-ID-GRPA                VALUES 'GRPA'.         NZP20304
               88 WS-TERM-ID-WTDP                VALUES 'WTDP'.         NZP21261
               88 WS-TERM-ID-SAP-BRIM            VALUES 'BRIM'.         SS122155
               88 WS-TERM-ID-SAP-BRIM-1          VALUES 'SBRM'.         SS122155
082300     05  WS-INPUT-SOURCE         PIC X(04).                       ROR07317
082400         88 WS-FROM-SUBSTATION             VALUES 'SXEX' '#RED'.  VXA20304
082500         88 WS-FROM-SOLA                   VALUES 'XXXX'.         ROR07317
082501         88 WS-FROM-RPC                    VALUES 'CPMI'.         ROR07317
082502     05 WS-DEFAULT-CARRIER       PIC X(2)  VALUE SPACES.          ROR00326
082503     05 WS-ST-DEF-CAR            PIC X(2)  VALUE SPACES.          ROR01068
082504     05 WS-ST-ALT-DEF-CAR        PIC X(2)  VALUE SPACES.          ROR01068
082505     05 WS-ST-FRT-OUT-CODE       PIC X(1)  VALUE SPACES.          ROR01068
082506     05 WS-BT-DEF-CAR            PIC X(2)  VALUE SPACES.          ROR01068
082507     05 WS-BT-ALT-DEF-CAR        PIC X(2)  VALUE SPACES.          ROR01068
082508     05 WS-BT-FRT-OUT-CODE       PIC X(1)  VALUE SPACES.          ROR01068
082509     05 WS-BT-STATE-CODE         PIC X(2)  VALUE SPACES.          NXC17174
082510     05 WS-ST-STATE-CODE         PIC X(2)  VALUE SPACES.          NXC17174
082511     05 WS-ORHOF-INDIA-SHIP-TO-STATE   PIC X(2)  VALUE SPACES.    NXC17174
082512     05 WS-NON-STD-FLAG          PIC X(1)  VALUE SPACES.          SXG03059
082513     05 WS-CAPS-ID-CODE          PIC X(4)  VALUE SPACES.          ROR01116
082514     05 WS-TAX-FLAG              PIC X(1)   VALUE ' '.            ROR99015
082515     05 WS-RESPONSE-FLAG         PIC X(1)   VALUE ' '.            ROR99015
082516     05 WS-ERROR-FLAG            PIC X(1)   VALUE ' '.            ROR99015
082517     05 WS-THIRD-PARTY-FLAG      PIC X(12)  VALUE ' '.            ROR99015
082518     05 WS-THIRD-PARTY-FLAG1     PIC X(12)  VALUE ' '.            ROR99015
           05 WS-THPTY-ACCT-NBR        PIC X(12)  VALUE SPACES.         SS123265
082519     05 WS-FIRM-NAME-IN          PIC X(50)  VALUE SPACES.         TKC07345
082520     05 WS-SHIP-TO-FIRM-NAME     PIC X(50)  VALUE SPACES.         ROR02318
082521     05 WS-SHIP-TO-ADDRESS1      PIC X(35)  VALUE ' '.            ROR99015
082522     05 WS-SHIP-TO-ADDRESS2      PIC X(35)  VALUE ' '.            ROR99015
082523     05 WS-SHIP-TO-CITY          PIC X(21)  VALUE ' '.            ROR99015
082524     05 WS-SHIP-TO-STATE         PIC X(02)  VALUE ' '.            ROR99015
082525     05 WS-SHIP-TO-ZIP           PIC X(09)  VALUE ' '.            ROR99015
082526     05 WS-TO-COUNTRY-CODE       PIC X(02)   VALUE SPACES.        TKC04099
082527     05 WS-EXP-BI-STATE          PIC X(02)   VALUE SPACES.        ROR00080
082528     05 WS-EXP-BI-CNTRY          PIC X(02)   VALUE SPACES.        ROR00080
082529     05 WS-EXP-BI-CNTRY-CODE     PIC X(02)   VALUE SPACES.        ROR00080
082530     05 WS-EXP-SI-STATE          PIC X(02)   VALUE SPACES.        ROR00080
082531     05 WS-EXP-SI-CNTRY          PIC X(02)   VALUE SPACES.        ROR00080
082532     05 WS-EXP-SI-CNTRY-CODE     PIC X(02)   VALUE SPACES.        ROR00080
082533     05 WS-EXP-ST-STATE          PIC X(02)   VALUE SPACES.        ROR99350
082534     05 WS-EXP-ST-CNTRY          PIC X(02)   VALUE SPACES.        ROR99350
082535     05 WS-EXP-ST-CNTRY-CODE     PIC X(02)   VALUE SPACES.        ROR99350
082536     05 WS-EXP-SHIPTO-CNTRY      PIC X(02)   VALUE SPACES.        ROR04064
082537     05  WS-BI-EXPORT-ORD-SW     PIC X(01)  VALUE SPACES.         ROR00115
082538         88 ITS-BILL-TO-EXPORT-ORDER        VALUE 'Y'.            ROR00199
082539     05  WS-ST-EXPORT-ORD-SW     PIC X(01)  VALUE SPACES.         ROR00199
082600         88 ITS-SHIP-TO-EXPORT-ORDER        VALUE 'Y'.            ROR00199
082700     05  WS-ST-ADDRESS-SW        PIC X(01)  VALUE SPACES.         ROR00199
082800         88 ITS-NO-SHIPPING-ADDR-ORDER      VALUE 'Y'.            ROR00199
082900     05  WS-SCHEDULE-DLI-SW      PIC X(01)  VALUE 'Y'.            ROR00199
083000         88 ITS-FIRST-TIME-SCHEDULING       VALUE 'Y'.            ROR00199
083100         88 ITS-NOT-FIRST-TIME-SCHEDULING   VALUE 'N'.            ROR00199
083200     05  WS-CHECK-DB-AVAIL-SW    PIC X(01)  VALUE 'Y'.            ROR00199
083300         88 CHECK-DATABASE-AVAIL-YES        VALUE 'Y'.            ROR00199
083400         88 CHECK-DATABASE-AVAIL-NO         VALUE 'N'.            ROR00199
083500     05  WS-TERMS-ENTERED-SW     PIC X(01)  VALUE SPACES.         ROR00276
083600         88 VALID-TERMS-ENTERED             VALUE 'Y'.            ROR00276
083700     05  WS-ACTIVE-FFR-SW          PIC X(1)  VALUE ' '.           ROR05167
083701         88  ACTIVE-FFR                      VALUE 'Y'.           ROR05167
083702     05  WS-ORDER-COMMING-FROM   PIC X(01)  VALUE SPACE.          ROR01152
083800         88 ITS-A-WEB-ORDER                 VALUE 'I'.            ROR01152
083900         88 ITS-AN-INSIDELINE-ORDER         VALUE 'L'.            ROR01152
084000     05  WS-SAP-ACCOUNT-SW       PIC X(01)  VALUE 'N'.            ROR10293
084100         88 ITS-A-SAP-ACCT                  VALUE 'Y'.            ROR10293
084101         88 ITS-NOT-A-SAP-ACCT              VALUE 'N'.            ROR10293
084102     05  PART-SUB                PIC S9(04) COMP  VALUE ZEROES.   ROR00199
084103     05  OUT-SUB                 PIC S9(04) COMP  VALUE ZEROES.   ROR00199
084200     05  WS-ZIP-CODE-IN.                                          ROR00199
084300         10  WS-ZIP-IN           PIC X(01) OCCURS 9 TIMES.        ROR00199
084400     05  WS-ZIP-CODE-OUT.                                         ROR00199
084500         10  WS-ZIP-OUT          PIC X(01) OCCURS 9 TIMES.        ROR00199
084600     05  WS-CUM-TAX-EXEMPT-KEY.                                   ROR99350
084700         10  WS-SEGMENT-TYPE     PIC X.                           ROR99350
084800         10  WS-CUM-EXEMPT-SUFFIX                                 ROR99350
084900                                 PIC X(3).                        ROR99350
085000         10  WS-CUM-EXEMPT-TYPE  PIC X.                           ROR99350
085100             88  WS-CUM-FED-EXEMPT          VALUE 'F'.            ROR99350
085200             88  WS-CUM-PRO-EXEMPT          VALUE 'P'.            ROR99350
085300         10  FILLER              PIC X(11).                       ROR99350
085400     05  WS-JULIAN-DATE          PIC S9(05) COMP-3 VALUE ZEROS.   ROR99350
085500     05  WS-EMSHED-SLM-IO-SW     PIC X(1)   VALUE ' '.            ROR11124
085600         88  WS-EMSHED-NORESP               VALUE 'Y'.            ROR11124
085700         88  WS-EMSHED-NOTFND               VALUE 'N'.            ROR11124
085800     05  WS-ORHOF-C1-GENERAL-ADDR-RC       PIC X(01).             ROR17111
085900     05  WS-ORHOF-C1-SUFFIX-MATCH-RC       PIC X(01).             ROR17111
086000     05  WS-ORHOF-C1-CORRECTNESS-IND       PIC X(01).             ROR17111
086100     05  WS-ORHOF-C1-DIRECT-MATCH-RC       PIC X(01).             ROR17111
086200     05  WS-ORHOF-C1-APTMNT-MTCH-RC        PIC X(01).             ROR17111
086300     05  WS-CUSTOMER-GST-ERROR-SW PIC X(1)   VALUE ' '.           NXC17174
086400         88  WS-CUSTOMER-GST-ERROR           VALUE 'Y'.           NXC17174
086500     05  WS-SHIP-TO-GST-STATE-SW   PIC X(1)  VALUE ' '.           NXC17174
086600         88  WS-SHIP-TO-GST-STATE            VALUE 'Y'.           NXC17174
086700     05  WS-BILL-TO-GST-STATE-SW   PIC X(1)  VALUE ' '.           NXC17174
086800         88  WS-BILL-TO-GST-STATE            VALUE 'Y'.           NXC17174
           05  WS-NP-ORDER-IND-SW        PIC X(1)  VALUE ' '.           MS221281
               88  WS-NP-ORDER-IND                 VALUE 'Y'.           MS221281
086801 01 WS-ENTER-ADDRESS.                                             ROR17111
086802     05 WS-ENTER-SHIP-TO-FIRM-NAME PIC X(50)  VALUE SPACES.       ROR17111
086803     05 WS-ENTER-SHIP-TO-ADDRESS1  PIC X(35)  VALUE SPACES.       ROR17111
086804     05 WS-ENTER-SHIP-TO-ADDRESS2  PIC X(35)  VALUE SPACES.       ROR17111
086805     05 WS-ENTER-SHIP-TO-ADDRESS3  PIC X(35)  VALUE SPACES.       ROR17111
086806     05 WS-ENTER-SHIP-TO-CITY      PIC X(21)  VALUE SPACES.       ROR17111
086807     05 WS-ENTER-SHIP-TO-STATE     PIC X(02)  VALUE SPACES.       ROR17111
086808     05 WS-ENTER-SHIP-TO-ZIP       PIC X(09)  VALUE SPACES.       ROR17111
086809     05 WS-ENTER-TO-COUNTRY-CODE   PIC X(02)  VALUE SPACES.       ROR17111
086810                                                                  ROR17111
086820 01  WS-CODE1-WORK-VARIABLES.                                     ROR17111
086840     05  WS-BYPASS-CODE1-SW      PIC X(01) VALUE SPACES.          ROR17111
086850     05  WS-AUDIT-CODE1-SW       PIC X(01) VALUE SPACES.          ROR17111
           05  WS-COUNT-CMODE          PIC S9(04) COMP.                 NXC24264
           05  WS-COUNT-CNTRY          PIC S9(04) COMP.                 NXC24264
           05  WS-COUNT-ZIP            PIC S9(04) COMP.                 NXC24264
           05  WS-COUNT-CCODE          PIC S9(04) COMP.                 NXC24264
086890     05  WS-CD1-ORDER-NBR        PIC X(05) VALUE SPACES.          ROR17111
086900     05  WS-CD1-ZIPCODE          PIC X(09) VALUE SPACES.          ROR17111
087000     05  WS-CD1-COUNTRY          PIC X(02) VALUE SPACES.          ROR17111
087100     05  WS-CD1-FRTO-CODE        PIC X(01) VALUE SPACES.          ROR17111
087200     05  WS-CD1-CARR-CODE        PIC X(02) VALUE SPACES.          ROR17111
087300     05  WS-ADRADT               PIC X(10) VALUE 'ADRADT    '.    ROR17111
087400     05  WS-ADRADT-LENGTH        PIC S9(4) COMP VALUE +600.       ROR17111
087500     05  WS-ADR-SEGMENT-NAME     PIC X(06) VALUE 'ORSSTO'.        ROR17111
087600     05  WS-CD1-BYP-MESSAGE      PIC X(50) VALUE SPACES.          ROR17111
087700     05  WS-ADR-RBA.                                              ROR17111
087800         10  WS-ADR-COMPANY      PIC X(02) VALUE SPACES.          ROR17111
087900         10  WS-ADR-CUST-BR      PIC X(02) VALUE SPACES.          ROR17111
088000         10  WS-ADR-CUST-NBR     PIC X(06) VALUE SPACES.          ROR17111
088100         10  WS-ADR-CUST-SUF     PIC X(03) VALUE SPACES.          ROR17111
088200         10  WS-ADR-ORDER-BR     PIC X(02) VALUE SPACES.          ROR17111
088300         10  WS-ADR-ORDER-NBR    PIC X(05) VALUE SPACES.          ROR17111
088400         10  WS-ADR-ORDER-DIST   PIC 9(01) VALUE ZERO.            ROR17111
088500         10  WS-ADR-ORDER-SHIP   PIC 9(01) VALUE ZERO.            ROR17111
088600                                                                  ROR17111
088700*                                                                 ROR05307
088800 01  WS-SELSRC-AREA.                                              ROR05307
088900     05  WS-SS-END-USER.                                          ROR05307
089000         10  WS-SS-EU-BR         PIC X(2).                        ROR05307
089100         10  WS-SS-EU-NBR        PIC X(6).                        ROR05307
089200     05  WS-SS-RESELLER.                                          ROR05307
089300         10  WS-SS-RESELLER-BR   PIC X(2).                        ROR05307
089400         10  WS-SS-RESELLER-NBR  PIC X(6).                        ROR05307
089500         10  WS-SS-RESELLER-SUF  PIC X(3).                        ROR05307
089600     05  WS-SS-ERROR-SW          PIC  X(01)   VALUE 'N'.          ROR05307
089700         88  WS-SS-ERROR-NOT-FOUND            VALUE 'N'.          ROR05307
089800         88  WS-SS-ERROR-MAST-NOT-FOUND       VALUE '1'.          ROR05307
089900         88  WS-SS-ERROR-EU-NOT-FOUND         VALUE '2'.          ROR05307
090000         88  WS-ERROR-RESELLER-NOT-FOUND      VALUE '4'.          ROR05307
090100         88  WS-ERROR-XREF-RESELLER-NFND      VALUE '5'.          ROR05307
090101         88  WS-SS-ERROR-DB-NOT-AVAIL         VALUE '9'.          ROR05307
090102***************************************************************** JJD95137
090103**  FIELDS FOR FRTCHK                                          ** JJD95137
090104***************************************************************** JJD95137
090105 01  WS-FRTCHK-FIELDS.                                            JJD95137
090106     05  WS-WHERE-SW             PIC X(1)  VALUE ' '.             JJD95137
090107     05  WS-FED-WARN-SW          PIC X(1)  VALUE ' '.             JJD95137
090108     05  WS-GPS-SAVER            PIC X(1)  VALUE ' '.             JJD95137
090109     05  WS-ERROR-MESSAGE        PIC X(30) VALUE ' '.             JJD95137
090110     05  WS-ZONE-SW              PIC X(1)  VALUE ' '.             JJD95137
090111         88  WS-ZONE-FOUND                 VALUE 'Y'.             JJD95137
090112     05  WS-ZONE.                                                 JJD95137
090113         10  WS-ZONE1            PIC X(1) VALUE ' '.              JJD95137
090114         10  WS-ZONE2            PIC X(1) VALUE ' '.              JJD95137
090115     05  WS-ZONE-ERROR-SW        PIC X(1) VALUE ' '.              JJD95137
090116     05  WS-SAVE-ZIP             PIC S9(9) COMP-3 VALUE ZEROES.   JJD95137
090117     05  WS-WORK-ZIP-X           PIC X(09) VALUE SPACES.          JJD95137
090118     05  WS-WORK-ZIP REDEFINES WS-WORK-ZIP-X.                     JJD95137
090119         10  WS-WORK-ZIP-N       PIC 9(05).                       JJD95137
090120         10  FILLER              PIC X(04).                       JJD95137
090121 01  WS-ADDRESS-LINE4.                                            RMF95207
090122     05  WS-CITY-L               PIC X(21) VALUE SPACES.          ROR99314
090123     05  FILLER                  PIC X(01).                       RMF95207
090124     05  WS-ST-L                 PIC X(02) VALUE SPACES.          ROR99314
090125     05  FILLER                  PIC X(01).                       RMF95207
090126     05  WS-ZIP.                                                  RMF95207
090127         10  WS-ZIP-L            PIC X(05) VALUE SPACES.          ROR99314
090128         10  WS-ZIP-L2           PIC X(04) VALUE SPACES.          ROR99314
090129     05  FILLER                  PIC X(01).                       RMF95207
090130     05  WS-GEO-CODE             PIC X(09) VALUE SPACES.          ROR99314
090131     05  FILLER                  PIC X(07).                       RMF95207
090132                                                                  RMF95207
090133 01  WS-SHIP-TO-GEO              PIC X(09) VALUE SPACES.          RMF95207
090134 01  WS-CITY-ZIP-UNMATCH         PIC X(01) VALUE SPACES.          RMF95207
090135 01  WS-LK-ACTION-CD             PIC X(02) VALUE SPACES.          RMF95207
090136 01  WS-VSUB                     PIC 9(02) VALUE ZEROS.           RMF95207
090137 01  WS-HOLD-VTX-INVOICE-NO      PIC X(12) VALUE SPACES.          RMF95207
090138 01  WS-HOLD-VTX-SEQ-NO          PIC 9(04) VALUE ZEROS.           RMF95207
090139                                                                  RMF95207
090140 01  WS-SWITCHES.                                                 SXK96332
090141     05  WS-BILL-PAY-SW          PIC X(1).                        SXK96332
090142         88  WS-BILL-CUST                            VALUE 'B'.   SXK96332
090143         88  WS-INGRAM-PAYS                          VALUE 'P'.   SXK96332
090144 COPY CUWTHIRD.                                                   SXG04030
090145 COPY SYW601.                                                     GCH00153
090146*                                                                 SXK96332
090147 01  WS-WORK-AREAS.                                               SXK96332
090148     05  WS-DISTRIBUTION.                                         SXK96332
090200         10  WS-DIST-NBR         PIC 9.                           SXK96332
090300         10  WS-SHIP-NBR         PIC 9.                           SXK96332
090400     05  WS-DISTRIBUTION-X REDEFINES WS-DISTRIBUTION              SXK96332
090500                                 PIC 99.                          SXK96332
090600         88  WS-ALL-DISTRIBUTIONS            VALUE 99.            SXK96332
090700                                                                  SXK96332
090800     05  WS-HOLD-CARRIER         PIC X(2)  VALUE SPACES.          SXK98180
090900     05  WS-HOLD-AW              PIC X(2)  VALUE SPACES.          SXK98180
091000     05  WS-HOLD-SF              PIC X(2)  VALUE SPACES.          SXK98180
091100     05  WS-HOLD-INI-PRICING-FLAG PIC X    VALUE SPACES.          SXK98180
091200     05  WS-TAB-SET.                                              SXK98180
091300         10  WS-TAB-ZIP          PIC X(5)    VALUE SPACES.        SXK98180
091400         10  WS-TAB-ZONE         PIC X(2)    VALUE SPACES.        SXK98180
091500     05  WS-5-ZIP                PIC X(5).                        SXK98180
091600     05  WS-MASK5                PIC 99999.                       SXK98180
091700     05  WS-HOLD-ZIP             PIC 99999 VALUE ZEROES.          SXK98180
091800     05  WS-HO-AREA              PIC 9999999 VALUE ZEROES.        SXK98180
091900     05  WS-HIGH-AREA            PIC X(4).                        SXK98180
092000     05  WS-ZIP-NUM              PIC S9(9) COMP-3 VALUE ZEROES.   SXK98180
092100     05  Z-SUB3                  PIC S9(4)   VALUE +0      COMP.  SXK98180
092200     05  Z-SUB4                  PIC S9(4)   VALUE +0      COMP.  SXK98180
092300     05  S-SUB                   PIC S9(4)   VALUE +0      COMP.  SXK98180
092400     05  SUB2                    PIC S9(4)   VALUE +0      COMP.  SXK98180
092500     05  WS-UPS-BLUE-TABLE-ENTRY PIC S9(4)   VALUE +33     COMP.  SXK98180
092600     05  WS-UPS-RED-TABLE-ENTRY  PIC S9(4)   VALUE +7      COMP.  SXK98180
092700     05  WS-OEMQTYI              PIC 9(07)   VALUE ZEROES.        SXK98180
092800     05  WS-POSTCODE-UK.                                          SXK98180
092900         10  WS-POSTCODE-PREFIX  PIC X(4)   VALUE SPACES.         SXK98180
093000         10  WS-POSTCODE-SUFFIX  PIC X(3)   VALUE SPACES.         SXK98180
093100     05  WS-L1                   PIC 9(01)  VALUE ZEROES.         ROR99314
093200     05  WS-L2                   PIC 9(02)  VALUE ZEROES.         ROR99314
093300*    05  WS-POSTAL-CODES         PIC X(07)  VALUE SPACES.         VXA19214
093300     05  WS-POSTAL-CODES         PIC X(08)  VALUE SPACES.         VXA19214
093400     05  WS-POST-4 REDEFINES WS-POSTAL-CODES.                     SXK98180
093500         10  WS-PCODE-4          PIC 9(04).                       SXK98180
093600*        10  FILLER              PIC X(03).                       VXA19214
093600         10  FILLER              PIC X(04).                       VXA19214
093700     05  WS-POST-5 REDEFINES WS-POSTAL-CODES.                     SXK98180
093800         10  WS-PCODE-5          PIC 9(05).                       SXK98180
093900*        10  FILLER              PIC X(02).                       VXA19214
093900         10  FILLER              PIC X(03).                       VXA19214
094000     05  WS-POST-3 REDEFINES WS-POSTAL-CODES.                     SXK98180
094100         10  WS-PCODE-3          PIC 9(03).                       SXK98180
094200         10  WS-SPACE-3          PIC X(01).                       SXK98180
094300         10  WS-PCODE-2          PIC 9(02).                       SXK98180
               10  FILLER              PIC X(02).                       VXA19214
094400     05  WS-POST-2 REDEFINES WS-POSTAL-CODES.                     SXK98180
094500*        10  FILLER              PIC X(04).                       VXA19214
094500         10  FILLER              PIC X(05).                       VXA19214
094600         10  WS-PCODE-1A         PIC X(01).                       SXK98180
094700         10  WS-PCODE-2A         PIC X(02).                       SXK98180
094800     05  WS-POST-F REDEFINES WS-POSTAL-CODES.                     SXK98180
094900         10  WS-PCODE-F          PIC 9(03).                       SXK98180
095000*        10  FILLER              PIC X(04).                       VXA19214
095000         10  FILLER              PIC X(05).                       VXA19214
095100     05  WS-POST-B REDEFINES WS-POSTAL-CODES.                     SXK98180
095200         10  WS-PCODE-B-L        PIC X(02).                       SXK98251
095300         10  WS-PCODE-B          PIC 9(04).                       SXK98180
095400*        10  FILLER              PIC X(01).                       VXA19214
095400         10  FILLER              PIC X(02).                       VXA19214
095500     05  WS-POST-NL.                                              SXK98180
095600         10  WS-PCODE-NL1        PIC X(04) VALUE SPACES.          ROR99350
095700         10  WS-PCODE-NL2        PIC X(02) VALUE SPACES.          ROR99350
095800         10  FILLER              PIC X(04) VALUE SPACES.          ROR99350
095900     05  WS-EUR-POSTAL           PIC  X(09)  VALUE SPACES.        SXK98251
096000     05  WS-BR-N                 PIC  9(2) VALUE ZEROS.           SXK98180
096100     05  WS-SAVE-CC              PIC X(2)  VALUE '  '.            SXK98180
096200     05  WS-HOME-BR              PIC X(2)  VALUE '  '.            SXK98180
096300     05  SUB                     PIC S9(4) COMP  VALUE +0.        SXK98180
096400     05  WS-BR-SUB               PIC S9(4) COMP  VALUE +0.        SXK98180
096500     05  WS-ZERO                 PIC S9(1)     COMP-3 VALUE +0.   SXK98180
096600     05  WS-SHIP-TO          PIC X(03) VALUE SPACES.              SXK98180
096700     05  WS-SHIP-FROM        PIC X(02) VALUE SPACES.              SXK98180
096800     05  WS-SHIP-FROM-CO     PIC X(02) VALUE SPACES.              SXK98180
096900     05  WS-COUNTRY-CODE-SW      PIC X(1)  VALUE 'N'.             SXK98180
097000         88  WS-GOOD-COUNTRY               VALUE 'Y'.             SXK98180
097100     05  WS-CNTRY-CODE           PIC X(2)  VALUE SPACES.          SXK98180
097200     05  WS-COUNTRY-CODE         PIC X(2)  VALUE SPACES.          SXK98180
097210     05  WS-BRANCH-SHIP-SUF      PIC X(03) VALUE SPACES.          ROR07317
097300     05  WS-POSTAL-CITY          PIC X(21) VALUE SPACES.          ROR99314
097400     05  WS-POSTAL-CITYR REDEFINES WS-POSTAL-CITY.                SXK98180
097500         10  WS-POSTAL-7         PIC X(07).                       SXK98180
097600         10  WS-CITY-14          PIC X(14).                       SXK98180
097700     05  WS-POSTAL-CITY5 REDEFINES WS-POSTAL-CITY.                PZD15128
097800         10  WS-POSTAL-5         PIC X(05).                       PZD15128
097801         10  WS-CITY-16          PIC X(16).                       PZD15128
097802     05  WS-POSTAL-CITY-NL       PIC X(21) VALUE SPACES.          ROR99314
097803     05  WS-POSTAL-CITNL REDEFINES WS-POSTAL-CITY-NL.             SXK98251
097900         10  WS-POSTAL-11        PIC X(11).                       SXK98251
098000         10  WS-CITY-10          PIC X(10).                       SXK98251
098100     05  WS-ST-ZIP-CODE.                                          ROR06194
098200         10  WS-ST-ZIP-5         PIC X(05) VALUE SPACES.          ROR06194
098201         10  WS-ST-ZIP-4         PIC X(04) VALUE SPACES.          ROR06194
098202     05 WS-WWT3ACT-IO-SW         PIC X(01)      VALUE ' '.        TKC05031
098203        88 WS-WWT3ACT-FOUND                     VALUE 'Y'.        TKC05031
098300        88 WS-WWT3ACT-NOT-FOUND                 VALUE 'N'.        TKC05031
098400        88 WS-WWT3ACT-DUPLICATE                 VALUE 'D'.        TKC05031
098500        88 WS-WWT3ACT-ERROR                     VALUE 'E'.        TKC05031
098600*                                                                         
098700 01  WS-INSP-ADDRESS.                                             SXK98180
098800     05  WS-INSP-ADDR1           PIC X(50).                       SXK98180
098900     05  WS-INSP-ADDR2           PIC X(50).                       SXK98180
099000     05  WS-INSP-ADDR3           PIC X(50).                       SXK98180
099100     05  WS-INSP-ADDR4           PIC X(50).                       SXK98180
099200     05  WS-INSP-ADDR5           PIC X(50).                       SXK98180
099300     COPY ORWTNTCC.                                               MXB00160
099400 01  WS-VALIDATE-APO-ZIP-ST.                                      SXK99015
099500     10  WS-VALID-APO-ZIP      PIC 9(9).                          SXK99015
099600         88  WS-VALID-AE-ZIP   VALUE 090010000 THRU 099990000.    TEH20017
099700         88  WS-VALID-AA-ZIP   VALUE 340010000 THRU 340990000.    SXK99015
099800         88  WS-VALID-AP-ZIP   VALUE 962010000 THRU 966990000.    ROR05307
099900     10  WS-VALID-APO-ST       PIC X(2).                          SXK99015
100000         88  WS-VALID-APO      VALUE 'AA' 'AE' 'AP' 'PR'.         BYA21023
100100         88  WS-VALID-AA-ST    VALUE 'AA'.                        ROR05307
100200         88  WS-VALID-AE-ST    VALUE 'AE'.                        ROR05307
100210         88  WS-VALID-AP-ST    VALUE 'AP'.                        ROR05307
100210         88  WS-VALID-PR-ST    VALUE 'PR'.                        BYA21023
100300     10  WS-APO-FPO-FLAG       PIC X(1) VALUE SPACES.             SXK99015
100400         88  WS-APO-FPO-ORDER  VALUE 'Y'.                         SXK99015
100500 01  WS-TABLE-CARRIER.                                            SXK96332
100600     10  WS-TBL-ENTRY    OCCURS 21 TIMES.                         SXK96332
100700         15  WS-DISP-CARR-CODE PIC X(2).                          SXK96332
100800         15  WS-DISP-SPACE     PIC X(1).                          SXK96332
100900         15  WS-DISP-CARR-NAME PIC X(20).                         SXK96332
101000     COPY TBISTART.                                               SXK96332
101100 01  STAX-LINK-AREA.                                              RMF95207
101200     05   WS-GENERAL              PIC X(50).                      RMF95207
101300                                                                  RMF95207
101400 COPY VTKTAX.                                                     RMF95207
101500*                                                                         
101600     COPY TBIMAF.                                                 JJD95137
101700     COPY TBIMAN.                                                 JJD95137
101800     COPY TBIARRVS.                                               ROR99277
101900     COPY TBITELIS.                                               ROR99277
102000     COPY TBIVALUE.                                               SXG03305
102100     COPY TBICONR.                                                SXG03247
102200     COPY TBICUSXP.                                               ROR04216
102210     COPY TBISAPC2.                                               ROR10293
           COPY TBIINLN.                                                TZM22231
           COPY TBIINLN2.                                               MXU26198
102300     COPY ORRFFR.                                                 ROR05167
102301     COPY ORKFFR.                                                 ROR05167
102302     COPY ORRZNE.                                                 JJD95137
102400     COPY ORKZNE.                                                 JJD95137
102500     COPY FEDEX.                                                  JJD95137
102600     COPY ORKFED.                                                 JJD95137
102700     COPY ZONEB.                                                  JJD95137
102800     COPY ZONER.                                                  JJD95137
102900     COPY NCARRWS.                                                JJD95137
103000     COPY BPKMST.                                                         
103100     COPY BPRMST.                                                         
103200     COPY CBKLUL.                                                         
103300     COPY CBRLUL.                                                         
103400     COPY CUKADR.                                                         
103500     COPY CUKBRN.                                                         
103600     COPY CUKHEAD.                                                        
103700     COPY CUSADR.                                                         
103800     COPY CUSBRN.                                                         
103900     COPY CUSHED.                                                         
104000     COPY CUSHEDOF.                                               TEH04167
104100     COPY CUKHEDOF.                                               TEH04167
104200     COPY DLXFUNC.                                                        
104300     COPY CORORH.                                                 PXP95004
104400     COPY INSHED.                                                 PWL96284
104500     COPY ORKHEAD.                                                        
104600     COPY ORKHEDOF.                                               TEH02015
104700     COPY ORKSHH.                                                         
104800     COPY ORKSHHOF.                                               TEH02015
104900     COPY ORKSTO.                                                         
105000     COPY ORSHED.                                                         
105100     COPY ORSHEDOF.                                               TEH02015
105200     COPY ORSSHH.                                                         
105300     COPY ORSSHHOF.                                               TEH02015
105400     COPY ORSLNE.                                                 PWL96284
105500     COPY ORSSTO.                                                         
105600     COPY RWKHDS.                                                 FVB00101
105700     COPY RWRHDS.                                                 FVB00101
105800     COPY RWWCKHD.                                                FVB00101
105900     COPY SYKCOM.                                                         
106000     COPY SYWEIB.                                                         
106100     COPY SYXCOM.                                                         
106200     COPY SYXCMOR.                                                ROK98106
106300     COPY SYR777C.                                                ROR99135
106400     COPY SYKPSTL.                                                ROR00080
106500     COPY SYRPSTL.                                                ROR00080
106600     COPY TBIBRAN.                                                PWL96284
106700     COPY TBIBRSEQ.                                               PWL96284
106800     COPY TBICARR.                                                        
106900     COPY TBIVALCC.                                               ROR06194
107000     COPY TBIVALPC.                                               ROR06194
107001     COPY WHWUKCC.                                                ROR06194
107002     COPY TBICAR2.                                                JJD98153
107003     COPY TBICAR3.                                                SXG04030
107100     COPY TBKIMD.                                                 MCV93334
107200     COPY TBRIMD.                                                 MCV93334
107300     COPY TBICORP.                                                PJD96346
107400     COPY TBIDIVRT.                                               PLB00269
107500     COPY CFW002.                                                 ROK98106
107600     COPY SYR001.                                                 ROK98106
107700     COPY   ORKPEB.                                               SXK98180
107800     COPY CUX080.                                                 ROR05307
107900     COPY SYWVCHAR.                                               ROR06117
108000     COPY SYWZIP.                                                 ROR06194
108100     COPY SYWTAT.                                                 KXA07030
108101     COPY TBIINTAX.                                               NXC17174
      *COPYBOOKS ADDED FOR SE8924 GLN IMPLEMENTATION                    AYB24152
           COPY EDT072.                                                 AYB24152
           COPY EDT414.                                                 AYB24152
           COPY EDT031.                                                 AYB24152
      *                                                                 AYB24152
      *COPYBOOKS ADDED FOR SE8512                                       VYP20304
           COPY SYKTAX.                                                 VYP20304
           COPY SYRTAX.                                                 VYP20304
                                                                        VYP20304
108102*                                                                 SXK98180
108103     COPY   ORRPEB                                                SXK98180
108104            REPLACING ==ORP-ORRPEB.==                             SXK98180
108105            BY  ==ORP-ORRPEB REDEFINES ORP-ORRPEB-1020-RECORD.==. SXK98180
108200*                                                                 SXK98180
108300     COPY TBIACOP.                                                ROR00115
108400     COPY CURDCC.                                                 SXK98180
108500     COPY CUWCCODE.                                               SXK98180
108600     COPY TBICNTRY.                                               SXK98180
108700     COPY TBICNTY2.                                               SXK98180
108800     COPY TBICORP2.                                               SXK98180
108810     COPY TBICORP3.                                               TEH05069
108820     COPY TBICORP4.                                               PKV09266
108830     COPY TBICORP5.                                               TKC07194
108840     COPY TBICORP6.                                               PKV09266
108840     COPY TBICORP7.                                               MS220220
108841     COPY TBISEC.                                                 ROR05314
108842     COPY TBIDMSKU.                                               TEH05069
108900     COPY TBITERMS.                                               SXK98205
109000     COPY ORWPCODE.                                               SXK98180
109010     COPY ORWUKCAR.                                               ROR06075
109100     COPY CURGEM.                                                 ROR99015
109200     COPY CUKGEM.                                                 ROR99015
109300     COPY TBIPRG.                                                 ROR99015
109400     COPY TBICOD1.                                                ROR17111
109500     COPY ADRADT.                                                 ROR17111
109501     COPY CANADACP.                                               ROR17111
109502*****COPY TBIUPS.                                                 RPM02110
109503     COPY SAWNEXUS.                                               ROR99015
109600     COPY TBIMAFC2.                                               ROR99015
109700     COPY TBISTCUS.                                               ROR99015
109800     COPY TBINEXUS.                                               ROR99015
109900     COPY CUSMSC.                                                 ROR99015
110000     COPY CUKMSC.                                                 ROR99015
110100     COPY TBIAGSEQ.                                               ROR99015
110200     COPY OERTSQA.                                                ROR99015
110300     COPY SYWBRSEQ.                                               ROR99015
110400     COPY TXWVERTX.                                               ROR99015
110500     COPY CUWGRP1.                                                ROR99015
110600     COPY CUWG1ERR.                                               ROR99015
110700     COPY P9IN.                                                   ROR99015
110800     COPY P9OUT.                                                  ROR99015
110900     COPY P9AUDIT.                                                ROR99015
111000     COPY DBAVAILW.                                               ROR00199
111100     COPY TBIPCODE.                                               ROR01116
111200     COPY TBIFRM.                                                 TKC03271
111300     COPY EMKHEDS4.                                               ROR11124
111301     COPY EMSHED.                                                 ROR11124
111302     COPY ORR688.                                                 ABM18216
           COPY TBIBRN4.                                                AXZ24292
      *THE BELOW ORDER NEEDS TO BE RETAINED AS IS                       BYA21127
           COPY TBIPGID.                                                BYA21127
           COPY TBIDPAS.                                                BYA21100
           COPY TBIOREAS.                                               SS122155
111303*                                                                 GTH96198
111400 01  RCV-BUFFER-AREA.                                             GTH96198
111500*                                                                 GTH96198
111600     05  RCV-TIME-STAMP-AREA.                                     GTH96198
111700         10  RCV-TIME-RECEIVED     PIC X(08)    VALUE SPACES.     GTH96198
111800         10  FILLER                PIC X(28)    VALUE SPACES.     GTH96198
111900     05  RCV-DATA-BUFFER-AREA.                                    GTH96198
112000         10  RCV-SYSTEM-ID         PIC X(02)    VALUE SPACES.     GTH96198
112100         10  FILLER                PIC X(49)    VALUE SPACES.     GTH96198
112200         10  RCV-TRAN-ID           PIC X(04)    VALUE SPACES.     GTH96198
112300         10  FILLER                PIC X(3909)  VALUE LOW-VALUES. GTH96198
112400                                                                          
112500                                                                          
112600*---- DB2 STUFF FOLLOWS ----------------------------------------* RPM02110
112700*---------------------------------------------------------------* RPM02110
112800*01  DB2-STATUS.                                                  RPM02110
112900     COPY DB2STAT.                                                RPM02110
113000                                                                          
113100*DB2 ERROR MESSAGE STORAGE AREAS.                                 RPM02110
113200     COPY SYWDB2ER.                                               RPM02110
113300     COPY DB2DLI.                                                 RPM02110
113400                                                                          
113500                                                                          
113600*--- DB2 RELATED STORAGE ---------------------------------------* RPM02110
113700*---------------------------------------------------------------* RPM02110
113800     EXEC SQL                                                     RPM02110
113900          INCLUDE SQLCA                                           RPM02110
114000     END-EXEC.                                                    RPM02110
114100                                                                  RPM02110
114200     EXEC SQL                                                     RPM02110
114300          INCLUDE WWT3ACT                                         TKC05031
114400     END-EXEC.                                                    RPM02110
114500                                                                          
114600                                                                          
114700                                                                  ROR17111
114800****************************************                          ROR17111
114900***CODE1 SUPPRESSION TABLE**************                          ROR17111
115000****************************************                          ROR17111
115100     EXEC SQL                                                     ROR17111
115200          INCLUDE ORTC1CUS                                        ROR17111
115300     END-EXEC.                                                    ROR17111
115400                                                                  ROR17111
115500     EXEC SQL                                                     ROR17111
115600          INCLUDE ORTC1MOD                                        ROR17111
115700     END-EXEC.                                                    ROR17111
115800                                                                  ROR17111
115900     EXEC SQL                                                     ROR17111
116000          INCLUDE ORTC1CAR                                        ROR17111
116100     END-EXEC.                                                    ROR17111
116200                                                                  ROR17111
116300     EXEC SQL                                                     ROR17111
116400          INCLUDE ORTC1CTR                                        ROR17111
116500     END-EXEC.                                                    ROR17111
116600                                                                  ROR17111
116700     EXEC SQL                                                     ROR17111
116800          INCLUDE ORTC1POS                                        ROR17111
116900     END-EXEC.                                                    ROR17111
116901                                                                  ROR17111
116902 LINKAGE SECTION.                                                 GTH96198
116903*                                                                 GTH96198
116904 01  DFHCOMMAREA   PIC  X(4000).                                  GTH96198
116905*                                                                         
116906 01  DFHSYXCM                    COPY SYXCMWS REPLACING           SXK96332
116907                                             ==01  WS-COMM-AREA== SXK96332
116908     BY ==    ==.                                                 SXK96332
116909                                 COPY SYWTCTUA.                   SXK96332
116910*                                                                         
116911                                 COPY DLIUIB2.                            
116912*                                                                         
116913 01  PCB-PTRS.                                                            
116914*                                                                         
116915     05  CUPCB-PTR               USAGE POINTER.                   DXO99330
116916     05  ORPCB-PTR               USAGE POINTER.                   DXO99330
116917     05  INPCB-PART-PTR          USAGE POINTER.                   DXO99330
116918     05  VNPCB-PTR               USAGE POINTER.                   DXO99330
116919     05  EMPCB-PTR               USAGE POINTER.                   DXO99330
116920     05  ORPCB-CUST-ORDER-PTR    USAGE POINTER.                   DXO99330
116921*                                                                         
116922         COPY ECWLINK.                                            DXO99330
116923         COPY DBAVAILL.                                           ROR00199
116924*                                                                         
117000 PROCEDURE DIVISION.                                                      
117100*                                                                         
117200     IF WS-REVISION-LEVEL-STAMP > ZERO                            TEH00115
117300         CONTINUE                                                 TEH00115
117400     END-IF.                                                      TEH00115
117500     INITIALIZE                          WS-ABEND-INFORMATION     MCV94235
117600                                         WS-LU6ORH-WARNING-SW     ROR99015
117700                                         WS-LU6ORH-ERROR-SW       MCV94235
117800                                         WS-LU6ORH-ERROR-FLAG     ROR99135
117900     MOVE LENGTH OF CORORH-LU62-ORDER-REQUEST                     PXP95004
118000                                      TO  WS-TS-REC-LENGTH.               
118100     IF EIBCALEN NOT = 0                                          GTH96198
118200         MOVE DFHCOMMAREA       TO RCV-BUFFER-AREA                GTH96198
118300                                (1:EIBCALEN)                      SXK97148
118400         MOVE RCV-BUFFER-AREA   TO CORORH-LU62-ORDER-REQUEST      GTH96198
118500* ----------  ANYTHING TO START WITH ? -----------------          GTH96198
118600         MOVE 'Y'               TO WS-CAMEIN-ON-LINK-SW           GTH96198
118700     ELSE                                                         GTH96198
118800         MOVE 'N'               TO WS-CAMEIN-ON-LINK-SW           GTH96198
118900*                                                                         
119000*--  RETRIEVE LU 6.2 ORDER HEADER DATA                                    
119100*                                                                         
119200     EXEC CICS RETRIEVE                                                   
119300          INTO       (CORORH-LU62-ORDER-REQUEST)                  PXP95004
119400          LENGTH     (WS-TS-REC-LENGTH)                                   
119500          RESP       (WS-EIBRESP)                                         
119600          END-EXEC.                                                       
119700        MOVE WS-EIBRESP               TO  WS-ABEND-VSAM-STS.              
119800*                                                                 ROR99145
119900     EXEC CICS ASKTIME                                            ROR99145
120000               ABSTIME(WS-ABSTIME)                                ROR99145
120100          END-EXEC.                                               ROR99145
120200     EXEC CICS FORMATTIME                                         ROR99145
120300               ABSTIME(WS-ABSTIME)                                ROR99145
120400               MMDDYY(WS-DATE)                                    ROR99145
120500          END-EXEC.                                               ROR99145
120600*                                                                 ROR04064
120700     PERFORM S0000-START-THE-ORDER THRU S0000-EXIT.               ROR04064
120800*                                                                 ROR04064
120900     IF WS-LU6ORH-ERROR-ALL-OK                                    ROR04094
121000        PERFORM S3000-UPDATE-ORDER-HEADER THRU S3000-EXIT.        ROR04094
121100*                                                                 ROR04094
121200     IF WS-LU6ORH-ERROR-ALL-OK                                    ROR04094
121300        PERFORM S4000-ZIP-WHSE-LOGIC THRU S4000-EXIT.             ROR04094
121400*                                                                 ROR04094
121500     IF WS-LU6ORH-ERROR-ALL-OK                                    ROR04094
121600        PERFORM S5000-UPDATE-ORDER-SHIPMENT THRU S5000-EXIT.      ROR04094
121700*                                                                 ROR04094
121800     IF WS-LU6ORH-ERROR-ALL-OK                                    ROR04094
121900        PERFORM S5650-INSERT-ORDER-SEGMENTS THRU S5650-EXIT.      ROR04094
122000*                                                                 ROR04094
122100     IF WS-LU6ORH-ERROR-ALL-OK                                    ROR04094
122200        PERFORM S6000-WRITE-HEADER-RESPONSE THRU S6000-EXIT       ROR04094
122300     ELSE                                                         ROR04094
122400        PERFORM S1000-SET-ERRORS THRU S1000-EXIT.                 ROR04094
122500*                                                                 ROR04094
122600*                                                                 ROR04064
122700     PERFORM S7000-END-THE-ORDER THRU S7000-EXIT.                 ROR04064
122800*                                                                 ROR04064
122900*                                                                 ROR04064
123000*                                                                 ROR04064
123100 S0000-START-THE-ORDER.                                           ROR04064
123200*                                                                 ROR04064
123300     INITIALIZE                           ORH-ORSHED              ROR04064
123400                                          ORSH-ORSSHH.            ROR04064
123500     INITIALIZE                           CORORH-RESPONSE-AREA.   ROR04064
123600*                                                                 ROR04064
123700     MOVE EIBDATE                     TO  WS-JULIAN-DATE.         ROR04064
123710     MOVE EIBTRNID                    TO  WS-INPUT-SOURCE         ROR07317
123800     MOVE CORORH-COMPANY-CODE         TO  TC-COMPANY              ROR04064
123900                                          TB-FRM-COMPANY-CODE     ROR04064
124000                                          TB-CPO-COMPANY-CODE     ROR04064
124100                                          TB-CPO2-COMPANY-CODE    ROR04064
124110                                          TB-CPO3-COMPANY-CODE    TEH05069
124120                                          TB-CPO4-COMPANY-CODE    PKV09266
124130                                          TB-CPO5-COMPANY-CODE    TKC07194
124131                                          TB-CPO6-COMPANY-CODE    PKV09266
124131                                          TB-CPO7-COMPANY-CODE    MS220220
                                                TB-BRN4-COMPANY-CODE    AXZ24292
124132                                          TB-DMSKU-CO             TEH05069
124200                                          TB-CO-VAL-COMPANY-CODE  TEH04357
124201                                          TB-COD1-COMPANY-CODE    ROR17111
                                                TB-IL-CO-CODE           TZM22231
                                                TB-IL2-CO-CODE          MXU26198
124210                                          WS-CUST-CO.             TEH04357
           MOVE CORORH-BR-NBR               TO  TB-BRN4-BRANCH.         AXZ24292
      *                                                                 ROR19067
      *---MOVED THIS MOVE  FROM  AFTER  S2500-  TO HERE                 ROR19067
      *      AS  WE  NEED  THE WS-TERM-ID VALUE FROM HERE..             ROR19067
      *                                                                 ROR19067
           MOVE CORORH-TERM-ID     TO WS-TERMS-CHG-TERM-ID              ROR19067
                                      WS-TERM-ID-CHG-TERM-ID            ROR19067
                                      WS-FRT-OUT-CHG-TERM-ID            ROR19067
                                      WS-TERM-ID                        ROR19067
                                      TB-IL-TERM-ID                     TZM22231
                                      TB-IL2-TERM-ID                    MXU26198
                                      WS-FRT-FWD-CHG-TERM-ID.           ROR19067
      *                                                                 ROR19067
124220* THIS SHOULD BE LEFT "W" --AS ITS  CODE SPECIFIC FOR INSIDELINE. ROR17111
124230*    MOVE 'W'               TO  TB-COD1-ENTRY-METHOD.             ABM18012
124240* NEW ENTRY METHODS CODES ARE INTRODUCED FOR TBXCODE1 TABLE --    ABM18012
124250* 'X' FOR PCG , 'W' FOR WEB AND 'O' FOR REST OF THE SYSTEMS.      ABM18012
124260     IF CORORH-FROM-PCG3                                          ABM18012
124270        MOVE 'X'            TO TB-COD1-ENTRY-METHOD               ABM18012
124280     ELSE                                                         ABM18012
124290        IF CORORH-FROM-WEB                                        ABM18012
124300           MOVE 'W'         TO TB-COD1-ENTRY-METHOD               ABM18012
124400        ELSE                                                      ABM18012
124500           MOVE 'O'         TO TB-COD1-ENTRY-METHOD               ABM18012
124600        END-IF                                                    ABM18012
124601     END-IF.                                                      ABM18012
124602     CALL 'SYU510'          USING  TB-CORP-PROC-IA.               ROR04064
124603     IF NOT TB-CPO-NORESP                                         ROR04064
124604        MOVE '000A'         TO     WS-ABCODE                      ROR04064
124605        PERFORM 999-ABEND.                                        ROR04064
124700*                                                                 ROR04064
124800     CALL 'SYU510'          USING  TB-CPO2-PROC-IA.               ROR04064
124900     IF NOT TB-CPO2-NORESP                                        ROR04064
125000        MOVE '000B'         TO     WS-ABCODE                      ROR04064
125100        PERFORM 999-ABEND.                                        ROR04064
125210*                                                                 TEH05069
125220     CALL 'SYU510'          USING  TB-CPO3-PROC-IA.               TEH05069
125230     IF NOT TB-CPO3-NORESP                                        TEH05069
125240        MOVE '000D'         TO     WS-ABCODE                      TEH05069
125250        PERFORM 999-ABEND.                                        TEH05069
125260                                                                  PKV09266
125270     CALL 'SYU510'          USING  TB-CPO4-PROC-IA.               PKV09266
125280                                                                  PKV09266
125290     CALL 'SYU510'          USING  TB-CPO5-PROC-IA.               TKC07194
125300     IF NOT TB-CPO5-NORESP                                        TKC07194
125400         MOVE 'N'                     TO WS-SPCL-ADDRESS-SW       TKC07194
125500     ELSE                                                         TKC07194
125600         IF TB-CPO5-SPECIAL-ADDRESS-SW = 'Y'                      TKC07194
      *        AND CORORH-VERSION-NBR        = '5'                      VXA21261
125800             MOVE 'Y'                 TO WS-SPCL-ADDRESS-SW.      TKC07194
125900                                                                  PKV09266
125901     CALL 'SYU510'          USING  TB-CPO6-PROC-IA.               PKV09266
125900                                                                  MS220220
125901     CALL 'SYU510'          USING  TB-CPO7-PROC-IA.               MS220220
125902*                                                                 ROR04064
125903     CALL 'SYU510'          USING  TB-CO-VAL-TABLE-IA.            ROR04064
125904     IF NOT TB-CO-VAL-NORESP                                      ROR04064
125905        MOVE '000C'         TO     WS-ABCODE                      ROR04064
125906        PERFORM 999-ABEND.                                        ROR04064
125907*                                                                 ROR04064
125908     CALL 'SYU510'          USING  TB-FRM-PROC-IA.                ROR04064
125909*                                                                 ROR04064
125910     CALL 'SYU510'          USING  TB-COD1-PROC-IA.               ROR17111
125920                                                                  ROR17111
           CALL 'SYU510'          USING  TB-IL-PROC-IA.                 TZM22231
                                                                        TZM22231
           CALL 'SYU510'          USING  TB-BRN4-PROC-IA.               AXZ24292
                                                                        MXU26198
           CALL 'SYU510'          USING  TB-IL2-PROC-IA.                MXU26198
                                                                        AXZ24292
126000     PERFORM S0050-VALIDATE-INPUT THRU S0050-EXIT.                ROR04064
126100*                                                                 ROR04064
126200 S0000-EXIT.    EXIT.                                             ROR04064
126300*                                                                 ROR04064
126400***--------------------------------------------------------------         
126500***--- WRITE LOG FILE CBLLUL... AND VALIDATE INPUT FROM LU6.2             
126600***--- IF ERROR FOUND WRITE ERROR TDQ (LUOT) AND STOP PROCESSING.         
126700***--------------------------------------------------------------         
126800 S0050-VALIDATE-INPUT.                                            ROR04064
126900*                                                                         
127000***---  WRITE CBLLUL RECORD...                                            
127100*                                                                         
127200     MOVE LENGTH OF CORORH-LU62-ORDER-REQUEST                     PXP95004
127300                                      TO WS-TS-REC-LENGTH.                
127400*                                                                         
127500*--  VALIDATE CUSTOMER FILE  (CORORH)                             PXP95004
127600*                                                                         
127700     INITIALIZE     CORORH-RESPONSE-AREA.                         PXP95004
127800*                                                                 ROR04162
127900     MOVE CORORH-SHIP-TO-CNTRY-CODE  TO                           ROR04162
128000                 WS-CORORH-SHIP-TO-CNTRY-CODE.                    ROR04162
128100* SAVE INCOMING ADDRESS FIELDS IN TEMP STORAGE.                   ROR17111
128200     MOVE CORORH-FIRM-NAME         TO WS-ENTER-SHIP-TO-FIRM-NAME. ROR17111
128300     MOVE CORORH-SHIP-TO-ADDRESS-1 TO WS-ENTER-SHIP-TO-ADDRESS1.  ROR17111
128400     MOVE CORORH-SHIP-TO-ADDRESS-2 TO WS-ENTER-SHIP-TO-ADDRESS2.  ROR17111
128500     MOVE CORORH-SHIP-TO-ADDRESS-3 TO WS-ENTER-SHIP-TO-ADDRESS3.  ROR17111
128600     MOVE CORORH-SHIP-TO-CITY      TO WS-ENTER-SHIP-TO-CITY.      ROR17111
128700     MOVE CORORH-SHIP-TO-STATE     TO WS-ENTER-SHIP-TO-STATE.     ROR17111
128800     MOVE CORORH-SHIP-TO-ZIP       TO WS-ENTER-SHIP-TO-ZIP.       ROR17111
128900     MOVE CORORH-SHIP-TO-CNTRY-CODE TO                            ROR17111
129000          WS-ENTER-TO-COUNTRY-CODE.                               ROR17111
129001                                                                  ROR17111
129002*                                                                         
129003*                                                                 ROR05307
129004     PERFORM 0051-PROCESS-SELSRC-MODEL  THRU 0051-EXIT.           ROR05307
129005     IF NOT WS-LU6ORH-ERROR-ALL-OK                                ROR05307
129006        GO TO S0050-EXIT.                                         ROR05307
129007*                                                                 ROR05307
129008     IF CORORH-BCK-ALLOW-BACKORDERS  OR                           PXP95004
129009        CORORH-BCK-NO-BACKORDERS     OR                           PXP95004
129010        CORORH-FILL-OR-BACKORDER-LINE OR                          ROR06075
129011        CORORH-BCK-SHIP-COMPLETE                                  PXP95004
129012        NEXT SENTENCE                                                     
129013      ELSE                                                                
129014        MOVE 'B'                      TO  WS-LU6ORH-ERROR-SW      SXK98180
129015        GO TO S0050-EXIT.                                         SXK98180
129016*                                                                         
129017     MOVE CORORH-BR-NBR               TO  WS-CUSTOMER-BR-NBR(1:2) TEH04357
129018                                          WS-CUST-BR.             TEH04357
129100     MOVE CORORH-CUST-NBR             TO  WS-CUSTOMER-NBR         ROR00175
129200                                          WS-CUSTOMER-BR-NBR(3:6) TEH04357
129210                                          WS-CUST-NBR.            TEH04357
129300**                                                                TKC02025
129400** AS OF 02/25/02 - SARCOM CAN'T DO CONSOLIDATED ORDER AND        TKC02025
129500**                  ONLY CONFIG ORDER CAN BE SHIP-COMPLETE        TKC02025
129600**                                                                TKC02025
129700     IF WS-SARCOM                                                 TKC02025
129800        IF CORORH-BCK-CONSOLIDATED-SHPMNT  OR                     TKC02025
129900          (CORORH-BCK-SHIP-COMPLETE   AND                         TKC02025
130000           NOT CORORH-CONFIGURATION-ORDER)                        TKC02025
130100            MOVE 'B'                  TO WS-LU6ORH-ERROR-SW       TKC02025
130200            GO TO S0050-EXIT.                                     TKC02025
130300*  PREVENT 60-485960 FROM PLACING CONSOLIDATED OR SHIP COMPLETE   TEH04357
130301*  ORDERS.                                                        TEH04357
130310     IF WS-BOTTOM-LINE                                            TEH04357
130320        IF CORORH-BCK-BACKORDER-FLAG > SPACE   AND                TEH04357
130330           CORORH-BCK-BACKORDER-FLAG NOT = 'Y'                    TEH04357
130340           MOVE 'B'                   TO WS-LU6ORH-ERROR-SW       TEH04357
130350           GO TO S0050-EXIT.                                      TEH04357
130360*                                                                 TEH04357
130400     IF CORORH-CONFIGURATION-ORDER     OR                         PXP95004
130500        CORORH-NON-CONFIGURATION-ORDER                            PXP95004
130600           NEXT SENTENCE                                          MCV93320
130700     ELSE                                                         MCV93320
130800        MOVE 'G'                      TO  WS-LU6ORH-ERROR-SW      SXK98180
130900        GO TO S0050-EXIT.                                         SXK98180
131000*                                                                         
131100     IF CORORH-SS-SPLIT-ORDER OR                                  PXP95004
131200        CORORH-SS-DO-NOT-SPLIT-ORDER                              PXP95004
131300        NEXT SENTENCE                                                     
131400      ELSE                                                                
131500        MOVE 'F'                      TO  WS-LU6ORH-ERROR-SW      SXK98180
131600        GO TO S0050-EXIT.                                         SXK98180
131700*                                                                 ROR01152
131800     EVALUATE CORORH-SYSTEM-ID                                    ROR01152
131900     WHEN  'I '                                                   ROR01152
132000     WHEN  'N'                                                    ROR01152
132100     WHEN 'AV'                                                    ROR01152
132200     WHEN 'AC'                                                    ROR01152
132300       SET ITS-A-WEB-ORDER TO TRUE                                ROR01152
132400       IF LINK-IN AND                                             TKC03271
132500          (TB-CPO-BASE-RATE-ORDER-SW = 'T' OR 'Y')                TKC03271
132600*          IF CORORH-TERM-ID = 'WEBX'                             AZD18124
132610           IF CORORH-FROM-PCG3                                    AZD18124
132700               IF TB-USE-FRM-XML                                  TKC03271
132800                   MOVE 'Y'   TO WS-USE-FRM-SW                    TKC03271
132900               END-IF                                             TKC03271
133000           ELSE                                                   TKC03271
133100               IF TB-USE-FRM-WEB                                  TKC03271
133200                   MOVE 'Y'   TO WS-USE-FRM-SW                    TKC03271
133300               END-IF                                             TKC03271
133400           END-IF                                                 TKC03271
133500       END-IF                                                     TKC03271
133600     WHEN  OTHER                                                  ROR01152
133700       SET ITS-AN-INSIDELINE-ORDER TO TRUE                        ROR01152
133800       IF LINK-IN AND                                             TKC03271
133900          (TB-CPO-BASE-RATE-ORDER-SW = 'T' OR 'Y')                TKC03271
134000           IF TB-USE-FRM-INSIDELINE                               TKC03271
134100               MOVE 'Y'   TO WS-USE-FRM-SW                        TKC03271
134200           END-IF                                                 TKC03271
134300       END-IF                                                     TKC03271
134400     END-EVALUATE.                                                ROR01152
134500*                                                                         
134600     MOVE EIBDATE                TO  SYU1-INPUT-JULIAN-DATE.      ROR99135
134700     MOVE CORORH-COMPANY         TO  TC-COUNTRY-CODE.             ROR99330
134800     PERFORM 9300-FORMAT-CCYYMMDD.                                ROR99135
134900     MOVE WS-CCYYMMDD            TO  WS-PRESENT-DATE.             TEH05069
135000     IF CORORH-PROMISE-DATE > SPACES                              ROR99135
135010        MOVE CORORH-PROMISE-DATE    TO SYU-INPUT-ISO-DATE-8       TEH05069
135020        MOVE CORORH-COMPANY          TO SYU-COMPANY-INDICATOR     TEH05069
135030        CALL 'SYU777' USING SYU-DFHEIBLK                          TEH05069
135040                            SYU-DFHCOMMAREA                       TEH05069
135050                            SYU-DATE-ROUTINE-FIELDS               TEH05069
135060        IF SYU-ERROR-SW = SPACES                                  TEH05069
135070           MOVE SYU-OUTPUT-ISO-DATE-8 TO  WS-PROMISE-DATE         TEH05069
135080        ELSE                                                      TEH05069
135090           MOVE 'D'                  TO  WS-LU6ORH-ERROR-SW       TEH05069
135091           MOVE 'UD'               TO WS-LU6ORH-ERROR-FLAG        TEH05069
135092           SET CORORH-R-ERROR-PROMISE-DATE    TO TRUE             TEH05069
135093           GO TO S0050-EXIT                                       TEH05069
135094        END-IF                                                    TEH05069
135095        IF WS-PROMISE-DATE LESS THAN WS-PRESENT-DATE              TEH05069
135096           MOVE 'D'                TO  WS-LU6ORH-ERROR-SW         TEH05069
135097           MOVE 'UD'               TO WS-LU6ORH-ERROR-FLAG        TEH05069
135098           SET CORORH-R-ERROR-PROMISE-DATE    TO TRUE             TEH05069
135099           GO TO S0050-EXIT                                       TEH05069
135100        ELSE                                                      TEH05069
135101           MOVE WS-PROMISE-DATE        TO SYU-INPUT-ISO-DATE-8    TEH05069
135102           MOVE CORORH-COMPANY          TO SYU-COMPANY-INDICATOR  TEH05069
135103           CALL 'SYU777' USING SYU-DFHEIBLK                       TEH05069
135104                               SYU-DFHCOMMAREA                    TEH05069
135105                               SYU-DATE-ROUTINE-FIELDS            TEH05069
135106            IF SYU-ERROR-SW = SPACES                              TEH05069
135107               MOVE SYU-OUTPUT-JULIAN-DATE-5 TO WS-PROMISE-DATE1  TEH05069
135108            END-IF                                                TEH05069
135109        END-IF                                                    TEH05069
137900     END-IF.                                                      ROR99135
137910** IN ASIA-PAC, IF BACKORDER FLAG = 'E' AND THE PROMISE DATE IS   TEH05069
137920**  > SPACES, THIS IS A SCHEDULED ORDER.                          TEH05069
      ** FOR EUROPEAN ORDERS COMING VIA IM360 WE ARE SKIPPING BELOW     PXM20284
      ** CHANGED TO WORK ONLY FOR APAC AS IT SHOULD, SINCE OTHERS       FYT21127
      ** EMEA,US,CA,LATAM DONT USE IT. CONFIRMED WITH IMPULSE-ADMIN     FYT21127
137940     IF  CORORH-BCK-BACKORDER-FLAG = 'E'                          TEH05069
             IF TC-ASIA-PACIFIC-COMPANY                                 FYT21127
137950         IF WS-PROMISE-DATE1 > SPACES                             TEH05069
137960            MOVE SYU-OUTPUT-JULIAN-DATE-5                         TEH05069
137970                             TO WS-PROMISE-DATE1-NUM              TEH05069
137980            PERFORM S1140-AP-SCHEDULED-ORDS THRU S1140-EXIT       TEH05069
137990         END-IF                                                   TEH05069
             END-IF                                                     PXM20284
137991     END-IF.                                                      TEH05069
138000*** VALID VALUES FOR THIS DECLARED VAL FLAG ARE 'Y' , 'N' , ' ' . ROR04116
138100*                                                                 ROR04116
138200     IF CORORH-DV-FLAG > SPACE                                    ROR04116
138300        IF CORORH-DV-FLAG = 'Y' OR 'N'                            ROR04116
138400           NEXT SENTENCE                                          ROR04116
138500        ELSE                                                      ROR04116
138600           MOVE '1'              TO  WS-LU6ORH-ERROR-SW           ROR04116
138700           MOVE 'Y1'             TO  WS-LU6ORH-ERROR-FLAG         ROR04116
138800           SET  CORORH-R-ERROR-INV-DV-FLAG TO TRUE                ROR04116
138900           GO TO S0050-EXIT                                       ROR04116
139000        END-IF                                                    ROR04116
139100     END-IF.                                                      ROR04116
139200*                                                                 ROR04116
139300*                                                                         
139400     IF  CORORH-GOVT-END-USER-ZIP   >   SPACES                    ROR99145
139500               INSPECT                CORORH-GOVT-END-USER-ZIP    ROR99145
139600                  REPLACING ALL SPACES BY ZEROES                  ROR99145
139700          IF CORORH-GOVT-END-USER-ZIP NOT NUMERIC                 ROR99145
139800            MOVE 'C'                  TO  WS-LU6ORH-ERROR-SW      ROR99330
139900            GO TO S0050-EXIT                                      ROR99145
140000          END-IF                                                  ROR99145
140100     END-IF.                                                      ROR99145
140200*                                                                         
140210*       SUPPORT CA PARTNER LEVEL PRICING PROJECT.                 ROR15282
140300*    IF LINK-IN  AND  TC-USA  AND                                 ROR15282
140310     IF LINK-IN  AND (TC-USA OR TC-CANADA) AND                    ROR15282
140400        CORORH-GOVT-DATA GREATER THAN SPACES                      ROR00101
140500        IF CORORH-GOVT-PROGRAM-TYPE      EQUAL  SPACES  OR        ROR04064
140600           CORORH-GOVT-END-USER-TYPE     EQUAL  SPACES  OR        ROR04064
140700           CORORH-GOVT-END-USER-TYPE(2:1) GREATER THAN SPACES     ROR04064
140800           MOVE 'C' TO WS-LU6ORH-ERROR-SW                         ROR04064
140900           GO TO S0050-EXIT                                       ROR04064
141000        ELSE                                                      ROR04064
141100           PERFORM S1110-VALIDATE-GOVT-TYPES THRU S1110-EXIT      ROR04064
141200           IF NOT WS-LU6ORH-ERROR-ALL-OK                          ROR04064
141300              GO TO S0050-EXIT                                    ROR04064
141400           END-IF                                                 ROR04064
141500        END-IF                                                    ROR04064
141600     END-IF.                                                      ROR00101
141700*                                                                 ROR05314
141800*  MOVED TERMS VALIDATION LOGIC FROM HERE TO END OF 0050- PARA,   ROR05314
141900*   AS WE NEED TO KNOW DEFAULT TERMS OF THE CUSTOMER,             ROR05314
142000*   PER NEW TERM VALIDATION SECURITY RULES, AND WE WONT KNOW      ROR05314
142100*    DEFUALT TERMS TILL WE GO TO END OF S0050- PARA.              ROR05314
142200*  RULES FOR NEW CUSTOMERS TRYING TO CHANGE TERMS:                ROR05314
142300*  FROM LOWER  DEFAULT TERMS TO HIGHER TERMS :NEED ADDTL SECURITY ROR05314
142400*  FROM HIGHER DEFAULT TERMS TO LOWER TERMS : NO SECURITY NEEDED. ROR05314
142500*  TO CHANGE TO 992 TERMS : SECURITY NEEDED.                      ROR05314
143500*                                                                         
143600     IF WS-SPCL-ADDRESS-SW = 'Y'                                  TKC07194
143700        IF (CORORH-SHIP-TO-ADDRESS-1-2BY = SPACES AND             TKC07194
143800            CORORH-SHIP-TO-ADDRESS-2-2BY = SPACES AND             TKC07194
143900            CORORH-SHIP-TO-ADDRESS-3-2BY = SPACES AND             TKC07194
      *           CORORH-SHIP-TO-ADDRESS-4-2BY = SPACES AND             VXA21261
144100            CORORH-SHIP-TO-ADDRESS-5-2BY = SPACES)                TKC07194
144200            SET WS-NO-SHIP-TO-ADDRESS   TO TRUE                   TKC07194
144300        ELSE                                                      TKC07194
144400            MOVE 'Y'       TO WS-SHIP-TO-ADDRESS-SPCL             TKC07194
144500        END-IF                                                    TKC07194
144600        IF CORORH-SHIP-TO-ATTN-2BY = SPACES  AND                  TKC07194
144700           CORORH-SHIP-TO-NAME-2BY = SPACES                       TKC07194
144800            NEXT SENTENCE                                         TKC07345
144900        ELSE                                                      TKC07345
145000            MOVE 'Y'       TO WS-SHIP-TO-ATTNAME-SPCL             TKC07194
145100        END-IF                                                    TKC07194
145200     ELSE                                                         TKC07194
145201       MOVE CORORH-FIRM-NAME     TO WS-FIRM-NAME-IN               TKC07345
145202       IF (CORORH-SHIP-TO-ADDRESS-1 EQUAL SPACES) AND             PXP95004
145203          (CORORH-SHIP-TO-ADDRESS-2 EQUAL SPACES) AND             PXP95004
145204          (CORORH-SHIP-TO-ADDRESS-3 EQUAL SPACES) AND             PXP95004
145205          (CORORH-SHIP-TO-CITY EQUAL SPACES)      AND             PXP95004
145206          (CORORH-SHIP-TO-STATE EQUAL SPACES)     AND             PXP95004
145207          (CORORH-SHIP-TO-ZIP EQUAL SPACES)                       PXP95004
145208          SET WS-NO-SHIP-TO-ADDRESS   TO  TRUE                    MCV95136
145209          IF CORORH-ELCOM                                         MCV95136
145210             MOVE 'S'                 TO  WS-LU6ORH-ERROR-SW      SXK98180
145211             GO TO S0050-EXIT                                     SXK98180
145212          END-IF                                                  MCV95136
145213       ELSE                                                       MCV95136
145214         SET WS-SHIP-TO-ADDRESS       TO  TRUE                    MCV95136
145215         IF (TC-CANADA AND CORORH-SHIP-TO-CNTRY-CODE = SPACES) OR ROR04204
145216              CORORH-SHIP-TO-CNTRY-CODE = ('CA' OR 'FT')          ROR04204
145217*             IF TB-COD1-BYPASS-YES                               ABM17279
145218*             OR (NOT TB-COD1-NORESP)                             ABM17279
145219                 PERFORM S1120-CHECK-CANADA-ZIP THRU S1120-EXIT   ROR00199
145220*             END-IF                                              ABM17279
145230         END-IF                                                   ROR00199
145240*  ADD 'IE' POST CODE LOGIC HERE....                              PKV10104
145250*   IF NO POSTAL CODE COMING IN WHEN SHIPPING TO 'IE' ,           PKV10104
145260*    SET POSTAL CODE TO 'EIRE'.                                   PKV10104
145270         IF CORORH-SHIP-TO-CNTRY-CODE = 'IE' AND                  PKV10104
145280            CORORH-SHIP-TO-ZIP EQUAL (SPACES OR LOW-VALUES)       PKV10104
145290            MOVE 'EIRE' TO CORORH-SHIP-TO-ZIP                     PKV10104
145300         END-IF                                                   PKV10104
145400*   FOR  ORDER  PLACED IN EUROPE DRPSHIPPING TO  'IE' ,           ROR12146
145500*    ALWAYS  OVERLAY TH POSTAL CODE  WITH 'EIRE' --SE  21171      ROR12146
145600         IF CORORH-SHIP-TO-CNTRY-CODE = 'IE' AND                  ROR12146
145700            TC-EUROPE                                             ROR12146
145800            MOVE 'EIRE' TO CORORH-SHIP-TO-ZIP                     ROR12146
145900         END-IF                                                   ROR12146
145901                                                                  ROR12146
      *     BREXIT CHANGES FOR REPUBLIC OF IRELAND (ROI) TO ALWAYS      NXC21050
      *     SET COUNTRY CODE AS IE WHENEVER SHIP-TO-ZIP IS "EIRE"       NXC21050
               IF CORORH-SHIP-TO-ZIP = 'EIRE'                           NXC21050
                  IF CORORH-SHIP-TO-CNTRY-CODE EQUAL (SPACES            NXC21050
                     OR LOW-VALUES OR 'UK')                             NXC21050
                     MOVE 'IE' TO CORORH-SHIP-TO-CNTRY-CODE             NXC21050
                  END-IF                                                NXC21050
               END-IF                                                   NXC21050
                                                                        NXC21050
145902         MOVE CORORH-SHIP-TO-ZIP      TO  WS-ZIP-CODEX            PXP95004
145903         MOVE CORORH-SHIP-TO-STATE    TO  ORH-SHIP-TO-STATE       ROK98204
145904       END-IF                                                     TKC07194
145905     END-IF.                                                      ROR99330
145906                                                                          
      *  ADD LOGIC HERE TO DEFAULT CARRIER CODE TO "BS" , WHEN NO       NXC21050
145908*   CARRIER CODE IS COMING IN ...FOR ORDERS DROPSHIPPING TO "IE". ROR11241
145909     IF (CORORH-SHIP-TO-CNTRY-CODE = 'IE') AND                    ROR11241
145910        (CORORH-SHIP-VIA-CARRIER-CODE EQUAL SPACES)               ROR11241
              IF (TC-COMPANY = 'UK')                                    NXC21050
                 MOVE 'BS' TO CORORH-SHIP-VIA-CARRIER-CODE              NXC21050
              ELSE                                                      NXC21050
                 MOVE 'SI' TO CORORH-SHIP-VIA-CARRIER-CODE              NXC21050
              END-IF                                                    NXC21050
145930     END-IF.                                                      ROR11241
145931*                                                                 ROR11241
145932*  THIS CODE WILL HELP US IN REMOVING HARD CODED LOGIC RELATED    ROR04162
145933*   TO "US" , "FT".                                               ROR04162
145934*                                                                 ROR04162
146000     IF WS-SHIP-TO-ADDRESS AND                                    ROR04162
146100        CORORH-SHIP-TO-CNTRY-CODE = (SPACES OR LOW-VALUES)        ROR04162
146200        IF TB-CO-VAL-CNTRY-CODE = (SPACES OR ZEROES OR LOW-VALUES)ROR04162
146300           NEXT SENTENCE                                          ROR04162
146400        ELSE                                                      ROR04162
146500           MOVE TB-CO-VAL-CNTRY-CODE TO CORORH-SHIP-TO-CNTRY-CODE ROR04162
146600        END-IF                                                    ROR04162
146700     END-IF.                                                      ROR04162
146800*                                                                 ROR04162
146900     IF WS-NO-SHIP-TO-ADDRESS                                     ROR00151
147000        IF CORORH-SHIP-TO-SUFFIX GREATER THAN SPACES              ROR00151
147100           SET WS-SHIP-TO-SUFFIX         TO  TRUE                 ROR00151
147200        ELSE                                                      ROR00151
147300           SET WS-DEF-SHIP-TO-SUFFIX     TO  TRUE                 ROR00151
147400        END-IF                                                    ROR00151
147500     END-IF.                                                      ROR00151
147600*                                                                 ROR00151
147700     EVALUATE WS-SHIP-TO-ADDRESS-SW                               ROR99330
147800     WHEN  'Y'                                                    ROR99330
147900         EVALUATE CORORH-COMPANY-CODE                             ROR99330
148000         WHEN  'MD'                                               ROR99330
148100               IF  (CORORH-SHIP-TO-ADDRESS-1 EQUAL SPACES)   AND  ROR99330
148200                   (CORORH-SHIP-TO-ADDRESS-2 EQUAL SPACES)        ROR99330
148300                    MOVE 'S'              TO  WS-LU6ORH-ERROR-SW  ROR99330
148400                    MOVE 'S0'             TO  WS-ADDR-ERR-TYPE    ROR99330
148500                    GO TO S0050-EXIT                              ROR99330
148600               END-IF                                             ROR99330
148700               MOVE 'Y'                   TO  WS-DROPSHIP-MD-SW   ROR99330
148800*              IF CORORH-SHIP-TO-CNTRY-CODE = SPACES OR LOW-VALUESROR04162
148900*                 MOVE 'US' TO CORORH-SHIP-TO-CNTRY-CODE          ROR04162
149000*              END-IF                                             ROR04162
149100               MOVE CORORH-SHIP-TO-CNTRY-CODE TO WS-CHECK-REGION  ROR00060
149110               MOVE CORORH-SHIP-TO-STATE      TO WS-VALID-APO-ST  ROR05307
149200               IF WS-US-REGION                                    ROR00060
149210               OR WS-VALID-APO                                    ROR05307
149300               IF WS-ZIP-CODE NOT NUMERIC                         ROR99330
149400                  INSPECT  CORORH-SHIP-TO-ZIP                     ROR99330
149500                     REPLACING ALL SPACES  BY  ZEROES             ROR99330
149600                  MOVE CORORH-SHIP-TO-ZIP TO  WS-ZIP-CODEX        ROR99330
149700               END-IF                                             ROR99330
149800               IF WS-ZIP-CODE NOT NUMERIC                         ROR99330
149900                  MOVE 'S'                TO  WS-LU6ORH-ERROR-SW  ROR99330
150000                  MOVE 'SZ'               TO  WS-ADDR-ERR-TYPE    ROR99330
150100                  GO TO S0050-EXIT                                ROR99330
150200               END-IF                                             ROR99330
150300               END-IF                                             ROR00060
150400         WHEN  'FT'                                               ROR17111
150500              IF TB-COD1-BYPASS-YES                               ROR17111
150600              OR (NOT TB-COD1-NORESP)                             ROR17111
150700                 IF WS-ZIP-CODEX      NOT GREATER THAN SPACES  OR ROR17111
150800                    CORORH-SHIP-TO-CITY NOT GREATER THAN SPACES   ROR17111
150900                    MOVE 'S'              TO  WS-LU6ORH-ERROR-SW  ROR17111
151000                    MOVE 'SZ'             TO  WS-ADDR-ERR-TYPE    ROR17111
151100                    GO TO S0050-EXIT                              ROR17111
151200                 ELSE                                             ROR17111
151300                    MOVE WS-ZIP-CODEX     TO  WS-POSTAL-CODES     ROR17111
151400                 END-IF                                           ROR17111
151500              ELSE                                                ROR17111
151600                 IF (CORORH-SHIP-TO-ADDRESS-1 EQUAL SPACES) AND   ROR17111
151700                     (CORORH-SHIP-TO-ADDRESS-2 EQUAL SPACES)      ROR17111
151800                      MOVE 'S'            TO  WS-LU6ORH-ERROR-SW  ROR17111
151900                      MOVE 'S0'           TO  WS-ADDR-ERR-TYPE    ROR17111
152000                      GO TO S0050-EXIT                            ROR17111
152100                 END-IF                                           ROR17111
152200              END-IF                                              ROR17111
152300              MOVE 'Y'                    TO  WS-DROPSHIP-FT-SW   ROR17111
152400*  NO  FULFILMENT ORDERS ARE ALLOWD FOR INDIA AS PART OF INDIA GSTNXC17174
152500         WHEN   'IA'                                              NXC17174
152600         WHEN   'BI'                                              NXC17174
152700         WHEN   'LK'                                              NXC17174
152800               IF TB-CPO4-INDIA-GST-PROCESS                       NXC17174
152900                  MOVE 'S'                TO  WS-LU6ORH-ERROR-SW  NXC17174
153000                  MOVE 'SS'               TO  WS-ADDR-ERR-TYPE    NXC17174
153100                  GO TO S0050-EXIT                                NXC17174
153200               END-IF                                             NXC17174
153300*  TO BE OPENED UP IN FUTURE WHEN WE ALLOW FULFIL FOR INDIA GST   NXC17174
153400*              IF TB-CPO4-INDIA-GST-PROCESS                       NXC17174
153500*                 IF CORORH-SHIP-TO-STATE EQUAL SPACES            NXC17174
153600*                 MOVE 'S'                TO  WS-LU6ORH-ERROR-SW  NXC17174
153700*                 MOVE 'SS'               TO  WS-ADDR-ERR-TYPE    NXC17174
153800*                 GO TO S0050-EXIT                                NXC17174
153900*                 END-IF                                          NXC17174
153901*              END-IF                                             NXC17174
153902         WHEN  OTHER                                              ROR99330
153903               IF WS-ZIP-CODEX        NOT GREATER THAN SPACES  OR ROR99330
153904                  CORORH-SHIP-TO-CITY NOT GREATER THAN SPACES     ROR99330
153905                  MOVE 'S'                TO  WS-LU6ORH-ERROR-SW  ROR99330
153906                  MOVE 'SZ'               TO  WS-ADDR-ERR-TYPE    ROR99330
153907                  GO TO S0050-EXIT                                ROR99330
153908               ELSE                                               ROR99330
153909                  MOVE WS-ZIP-CODEX       TO  WS-POSTAL-CODES     ROR99330
153910               END-IF                                             ROR99330
153911         END-EVALUATE                                             ROR99330
153912     END-EVALUATE.                                                ROR99330
153913*                                                                         
153914*----------- VALIDATE THE COUNTRY CODE AGAINST TBXCNTRY TABLE     SXG03305
153915* IF THE SHIP TO COUNTRY CODE IS NOT THERE IN TBXCNTRY TABLE,     SXG03305
153916* SEND AN ERROR.                                                  SXG03305
153917     IF TB-CO-VAL-EXP-COMPL-OK                                    SXG03305
153918        IF CORORH-SHIP-TO-CNTRY-CODE GREATER THAN SPACES          SXG03305
153919          IF CORORH-SHIP-TO-CNTRY-CODE NOT EQUAL TO               SXG03305
153920             CORORH-COMPANY-CODE                                  SXG03305
153921            MOVE TC-COMPANY TO TB-CNTRY-CO                        SXG03305
153922            MOVE CORORH-SHIP-TO-CNTRY-CODE TO TB-CNTRY-CODE       SXG03305
153923            CALL 'SYU510' USING TB-CNTRY-TABLE-IA                 SXG03305
153924            IF NOT TB-CNTRY-NORESP                                SXG03305
153925               MOVE 'W'    TO  WS-LU6ORH-ERROR-SW                 SXG03305
153926               SET CORORH-R-ERROR-SHIP-TO-CNTRY  TO TRUE          SXG03305
153927            END-IF                                                SXG03305
153928          END-IF                                                  SXG03305
153929        END-IF                                                    SXG03305
153930     END-IF.                                                      SXG03305
153931*                                                                 SXG03305
      *------------VALIDATE IF THE ORDER IS A DPAS ORDER WITH THE HELP  BYA21100
      * OF TBICORP7 TABLE.                                              BYA21100
      * SEND OUT THE ERROR CODE IF WE GET INCORRECT DPAS-CODE OR        BYA21100
      * INCORRECT EXPECTED-DELIVERY-DATE OR INCORRECT PROGRAM-IDENTIFIERBYA21127
           IF TB-CPO7-DPAS-COMPANY-SW = 'Y'                             BYA21100
             IF  CORORH-DPAS-CODE  > SPACES                             BYA21100
               IF CORORH-EXPECTED-DELIVERY-DATE > SPACES                BYA21100
                 IF CORORH-DPAS-PGM-ID > SPACES                         BYA21127
                    PERFORM 0310-DPAS-LOGIC THRU 0310-EXIT              BYA21127
                 ELSE                                                   BYA21127
                    MOVE 'F'  TO WS-LU6ORH-ERROR-SW                     BYA21127
                    MOVE 'DF' TO WS-LU6ORH-ERROR-FLAG                   BYA21127
                    GO TO S0050-EXIT                                    BYA21127
                 END-IF                                                 BYA21127
               ELSE                                                     BYA21127
                 MOVE 'B'  TO WS-LU6ORH-ERROR-SW                        BYA21127
                 MOVE 'DB' TO WS-LU6ORH-ERROR-FLAG                      BYA21127
                 GO TO S0050-EXIT                                       BYA21127
               END-IF                                                   BYA21127
             ELSE                                                       BYA21127
               IF CORORH-EXPECTED-DELIVERY-DATE > SPACES OR             BYA21127
                  CORORH-DPAS-PGM-ID > SPACES                           BYA21127
                  MOVE 'D'  TO WS-LU6ORH-ERROR-SW                       BYA21127
                  MOVE 'DD' TO WS-LU6ORH-ERROR-FLAG                     BYA21127
                  GO TO S0050-EXIT                                      BYA21127
               END-IF                                                   BYA21127
             END-IF                                                     BYA21127
           END-IF.                                                      BYA21100
                                                                        BYA21100
           IF NOT WS-LU6ORH-ERROR-ALL-OK                                BYA21100
              GO TO S0050-EXIT                                          BYA21100
           END-IF.                                                      BYA21100
                                                                        BYA21100
153932      IF CORORH-INSIGHT-CUST AND                                  SXK98180
153933         CORORH-SHIP-VIA-CARRIER-CODE EQUAL 'AL'                  SXK98180
153934            MOVE 'CA' TO CORORH-SHIP-VIA-CARRIER-CODE             SXK98180
153935      END-IF.                                                     SXK98180
153937*** CHANGES FOR APPLE DEP----                                     ABM18097
153938     IF TB-CP04-DEP-ORDER-REQ-SW = 'Y' AND                        ABM18097
153939        CORORH-EU-DEP-ID > SPACES                                 ABM18097
153940        IF CORORH-DEP-ORDER-NBR NOT > SPACES                      ABM18097
      *          MOVE CORORH-TERM-ID  TO WS-TERM-ID                     TZM22231
      *          IF WS-TERM-ID-PCG                                      TZM22231
                 IF TB-IL-HOLD-DEP-ORD                                  TZM22231
153970              SET WS-HOLD-ON-ERR-DEP TO TRUE                      ABM18216
153980           ELSE                                                   ABM18216
153990              MOVE '1'  TO WS-LU6ORH-ERROR-SW                     ABM18097
154000              MOVE 'A1' TO WS-LU6ORH-ERROR-FLAG                   ABM18097
154100              GO TO S0050-EXIT                                    ABM18097
154200           END-IF                                                 ABM18216
154300        END-IF                                                    ABM18097
154400        IF CORORH-CUSTOMER-TO-INGRAM-PO NOT > SPACES              ABM18097
154500           MOVE CORORH-TERM-ID  TO WS-TERM-ID                     ABM18216
154600           IF WS-TERM-ID-PCG                                      ABM18216
154700              SET WS-HOLD-ON-ERR-DEP TO TRUE                      ABM18216
154800           ELSE                                                   ABM18216
154900              MOVE '2'  TO WS-LU6ORH-ERROR-SW                     ABM18097
155000              MOVE 'A2' TO WS-LU6ORH-ERROR-FLAG                   ABM18097
155100              GO TO S0050-EXIT                                    ABM18097
155200           END-IF                                                 ABM18216
155300        END-IF                                                    ABM18097
155301     END-IF.                                                      ABM18097
155302*                                                                 ROR00175
155303*** SPACE OUT THE CARRIER CODE  FOR  THE  BELOW CUSTOMER EVEN..   ROR00175
155304***  IF HE  GIVES ONE...SO THAT  WE  CAN  ALLOCATE  THE  DEAFULT  ROR00175
155305***   ONE   THATS  THERE  ON HIS  PROFILE....                     ROR00175
155306*                                                                 ROR00175
155307      IF CORORH-CUSTOMER-KEY(3:8) = '15266946'                    ROR00175
155308         MOVE SPACES TO CORORH-SHIP-VIA-CARRIER-CODE              ROR00175
155309      END-IF.                                                     ROR00175
                                                                        PXM20284
      *  CHANGES FOR POPULATING CARRIER DESCRIPTION ON ORDER            PXM20284
      *  THIS IS LIMITED TO IM360 ORDERS ONLY                           PXM20284
            IF  TC-EUROPE                                               PXM20284
              IF  CORORH-CARR-DESC IS GREATER THAN SPACES               PXM20284
              AND CORORH-SHIP-VIA-CARRIER-CODE = 'OT'                   PXM20284
      *       AND WS-TERM-ID-FROM-IM360                                 TZM22231
              AND TB-IL-DEF-CARR-FOR-D-TYPE                             TZM22231
      *       AND ORSH-DIRECT-ORDER                                     TZM22231
              AND CORORH-DIRECT-SHIP = 'Y'                              TZM22231
                  SET WS-OVERRIDE-CARR-DES TO TRUE                      PXM20284
              END-IF                                                    PXM20284
            END-IF.                                                     PXM20284
155310*                                                                 ROR10293
155311*  LOGIC TO IDENTIFY A SAP ACCT.                                  ROR10293
155312*                                                                 ROR10293
155313      SET ITS-NOT-A-SAP-ACCT TO TRUE.                             ROR10293
155314      IF TB-CPO6-SAP-ACTIVE                                       ROR10293
155315         MOVE CORORH-COMPANY-CODE     TO TB-SAPC2-CUST-CO         ROR10293
155316         MOVE CORORH-BR-NBR           TO TB-SAPC2-CUST-BR         ROR10293
155317         MOVE CORORH-CUST-NBR         TO TB-SAPC2-CUST-NO         ROR10293
155400         CALL 'SYU510'      USING  TB-SAPC2-TABLE-IA              ROR10293
155500         IF TB-SAPC2-NORESP                                       ROR10293
155600            SET ITS-A-SAP-ACCT TO TRUE                            ROR10293
155700         END-IF                                                   ROR10293
155800      END-IF.                                                     ROR10293
      ******************************************************************AYB24152
      * SE8924 GLN IMPLEMENTATION - WE ARE ADDING BELOW CONDITION FOR   AYB24152
      * NOW TO RESTRICT THE USE TO EMEA ONLY AND GOING FORWARD IT       AYB24152
      * WOULD BE ADDED AS AN TBIINLN SWITCH.                            AYB24152
      ******************************************************************AYB24152
            IF CORORH-GLOBAL-LOC-NBR GREATER THAN SPACES                AYB24152
               IF TC-EUROPE                                             AYB24152
                  NEXT SENTENCE                                         AYB24152
               ELSE                                                     AYB24152
                  MOVE SPACES TO CORORH-GLOBAL-LOC-NBR                  AYB24152
               END-IF                                                   AYB24152
            END-IF.                                                     AYB24152
155900*                                                                 ROR10293
156000*                                                                 ROR07317
156100*  SPECIAL LOGIC  RELATED TO  DEFAULT SUFFIX ALLOCATION FOR       ROR07317
156200*     ORDERS COMMING THRU WEB SERVICES/SUBSTATION.                ROR07317
      *    NOT APPLICABLE FOR MOBILE ORDERS , AS THEY SHOULD BEHAVE     ROR19067
      *    THE SAME WAY-WHEN THEY CAME THROUGH RPC/JGATE ROUTE,         ROR19067
      *    EVEN WHEN THEY COME THROUGH SUBSTATION ROUTE- ARMOR PROJECT  ROR19067
156300*                                                                 ROR07317
      *    IF WS-FROM-SUBSTATION                                        TZM22231
      *       IF WS-TERM-ID-FROM-WEB-MOBILE                             TZM22231
           IF TB-IL-ALW-FROM-SUBSTATION                                 TZM22231
              IF TB-IL-MOBILE-APP                                       TZM22231
                 NEXT SENTENCE                                          ROR19067
              ELSE                                                      ROR19067
156500           PERFORM 0052-GET-DEF-BRANCH-SHIPBILL THRU 0052-EXIT    ROR07317
              END-IF                                                    ROR19067
156501     END-IF.                                                      ROR07317
156502*                                                                         
156503*    SET ELCOM CUSTOMER BASED ON TRANSID                                  
156504**                                                                        
156505     IF  CORORH-ELCOM                                             PXP95004
156506         IF CORORH-SUFFIX-FLOORING                                ELB96130
156507            SET WS-SUFFIX-FLOORING TO TRUE                        ELB96130
156508         END-IF                                                   ELB96130
156509         IF  EIBTRNID = 'LUOH'                                    MCV94235
156510             IF CORORH-CATALINK-PRIMARY-SRC                       RXD95362
156511                 MOVE WS-ELCOM-PRIMARY-SRC-CUST TO                RXD95362
156512                      WS-CUST-BILL-TO-NBR                         RXD95362
156513              ELSE                                                RXD95362
156514                IF CORORH-ELCOM-COM-ACCOUNT                       ROK99056
156515                 MOVE WS-ELCOM-INGRAM-CUST-2                      ROK99056
156516                                           TO WS-CUST-BILL-TO-NBR ROK99056
156517                 SET CORORH-SUFFIX-FLOORING  TO TRUE              ROK99064
156518                 SET WS-SUFFIX-FLOORING      TO   TRUE            ROK99064
156519                ELSE                                              ROK99056
156520                 MOVE WS-ELCOM-INGRAM-CUST TO WS-CUST-BILL-TO-NBR ROK99056
156530                END-IF                                            ROK99056
156600             END-IF                                               RXD95362
156700         ELSE                                                     MCV94235
156800           IF CORORH-ELCOM-COM-ACCOUNT                            ROK99056
156900             MOVE WS-ELCOM-ALLIANCE-CUST-2 TO WS-CUST-BILL-TO-NBR ROK99056
157000           ELSE                                                   ROK99056
157100             MOVE WS-ELCOM-ALLIANCE-CUST TO WS-CUST-BILL-TO-NBR   PXP95004
157200           END-IF                                                 ROK99056
157300             SET CORORH-SUFFIX-FLOORING  TO TRUE                  PXP95004
157400             SET WS-SUFFIX-FLOORING      TO   TRUE                ELB96108
157500     ELSE                                                         MCV94235
157600         MOVE CORORH-BR-NBR              TO WS-CUST-BR-NBR        PXP95004
157700         MOVE CORORH-CUST-NBR            TO WS-CUST-NUMBER        PXP95004
157800         MOVE CORORH-SUFFIX              TO WS-CUST-SUFFIX.       PXP95004
157900*                                                                         
158000*    CHECK CUSTOMER SUFFIX                                        MCV94181
158100*                                                                 MCV94181
158200     IF  WS-LU6ORH-ERROR-ALL-OK                                   SXK98180
158300     IF LINK-IN                                                   SXK96332
158400        NEXT SENTENCE                                             SXK96332
158500     ELSE                                                         SXK96332
158600     IF CORORH-SUFFIX-000 OR CORORH-CATALINK-PRIMARY-SRC          RXD95362
158700        SET WS-SUFFIX-000            TO  TRUE                     MCV94181
158800     ELSE                                                         MCV94181
158900     IF CORORH-SUFFIX-FLOORING                                    PXP95004
159000        PERFORM 500-CHECK-FLOORING  THRU  500-EXIT                ROR00080
159100     ELSE                                                         MCV94181
159200        MOVE 'R'                  TO  WS-LU6ORH-ERROR-SW          SXK98180
159300        GO TO S0050-EXIT.                                         SXK98180
159400*    FOLLOWING LOGIC ONLY APPLIES TO IMDSI                        SXK96332
159500     IF LINK-IN                                                   SXK96332
159600        IF CORORH-PARENT-SUF                                      SXK96332
159700           SET WS-SUFFIX-000         TO  TRUE                     SXK96332
159800        ELSE                                                      SXK96332
159900        IF  CORORH-FLOOR-SUF                                      SXK96332
160000            PERFORM 500-CHECK-FLOORING  THRU  500-EXIT            ROR00080
160100        ELSE                                                      SXK96332
160200*    CASE SHIP-TO-SUFFIX PROVIDED BUT NO BILL-TO                  SXK96332
160300*    WILL READ SHIP-TO TO GET THE ASSOCIATED BILL-TO              SXK96332
160400*    IF SHIP-TO-SUFFIX THAT CAME IN IS "000", TREAT AS IF         ROR05307
160401*    NO SHIP-TO SUFFIX  CAME IN  FOR BELOW CONDITION'S.           ROR05307
160402        IF  CORORH-SUFFIX         = SPACES                        SXK96332
160500        AND CORORH-SHIP-TO-SUFFIX > SPACES                        SXK96332
160510        AND CORORH-SHIP-TO-SUFFIX NOT EQUAL '000'                 ROR05307
160600           MOVE CORORH-SHIP-TO-SUFFIX  TO  WS-CUST-SUFFIX         SXK96332
160700        ELSE                                                      SXK96332
160800*    CASE NO SHIP-TO OR BILL-TO PROVIDED                          SXK96332
160900*    WILL READ DEFAULT BILL-TO '000' AND GET ASSOCIATED SHIP-TO   SXK96332
161000        IF  CORORH-SUFFIX         = SPACES                        SXK96332
161100*       AND CORORH-SHIP-TO-SUFFIX = SPACES                        ROR05307
161200        AND (CORORH-SHIP-TO-SUFFIX = SPACES OR                    ROR05307
161201             CORORH-SHIP-TO-SUFFIX = '000')                       ROR05307
161202            SET WS-SUFFIX-000            TO  TRUE.                SXK96332
161300*                                                                 ROR99350
161400     IF  WS-LU6ORH-ERROR-ALL-OK                                   PXP95004
161500         PERFORM S2000-GET-CUSTOMER-INFO   THRU S2000-EXIT.       ROR99330
161600*                                                                 ROR00178
      ******************************************************************AYB24152
      * SE8924 GLN IMPLEMENTATION - AS PART OF THE REQUIREMENT DESIGN   AYB24152
      * SHIP TO SUFFIX OR DROP SHIP ADDRESS CAN NOT BE SENT ALONG WITH  AYB24152
      * GLN IN INPUT REQUEST.                                           AYB24152
      ******************************************************************AYB24152
            IF CORORH-GLOBAL-LOC-NBR GREATER THAN SPACES                AYB24152
               IF (CORORH-SHIP-TO-SUFFIX GREATER THAN SPACES) OR        AYB24152
                  WS-SHIP-TO-ADDRESS OR WS-SHIP-TO-ADDRESS-SPCL = 'Y'   AYB24152
                  MOVE 'S'           TO WS-LU6ORH-ERROR-SW              AYB24152
                  MOVE 'GS'          TO WS-LU6ORH-ERROR-FLAG            AYB24152
                  GO TO S0050-EXIT                                      AYB24152
               ELSE                                                     AYB24152
                  PERFORM S5620-STORE-NBR-RESOLVE THRU S5620-EXIT       AYB24152
               END-IF                                                   AYB24152
            END-IF.                                                     AYB24152
      *                                                                 AYB24152
161700     IF NOT WS-LU6ORH-ERROR-ALL-OK                                ROR00178
161800        GO TO S0050-EXIT                                          ROR00178
161900     END-IF.                                                      ROR00178
162000*                                                                 ROR00178
162100* SHOULD REMOVE THIS WS-APPLE CONDITION ONCE APPLE MOVES TO EDI.  ROR05277
162200*                                                                 ROR05277
162300     IF WS-APPLE                                                  ROR05277
162400     OR CORORH-HOLD-ON-ERROR                                      ROR05277
162500        SET WS-HOLD-ON-ERROR  TO TRUE                             ROR05277
162501     END-IF.                                                      ROR05277
162502*                                                                 ROR99330
162503****************************************************              ROR99330
162504*VALIDATE THE DROP SHIP ADDRESS BY SENDING THEM THRU              ROR99330
162505*  GROUP1 AND VERTEX AND APO-FPO LOGIC FOR COMPANY-CODE = 'MD'    ROR99330
162506* EVEN IF WE DONT GO THRU GROUP1....                              ROR00060
162600*    ...WE SHOULD GO THRU APO-FPO CHECKING   .....  AND...        ROR00060
162700*      ...SHOULD GO THRU VERTEX ROUTINE IF ITS NOT APO-FPO ORDER..ROR00060
162800*        ....FOR DROP-SHIP ADDRESS'S & COMPANY-CODE = 'MD'        ROR00060
162900* SHOULD NOT  GO TO  CODE1 VALIDATION PROCESS FOR CANADA ,        ABM18012
163000*  IF BY PASS SWITCH IS Y --AS APPLICATIONS LIKE PCG R NOT READY  ABM18012
163001*    FOR PCG , BYPASS SWITCH  WILL B SET TO "Y" IN PRODUCTION.    ABM18012
163002****************************************************              ROR99330
163003*    IF  WS-LU6ORH-ERROR-ALL-OK  AND  WS-DROPSHIP-MD-SW = 'Y'     ROR17111
163100     IF  WS-LU6ORH-ERROR-ALL-OK AND                               ROR17111
163110         TB-COD1-NORESP         AND                               ABM18012
163200         (WS-DROPSHIP-MD-SW = 'Y'  OR                             ROR17111
163300*         WS-DROPSHIP-FT-SW = 'Y') AND                            ABM18012
163400         (WS-DROPSHIP-FT-SW = 'Y' AND                             ABM18012
163401           TB-COD1-BYPASS-NO))                                    ABM18012
163402*         TB-COD1-NORESP                                          ABM18012
163403*   BASED ON  ANALYSIS OF DPLLOG  FOR LUOH TRANSACTIONS.....      ABM18012
163404*    ABHISHEK TO CHECK.                                           ABM18012
163405*        AND NOT CORORH-ELCOM                                     ABM18012
163406*        AND NOT CORORH-PCS-COMPLEAT                              ABM18012
163407*        PERFORM S1010-GROUP1-VERIFICATION THRU S1010-EXIT        ROR17111
163408         PERFORM S1010-GROUP1-VERIFICATION THRU S1010-CODE1-EXIT  ROR17111
163409         PERFORM S1028-GROUP1-CODE-CAPTURE THRU S1028-EXIT        ROR17111
163410         IF NOT WS-LU6ORH-ERROR-ALL-OK                            FVB00129
163500            IF WS-HOLD-ON-ERROR                                   ROR05277
163600               SET WS-HOLD-ON-ADDR-GRP1-ERR TO TRUE               ROR06075
163610               MOVE 'Y'    TO WS-HOLD-ON-ERROR-TYPE               ROR06075
163700               SET WS-LU6ORH-ERROR-ALL-OK    TO TRUE              ROR01316
163800            ELSE                                                  ROR01316
163900               GO TO S0050-EXIT                                   ROR01316
164000            END-IF                                                ROR01316
164100         END-IF                                                   ROR00060
164110         IF WS-GROUP1-EXPORT-SW = SPACES                          TKC08211
               AND TC-USA                                               BYA22021
164200            PERFORM S1040-APO-FPO-VALIDATION THRU S1040-EXIT      ROR00060
164300            IF NOT WS-LU6ORH-ERROR-ALL-OK                         ROR99330
164400               IF WS-HOLD-ON-ERROR                                ROR05277
164500                  SET WS-HOLD-ON-APO-FPO-ERR TO TRUE              ROR06075
164510                  MOVE 'Y' TO WS-HOLD-ON-ERROR-TYPE               ROR06075
164600                  SET WS-LU6ORH-ERROR-ALL-OK TO TRUE              ROR01316
164700               ELSE                                               ROR01316
164800                  GO TO S0050-EXIT                                ROR01316
164900               END-IF                                             ROR01316
164910            END-IF                                                TKC08211
165000         END-IF.                                                  ROR99330
165100***********************************************************       TEH01213
165200*FOLLOWING LOGIC APPLIES ONLY TO IMDSI CUSTOMERS.                 SXK98180
165300*SHIP-TO-ADDRESS AND SHIP-TO-SUFFIX ARE MUTUALLY EXCLUSIVE        TEH01213
165400***********************************************************               
165500     IF  LINK-IN                                                  SXK96332
165600        IF  WS-LU6ORH-ERROR-ALL-OK                                SXK97113
165700           IF  CORORH-SHIP-TO-SUFFIX > SPACES                     TEH01213
165800              IF WS-SHIP-TO-ADDRESS                               TEH01213
165810              OR WS-SHIP-TO-ADDRESS-SPCL = 'Y'                    TKC07194
165900                  MOVE 'K'            TO  WS-LU6ORH-ERROR-SW      TEH01213
166000                  GO TO S0050-EXIT                                TEH01213
166100              END-IF                                              TEH01213
166200              IF CORORH-SHIP-TO-SUFFIX EQUAL '000'                ROR05307
166300                 SET ITS-NO-SHIPPING-ADDR-ORDER TO TRUE           ROR05307
166301              ELSE                                                ROR05307
166302                  PERFORM S0051-PROCESS-SHIP-BILL-SUFFIX          SXK96332
166303                                              THRU S0051-EXIT     SXK96332
166304              END-IF                                              ROR05307
166400           END-IF                                                 TEH01213
166500*    CASE SHIP-TO-SUFFIX NOT PROVIDED WE READ BILL-TO TO GET      SXK96332
166600*    CUA-DEF-SHIP-BILL-TO THAT IS SHIP-TO-SUFFIX                  SXK96332
166700           IF  WS-NO-SHIP-TO-ADDRESS                              SXK96332
166800           AND CORORH-SHIP-TO-SUFFIX = SPACES                     SXK96332
166900*    CASE SHIP-TO-SUFFIX ASSOCIATED WITH BILL-TO IS SPACES        SXK96332
167000*    ORDER WILL BE CREATED WITH NO SHIP TO ADDRESS AND THIS       SXK96332
167100*    IS A VALID ORDER PER RANDY DAVIS.                            SXK96332
167200               IF CUA-DEF-SHIP-BILL-TO > SPACES                   TEH01213
167300                   MOVE CUA-DEF-SHIP-BILL-TO    TO                TEH01213
167400                                  CORORH-SHIP-TO-SUFFIX           TEH01213
167500                   PERFORM S0051-PROCESS-SHIP-BILL-SUFFIX         TEH01213
167600                                  THRU S0051-EXIT                 TEH01213
167700               ELSE                                               TEH01213
167800                   MOVE SPACES TO CORORH-SHIP-TO-SUFFIX           TEH01213
167900                   MOVE CUA-USPS-FIRM-CODE                        TEH01213
168000                                        TO WS-HOLD-USPS-SW        TEH01213
168100                   SET ITS-NO-SHIPPING-ADDR-ORDER TO TRUE         TEH01213
168200               END-IF                                             TEH01213
168300           END-IF                                                 TEH01213
168400        END-IF                                                    TEH01213
168500     END-IF.                                                      TEH01213
168600*                                                                 ROR00080
168700     IF NOT WS-LU6ORH-ERROR-ALL-OK                                ROR00080
168800        GO TO S0050-EXIT                                          ROR00080
168900     END-IF.                                                      ROR00080
169000*                                                                 ROR00080
169100     IF TC-USA                                                    SXG03308
169200        IF WS-LU6ORH-ERROR-ALL-OK                                 SXG03308
169300           PERFORM S1070-GET-BILLTO-ADDRESS-US  THRU S1070-EXIT   SXG03308
169400        END-IF                                                    SXG03308
169500     ELSE                                                         SXG03308
169600*      IF TB-CO-VAL-EXP-COMPL-OK                                  ROR04162
169700        IF WS-LU6ORH-ERROR-ALL-OK                                 SXG03308
169800           AND CORORH-COMPANY-CODE NOT EQUAL TO 'MD'              SXG03308
169900           PERFORM S1071-GET-BILLTOEXP-NON-US   THRU S1071-EXIT   SXG03308
170000        END-IF                                                    SXG03308
170100*      END-IF                                                     ROR04162
170200     END-IF.                                                      SXG03308
170300*                                                                 ROR04064
170400* IN BELOW 1090-,1091- PARAGRAPHS WE WERE NOT COMPARING           ROR04064
170500*  BILL-TO-CNTRY-CODE TO PROPER SHIP-TO-CNTRY-CODE!!              ROR04064
170600*  THIS CODE WILL BE FIXING IT.                                   ROR04064
170700*                                                                 ROR04064
170800*    IF TB-CO-VAL-EXP-COMPL-OK                                    ROR04162
170900        IF WS-EXP-ST-CNTRY-CODE > SPACES                          ROR04064
171000           MOVE WS-EXP-ST-CNTRY-CODE TO WS-EXP-SHIPTO-CNTRY       ROR04064
171100        ELSE                                                      ROR04064
171200           MOVE WS-EXP-SI-CNTRY-CODE TO WS-EXP-SHIPTO-CNTRY       ROR04064
171300        END-IF.                                                   ROR04162
171400*    END-IF.                                                      ROR04162
171500*                                                                 ROR04064
171600*-------------- CHECK FOR 'E' COUNTRY ----------------------      SXG03308
171700     IF TB-CO-VAL-EXP-COMPL-OK AND WS-LU6ORH-ERROR-ALL-OK         SXG03308
171800        PERFORM S1090-DETERMINE-E-CNTRY THRU S1090-EXIT.          SXG03308
171900                                                                  SXG03308
172000*-------------- EXPORT FULFILLMENT LOGIC -------------------      SXG03308
172100     IF TB-CO-VAL-EXP-COMPL-OK AND                                SXG03308
172200        TB-CO-VAL-EXPO-FULFILL-CO AND WS-LU6ORH-ERROR-ALL-OK      SXG03308
172300        PERFORM S1091-CHK-EXP-FULFILLMENT THRU S1091-EXIT         SXG03308
172400     END-IF.                                                      SXG03308
172500*                                                                 SXG03308
172600     IF CORORH-SHIP-TO-SUFFIX > SPACES                            ROR03315
172610     AND CORORH-SHIP-TO-SUFFIX NOT EQUAL '000'                    ROR05307
172700         MOVE CORORH-COMPANY-CODE     TO  WS-CUSHED-CO            ROR03315
172800         MOVE WS-CUST-BR-NBR          TO  WS-CUSHED-BR            ROR03315
172900         MOVE WS-CUST-NUMBER          TO  WS-CUSHED-CUST          ROR03315
173000         MOVE CORORH-SHIP-TO-SUFFIX   TO WS-CUSADR-SUFFIX         ROR03315
173100         PERFORM 1002-GU-CUSADR.                                  ROR03315
173200*                                                                 ROR01068
173300***********************************************************       ROR01068
173400*IF CUST DOESN'T GIVE ANY CARRIER..GET THE DEFAULT FROM CUST D.B..ROR01068
173500* SEQ IS ---> SHIP-TO --> BILL-TO -->  REGION DEFAULT !!          ROR01068
173600* FOR U.K ,SEQ IS --> SHIP-TO --> ALT-SHIP-TO --> BILL-TO -->     ROR01068
173700*                     ALT-BILL-TO --> REGION-DEFAULT !!.          ROR01068
173800***********************************************************       ROR01068
173900*                                                                 ROR01068
174000     IF WS-ST-DEF-CAR GREATER THAN SPACES                         ROR01068
174100        MOVE WS-ST-DEF-CAR          TO WS-DEFAULT-CARRIER         ROR01068
174200     ELSE                                                         ROR01068
174300     IF TC-UNITED-KINGDOM AND                                     ROR01068
174400        WS-ST-ALT-DEF-CAR GREATER THAN SPACES                     ROR01068
174500        MOVE WS-ST-ALT-DEF-CAR      TO WS-DEFAULT-CARRIER         ROR01068
174600     ELSE                                                         ROR01068
174700     IF WS-BT-DEF-CAR GREATER THAN SPACES                         ROR01068
174800        MOVE WS-BT-DEF-CAR          TO WS-DEFAULT-CARRIER         ROR01068
174900     ELSE                                                         ROR01068
175000     IF TC-UNITED-KINGDOM AND                                     ROR01068
175100        WS-BT-ALT-DEF-CAR GREATER THAN SPACES                     ROR01068
175200        MOVE WS-BT-ALT-DEF-CAR      TO WS-DEFAULT-CARRIER         ROR01068
175300     ELSE                                                         ROR01068
175400     IF TB-CPO-DEFAULT-CARRIER GREATER THAN SPACES                ROR01068
175500        MOVE TB-CPO-DEFAULT-CARRIER TO WS-DEFAULT-CARRIER         ROR01068
175600        MOVE 'Y'                    TO WS-CO-DEFAULT-CARRIER      TKC03271
175700     END-IF.                                                      ROR01068
175800*                                                                 ROR01068
175900*THE ABOVE LOGIC WILL GET OVERRIDDEN  FOR DROPSHIP ORDERS :       ROR06194
176000* CURRENTLY THIS TBX TABLE IS SETUP ONLY IN U.K.                  ROR06194
176100* THIS LOGIC APPLIES TO ALL THE COUNTRIES AS LONG AS THIS TBX     ROR06194
176200* TABLE IS SETUP PROPERLY IN THAT REGION.                         ROR06194
176300*                                                                 ROR06194
176400* WE WILL BE GOING THRU SPECIAL PROCESS FOR ORDERS PLACED ,       ROR06194
176500* WHEN DROPSHIP ADDRESS IS SPECIFIED AND NO CARRIER IS SENT IN.   ROR06194
176600* THIS NEW PROCESS WILL TELL US WHAT DEFAULT CARRIER TO ASSIGN    ROR06194
176700* BASED ON WHAT POSTAL CODE IS COMING IN.                         ROR06194
176800* THIS IS PART OF DELL GFX PROJECT.                               ROR06194
176900*                                                                 ROR06194
177000     IF WS-SHIP-TO-ADDRESS AND                                    ROR06194
177100        CORORH-SHIP-VIA-CARRIER-CODE EQUAL SPACES                 ROR06194
177200        MOVE CORORH-COMPANY-CODE       TO TB-VALPC-COUNTRY-CODE   ROR06194
177300        MOVE WS-POSTAL-CODES(1:2)      TO TB-VALPC-POSTCODE       ROR06194
177400        CALL 'SYU510'           USING TB-VALPC-PROC-IA            ROR06194
177500        IF TB-VALPC-NORESP                                        ROR06194
177600           IF TB-VALPC-CARRIER(1) GREATER THAN SPACES             ROR06194
177700              MOVE TB-VALPC-CARRIER(1) TO WS-DEFAULT-CARRIER      ROR06194
177800              MOVE 'Y'                 TO WS-CO-DEFAULT-CARRIER   ROR06194
177900           END-IF                                                 ROR06194
178000        END-IF                                                    ROR06194
178100     END-IF.                                                      ROR06194
178200*                                                                 ROR06194
178300* THIS IS PART OF DELL GFX PROJECT.                               ROR06194
178301*                                                                 ROR06194
178302     IF CORORH-SHIP-VIA-CARRIER-CODE EQUAL SPACES                 SXG03059
178303        IF (CORORH-SHIP-TO-STATE = 'AK' OR 'HI')                  SXG03059
178304           MOVE 'Y' TO WS-NON-STD-FLAG                            SXG03059
178305        ELSE                                                      SXG03059
178306          IF CUA-STATE-CODE = 'AK' OR 'HI'                        SXG03059
178307             MOVE 'Y' TO WS-NON-STD-FLAG                          SXG03059
178308          END-IF                                                  SXG03059
178309        END-IF                                                    SXG03059
178310     END-IF.                                                      SXG03059
178320*                                                                 SXG03059
178330*   IF CARR NOT COMING IN FOR EXPORT ORDERS(SHIPING OUT OF CNTRY) ROR07030
178340*      ASSIGN "OT" AS DEFAULT CARRIER.  PER JAMES MYHILL.         ROR07030
178350*--> FOR ORDERS PLACED IN US , WE ALREADY TOOK CARE OF THIS LOGIC ROR07030
178360*     BY ASSIGNING "UI" , SO EXCLUDE USA FROM ABOVE RULE.         ROR07030
178370*-->HAVE TO CONSIDER CANADA  , "FT"  "CA" SCENARIO.               ROR07030
178380*   ORDERS COMING IN WITH SHIP-TO-CNTRY = 'FT' , 'CA' SHOULD BE   ROR07030
178390*   AS DOMESTIC ORDERS,EVENTHOUGH CO-CODE NOT EQ SHIP-CNTRY-CODE  ROR07030
178400*-->HAVE TO CONSIDER NORDIC REGION SCENARIO.                      ROR07030
178500* NORDIC REGION HAS CUSTOMERS BELONGING TO NO , DK , SE , FI..    ROR07030
178600*  BUT ALL OF THEM  WILL BE SENDING IN "SE" AS COMPANY CODE       ROR07030
178700*  WHILE PLACING ORDERS. THESE COUNTRIES CAN BE DIFFERENTIATED    ROR07030
178800*  BASED ON THE BRANCH NUMERS OF ACCOUNT NUMERS COMING IN.        ROR07030
178900*    INCOMING    **  INCOMING   ** ORIGINAL COUNTRY               ROR07030
179000*    COMPANYCODE ** CUST BRANCH ** THAT CUSTOMER BELONGS TO       ROR07030
179100*      SE              30                DK                       ROR07030
179200*      SE              31                FI                       ROR07030
179300*      SE              32                NO                       ROR07030
179400*      SE              33                SE                       ROR07030
179500*                                                                 ROR07030
179600     MOVE SPACES TO WS-EXP-ST-CNTRY.                              ROR07030
179700     IF WS-EXP-ST-CNTRY-CODE GREATER THAN SPACES                  ROR07030
179800        MOVE WS-EXP-ST-CNTRY-CODE TO WS-EXP-ST-CNTRY              ROR07030
179900        EVALUATE TC-COMPANY                                       ROR07030
180000        WHEN 'FT'                                                 ROR07030
180100              IF WS-EXP-ST-CNTRY-CODE EQUAL ('FT' OR 'CA')        ROR07030
180200                 MOVE SPACES TO WS-EXP-ST-CNTRY                   ROR07030
180300              END-IF                                              ROR07030
180400        WHEN 'MD'                                                 ROR07030
180500              MOVE SPACES TO WS-EXP-ST-CNTRY                      ROR07030
180600        WHEN 'SE'                                                 ROR07030
180700* THIS MEANS ORDERS ARE PLACED IN NORDIC REGION.                  ROR07030
180800              IF ((CORORH-BR-NBR EQUAL '30') AND                  ROR07030
180900                  (WS-EXP-ST-CNTRY-CODE EQUAL 'DK')) OR           ROR07030
181000                 ((CORORH-BR-NBR EQUAL '31') AND                  ROR07030
181100                  (WS-EXP-ST-CNTRY-CODE EQUAL 'FI')) OR           ROR07030
181200                 ((CORORH-BR-NBR EQUAL '32') AND                  ROR07030
181300                  (WS-EXP-ST-CNTRY-CODE EQUAL 'NO')) OR           ROR07030
181400                 ((CORORH-BR-NBR EQUAL '33') AND                  ROR07030
181500                  (WS-EXP-ST-CNTRY-CODE EQUAL 'SE'))              ROR07030
181600                 MOVE SPACES TO WS-EXP-ST-CNTRY                   ROR07030
181700              ELSE                                                ROR07030
181800                 MOVE 'Y'    TO WS-ASSIGN-OT-TO-NORDIC-SW         ROR07030
181900              END-IF                                              ROR07030
182000        END-EVALUATE                                              ROR07030
182100     END-IF.                                                      ROR07030
182101*                                                                 ROR07030
182102     IF CORORH-SHIP-VIA-CARRIER-CODE EQUAL SPACES                 ROR01068
182103        SET WS-CARR-NOT-ENTERED        TO  TRUE                   ROR01068
182104        IF (WS-EXP-ST-CNTRY GREATER THAN SPACES) AND              ROR07030
182105           ((WS-EXP-ST-CNTRY NOT EQUAL CORORH-COMPANY-CODE) OR    ROR07030
182106            (WS-ASSIGN-OT-TO-NORDIC))                             ROR07030
      *    FOR EUROPE AND EXPORT ORDER,IF WE DONT RECEIVE CARRIER CODE  NR121261
      *    ORDER COMING FROM IM360 , MOVE DEFAULT CARRIER-CODE          NR121261
      *          IF TC-COMPANY = 'ES' AND (WS-TERM-ID-FROM-IM360 OR     SK824062
      *                                    WS-TERM-ID-FROM-X4A)         SK824062
                 IF TB-IL-EU-DFLT-CARR-EXPORT                           SK824062
                    MOVE WS-DEFAULT-CARRIER                             NR121261
                      TO CORORH-SHIP-VIA-CARRIER-CODE                   NR121261
                 ELSE                                                   NR121261
                    MOVE 'OT' TO CORORH-SHIP-VIA-CARRIER-CODE           NR121261
182108*    FOR EUROPE ONLY , WE SHOULD KEEP THE ORDER ON "SF" HOLD.     ROR07030
182109*    REPLACE THIS HARD CODING WITH TBX TABLE SWITCH.              ROR07030
                    IF TC-EUROPE                                        NR121261
                       MOVE 'Y' TO WS-HOLD-ON-ASSIGN-OT                 NR121261
                    END-IF                                              NR121261
                 END-IF                                                 NR121261
182131        ELSE                                                      ROR07030
182132           IF WS-DEFAULT-CARRIER GREATER THAN SPACES              ROR01068
182133              MOVE WS-DEFAULT-CARRIER  TO                         ROR01068
182134                                    CORORH-SHIP-VIA-CARRIER-CODE  ROR01068
182135           END-IF                                                 ROR01068
182136        END-IF                                                    ROR07030
182137     END-IF.                                                      ROR01068
182138*                                                                 ROR01068
182139     IF CORORH-SHIP-VIA-CARRIER-CODE EQUAL SPACES                 ROR01068
182140        MOVE 'V'                       TO  WS-LU6ORH-ERROR-SW     ROR01068
182141        GO TO S0050-EXIT                                          ROR01068
182142     END-IF.                                                      ROR01068
182143*                                                                 ROR01068
182144*************************                                         ROR00199
182145*    IF DROP-SHIP ADDR  OR SHIP-TO-SUF -->IS NOT PROVIDED         ROR00199
182146*     IF BILL-TO-SUFF  DOESNT HAVE  DEF  SHIP-TO-SUF   &          ROR00199
182147*      BILL-TO HAS EXPORT ADDR --> IMPLIES  ITS AN EXPORT ORDER!! ROR00199
182148*************************                                  .      ROR00199
182149     IF ITS-NO-SHIPPING-ADDR-ORDER AND                            ROR00199
182150        ITS-BILL-TO-EXPORT-ORDER                                  ROR00199
182151        SET ITS-SHIP-TO-EXPORT-ORDER TO TRUE                      ROR00199
182152        SET ORSH-EXPORT-ORDER        TO TRUE                      ROR00199
182153     END-IF.                                                      ROR00199
182154*                                                                 ROR00313
182155*    CANT  HAVE  THIRD-PARTY-FRT-ACCT NUMBER  FOR  EXPORT ORDERS! ROR00313
182156*                                                                 ROR00313
182157     IF ITS-SHIP-TO-EXPORT-ORDER AND                              ROR00313
182158        CORORH-THIRD-PARTY-FRT-ACCOUNT GREATER THAN SPACES        ROR00313
182159        MOVE '7'                     TO WS-LU6ORH-ERROR-SW        ROR00313
182160        MOVE 'X7'                    TO WS-LU6ORH-ERROR-FLAG      ROR00313
182161        GO TO S0050-EXIT                                          ROR00313
182162     END-IF.                                                      ROR00313
182163*************************                                  .      ROR00199
182164*    FOR EXPORT ORDERS..                                   .      ROR00199
182165*     B'CAUSE OF DROP-SHIP OR SHIP-TO ..IF NO CARR..DEF --> 'UI'  ROR00199
182166*          INSTEAD OF 'UI' , ASSIGN 'AR' PER SCOTT , KRISTI       ROR10013
182167*             FOR DIRECT SHIP EXPORT ORDERS PLACED IN US.         ROR10013
182168*     B'CAUSE OF BILL-TO  ..IF NO CARR..DEF --> REGION DEFAULT !! ROR00199
182169*    FOR  APO-FPO  IF  CARR NOT PROVIDED..DEF TO ''MX''           SXG03305
182170*    THIS ABOVE COMMENT WILL NO LONGER BE NEEDED, AS WE DO NOT    SXG03305
182171*    ASSIGN 'MX' AS CARRIER FOR APO/FPO ORDERS.                   SXG03305
182172*************************                                  .      ROR00199
182173     IF TC-USA                                                    ROR00199
182174        IF  WS-CARR-NOT-ENTERED                                   ROR00199
182175            IF ITS-SHIP-TO-EXPORT-ORDER                           ROR00199
                     IF CORORH-SIMULATED-ORDER-SW = 'Y' AND             VZM21218
                        CORORH-FREIGHT-FORWARDER NOT EQUAL SPACES       VZM21218
                         NEXT SENTENCE                                  VZM21218
                     ELSE                                               VZM21218
                         MOVE TC-COMPANY                  TO            VZM21218
                              TB-CUSXP-SHIP-FROM-COMPANY                VZM21218
                         MOVE CORORH-SHIP-TO-CNTRY-CODE   TO            VZM21218
                              TB-CUSXP-SHIP-TO-COMPANY                  VZM21218
                         MOVE WS-CUSTOMER-KEY             TO            VZM21218
                              TB-CUSXP-CUST-ACCOUNT                     VZM21218
                         CALL 'SYU510'        USING TB-CUSXP-PROC-IA    VZM21218
                         IF (CORORH-DIRECT-SHIP = 'Y')                  VZM21218
                            MOVE 'AR'                   TO              VZM21218
                                           CORORH-SHIP-VIA-CARRIER-CODE VZM21218
                         ELSE                                           VZM21218
                            MOVE 'UI'                   TO              VZM21218
                                           CORORH-SHIP-VIA-CARRIER-CODE VZM21218
                         END-IF                                         VZM21218
                     END-IF                                             VZM21218
182190            ELSE                                                  ROR00199
182200               IF ITS-BILL-TO-EXPORT-ORDER                        ROR00199
182300                  MOVE TB-CPO-DEFAULT-CARRIER TO                  ROR00199
182400                                 CORORH-SHIP-VIA-CARRIER-CODE     ROR00199
182500               END-IF                                             ROR00199
182600            END-IF                                                ROR00199
182700        END-IF                                                    ROR00199
182800     END-IF.                                                      ROR00199
182900***********************************************************       ROR00080
183000*VALIDATE THE CARRIER CODE AGAINST TBXCARR FOR REGULAR ORDERS     ROR00080
183100*                        & AGAINST TBXCAR2 FOR EXPORT ORDERS      SXG03305
183200* IF NOT NORMAL RESPONSE......                                    ROR00080
183300*   IN CASE OF NORMAL ORDERS....ERROR..."V"                       ROR00080
183400***********************************************************       ROR00080
183500*                                                                 ROR00080
183600        MOVE CORORH-COMPANY-CODE             TO TB-CARR-CO        ROR00080
183700        MOVE CORORH-SHIP-VIA-CARRIER-CODE    TO TB-CARR-CODE      ROR00080
183800        MOVE 'TBXCARR '                      TO TB-CARR-TB-NAME   ROR00080
183900        MOVE '$$'                            TO TB-CARR-COMPANY   ROR00080
184000        CALL 'SYU510' USING TB-CARRIER-TABLE-IA                   ROR00080
184100        IF TB-CARR-NORESP                                         ROR00080
184200           MOVE CORORH-COMPANY-CODE          TO WS-CARR-CODE(1:2) ROR00080
184300           MOVE CORORH-SHIP-VIA-CARRIER-CODE TO WS-CARR-CODE(3:2) ROR00080
184400        ELSE                                                      ROR00080
184500           IF WS-HOLD-ON-ERROR                                    ROR05277
184600              SET WS-HOLD-ON-CARR-ERR TO TRUE                     ROR06075
184610              MOVE 'Y'                TO WS-HOLD-ON-ERROR-TYPE    ROR06075
184700           ELSE                                                   ROR01316
184800              MOVE 'V'                       TO WS-LU6ORH-ERROR-SWROR01316
184900              GO TO S0050-EXIT                                    ROR01316
185000           END-IF                                                 ROR01316
185100        END-IF.                                                   SXG03305
185200*                                                                 SXG03305
185300* ZIP CODE VALIDATION LOGIC (IT USED TO BE IN S0056- PARA)        SXG03305
185400* --------------------------                                      TKC04099
185500* CHANGE TO VALIDATE SHIP TO COUNTRY FOR EUROPE EXCEPT NL         TKC04099
185600* --------------------------                                      SXG03305
185700*  WE DONT WANT TO DO ANY SPECIAL LOGIC FOR NETHERLANDS.          ROR06194
185800*      PER EUROPEAN TEAM - JAMES MYHILL.                          ROR06194
185900*  OLD LOGIC :                                                    ROR06194
186000*  IF WEB , NO MATTER  WHAT  COUNTRY WE ARE SHIPPING TO ,         ROR06194
186100*    WE USED TO ASSUME THEY ARE SHIPPING WITHIN NETHERLANDS AND   ROR06194
186200*    WE USED TO PERFORM NETHERLANDS POSTALCODE VALIDATION.        ROR06194
186300*  IF IL/XML, NO MATTER  WHAT  COUNTRY WE ARE SHIPPING TO ,       ROR06194
186400*   IF SHIPPING WITHIN NETHERLANDS ,                              ROR06194
186500*       WE USED TO PERFORM NETHERLANDS POSTALCODE VALIDATION.     ROR06194
186600*   IF SHIPPING OUTSIDE NETHERLANDS ,                             ROR06194
186700*    WE USED TO SKIP POSTAL CODE VALIDATION AND ACCEPT THE ADDRESSROR06194
186800*     AS IT CAME IN.                                              ROR06194
186900*  NEW LOGIC :                                                    ROR06194
187000*    DO RESPECTIVE  POSTALCODE VALIDATION BASED ON WHICH          ROR06194
187100*      COUNTRY THE ORDER IS SHIPPING TO.                          ROR06194
187200*                                                                 ROR06271
187300* FIX FOR UK DROP SHIP ISSUE IN NETHERLANDS.                      ROR06271
187400*  BY PASS UK POST CODE VALIDATION FOR UK DROPSHIP ORDERS IN NL.  ROR06271
187500*                                                                 PKV10104
187600* SKIP POSTAL CODE VALIDATION FOR ORDERS SHIPPING TO 'IE'         PKV10104
187700* MADE CHANGE INSIDE S0057U- PARA.                                PKV10104
187800*  ---NEW RULE FROM BUSINESS AS IRELAND DOESNT HAVE ANY VALID     PKV10104
187900*        POSTAL CODE FORMAT.                                      PKV10104
187901*                                                                 ROR06194
187902     IF LINK-IN AND (NOT TC-USA)                                  SXG03305
187903*       IF CORORH-COMPANY-CODE = 'NL'                             ROR06194
187904*          MOVE CORORH-COMPANY-CODE        TO WS-TO-COUNTRY-CODE  ROR06194
187905*       ELSE                                                      ROR06194
187906        IF TB-CPO-EUROPEAN-CNTRY AND                              TKC04099
187907           CORORH-SHIP-TO-CNTRY-CODE > SPACES                     TKC04099
187908           MOVE CORORH-SHIP-TO-CNTRY-CODE   TO WS-TO-COUNTRY-CODE TKC04099
187909        ELSE                                                      TKC04099
187910           MOVE CORORH-COMPANY-CODE         TO WS-TO-COUNTRY-CODE TKC04099
187920        END-IF                                                    TKC04099
187930*       END-IF                                                    ROR06194
187940        IF WS-TO-COUNTRY-CODE = ('UK' OR 'IE' OR 'GB')            ROR06271
187941        AND (NOT TC-NETHERLANDS)                                  ROR06271
187942            IF CORORH-SHIP-TO-ZIP > SPACES                        SXG03305
187943             PERFORM S0057U-UK-VALIDATE-POSTCODE THRU S0057U-EXIT SXG03305
187944            END-IF                                                SXG03305
187945        ELSE                                                      SXG03305
187946            IF WS-SHIP-TO-ADDRESS-SW = 'Y'                        SXG03305
187947               PERFORM S0057-VALIDATE-POSTCODE THRU S0057-EXIT    SXG03305
187948            END-IF                                                SXG03305
187949        END-IF                                                    SXG03305
187950     END-IF.                                                      SXG03305
187951*                                                                 SXG03305
187952****************************************************                      
188000*EDIT TTHE CARRIER CODE FOR THE IMDSI ONLY                        SXK97077
188100****************************************************                      
188200     IF WS-LU6ORH-ERROR-ALL-OK                                    SXG03305
188300       IF LINK-IN AND                                             SXG03305
188400        (WS-APO-FPO-ORDER OR NOT ORSH-EXPORT-ORDER)               ROR00080
188500        IF  TC-USA                                                ROR00326
188600           PERFORM S0052-EDIT-CARRIER-CODE    THRU S0052-EXIT     SXK98180
188700        ELSE                                                      SXK98180
188800           PERFORM S0056-EDIT-CARRIER-ZIP     THRU S0056-EXIT     SXG04030
188900        END-IF                                                    SXG04030
189000* DONT NEED THIS BELOW TBXMAFC VALIDATION HERE.                   ROR09217
189100*  WE ARE SUPPOSED TO DO THIS VALIDATION WITH SHIPPING BRANCH     ROR09217
189200*   WHICH IS NOT THE CASE HERE.                                   ROR09217
189300*  REMOVED THIS PER TRAM/CAROL RECOMENDATION.                     ROR09217
189400*       IF TC-USA OR TC-CANADA                                    ROR09217
189500*          PERFORM S0054-READ-TBXMAFC         THRU S0054-EXIT     ROR09217
189501*       END-IF                                                    ROR09217
189502       END-IF                                                     SXG04030
189503     END-IF.                                                      SXG04030
189504*                                                                         
189600****************************************************                      
189700* CANNOT HAVE  DROP-SHIP ADDRESS FOR  ORDERS  WITH COD TERMS!!!   ROR00276
189800* --> SPAIN IS AN EXCEPTION....IF COMMING THRU INSIDELINE.        ROR01068
189900****************************************************                      
190000     IF  WS-LU6ORH-ERROR-ALL-OK                                   SXK97153
190100       IF  WS-SHIP-TO-ADDRESS                                     ROR99214
190110       OR  WS-SHIP-TO-ADDRESS-SPCL = 'Y'                          TKC07194
                 IF ((TC-SPAIN OR TC-PORTUGAL)                          ROR22035
                     AND CORORH-SYSTEM-ID = 'IM')                       ROR22035
                     OR (TC-COMPANY = ('YM' OR 'EH'))                   ROR22035
190300              NEXT SENTENCE                                       ROR01068
190400           ELSE                                                   ROR01068
190500           IF CORORH-COD-TERM                            OR       ROR00276
190600              (WS-TERMS NUMERIC AND WS-COD-ORDER)        OR       ROR00276
190700              (VALID-TERMS-ENTERED AND CORORH-COD-TERMS)          ROR00276
190800               MOVE 'D'               TO  WS-LU6ORH-ERROR-SW.     ROR00276
190900*                                                                 ROR99350
191000     IF NOT WS-LU6ORH-ERROR-ALL-OK                                        
191100        AND CORORH-R-RECORD-RESPONSE-FLAG NOT = 'W'               ROR99015
191200        MOVE WS-LU6ORH-ERROR-SW       TO  CORORH-R-ERROR-TYPE     PXP95004
191300        PERFORM S1000-SET-ERRORS THRU S1000-EXIT.                 ROR02128
192201*                                                                 ROR15254
192202*--- WHEN WE FIND AN  ALREADY EXISTING ORDER WITH THE SAME P.O    ROR04064
192203*---  IF ITS  NOT VOIDED..ITS AN  ERROR !!!!!                     ROR04064
192204*                                                                 ROR04064
192205*--- CHECK CUSTOMER PO NUMBER FIRST   ---------------             ROR04064
192206*                                                                 ROR04064
192207*--- FOR EAI AND PCG REQUEST DUPLICATE PO CHECK BEHAVES IN        DXB16281
192208*--- IN SIMILAR WAY                                               DXB16281
      *    NOT APPLICABLE FOR MOBILE ORDERS , AS THEY SHOULD BEHAVE     ROR19067
      *    THE SAME WAY-WHEN THEY CAME THROUGH RPC/JGATE ROUTE,         ROR19067
      *    EVEN WHEN THEY COME THROUGH SUBSTATION ROUTE- ARMOR PROJECT  ROR19067
      *                                                                 ROR19067
192209     IF CORORH-CUSTOMER-TO-INGRAM-PO > SPACES                     ROR04064
192210        IF CORORH-CUSTOMER-TO-INGRAM-PO = 'SITESCOPETESTORDER'    ROR04064
192211           OR CORORH-SIMULATED-ORDER-SW = 'Y'                     TEH17279
192212           NEXT SENTENCE                                          ROR04064
192213        ELSE                                                      ROR04064
192310           IF  CUB-CHECK-CUST-PO-IL     OR                        ROR06075
192400              (CUB-CHECK-CUST-PO AND                              ROR04064
192800               (TC-ASIA-PACIFIC-COMPANY OR                        TEH05195
192810               (WS-FROM-SUBSTATION AND NOT                        ROR19067
                     (WS-TERM-ID-FROM-WEB-MOBILE OR WS-TERM-ID-PCG)) OR ROR19067
192900                TC-EUROPE))                                       ROR04064
193000              PERFORM S2500-EDIT-CUST-PO-NBR THRU S2500-EXIT      ROR04064
193100           END-IF                                                 ROR04064
193200        END-IF                                                    ROR04064
193300     ELSE                                                         ROR08283
193400        IF CUB-CUST-ORD-NBR-REQ                                   TEH19031
193401           IF WS-FROM-SUBSTATION                                  TEH19031
                   IF  WS-TERM-ID     = ('WEBX' OR 'WEBS' OR 'WEB2' OR  ROR19067
                                         'WEBM' OR 'GRPA' OR 'WTDP')    NZP21261
193403                CONTINUE                                          TEH19031
193404             ELSE                                                 TEH19031
193405                 MOVE '5'            TO  WS-LU6ORH-ERROR-SW       TEH19031
193406                 MOVE 'E5'           TO  WS-LU6ORH-ERROR-FLAG     TEH19031
193407              END-IF                                              TEH19031
193408           END-IF                                                 TEH19031
193409        END-IF                                                    TEH19031
193410     END-IF.                                                      TEH19031
193703*                                                                 ROR04064
      * CORP SWITCH SET AS B, IMPLIES THAT S IS ALLOWED TOO.            MS221281
           MOVE SPACES TO WS-NP-ORDER-IND-SW                            MS221281
193703     IF CORORH-NP-ORDER-IND  > SPACES     AND                     MS221009
              TB-CPO7-NET-PRICNG-PROCESS                                MS221281
              EVALUATE TB-CPO7-NP-REPL-B2B-SW                           NXC22035
                  WHEN 'Y'                                              NXC22035
                       IF CORORH-NP-ORDER-IND  = 'B' OR                 NXC22035
                          CORORH-NP-ORDER-IND  = 'R' OR                 NXC22035
                          CORORH-NP-ORDER-IND  = 'S'                    NXC22035
                             SET WS-NP-ORDER-IND TO TRUE                NXC22035
                       ELSE                                             NXC22035
                          MOVE '6'   TO  WS-LU6ORH-ERROR-SW             NXC22035
                          MOVE 'E6'  TO  WS-LU6ORH-ERROR-FLAG           NXC22035
                       END-IF                                           NXC22035
                  WHEN 'R'                                              NXC22035
                       IF CORORH-NP-ORDER-IND  = 'R'                    NXC22035
                          SET WS-NP-ORDER-IND TO TRUE                   NXC22035
                       ELSE                                             NXC22035
                          MOVE '6'      TO  WS-LU6ORH-ERROR-SW          NXC22035
                          MOVE 'E6'     TO  WS-LU6ORH-ERROR-FLAG        NXC22035
                       END-IF                                           NXC22035
                  WHEN 'S'                                              NXC22035
                       IF CORORH-NP-ORDER-IND     = 'S' OR              NXC22035
                          CORORH-NP-ORDER-IND     = 'B'                 NXC22035
                          SET WS-NP-ORDER-IND TO TRUE                   NXC22035
                       ELSE                                             NXC22035
                          MOVE '6'      TO  WS-LU6ORH-ERROR-SW          NXC22035
                          MOVE 'E6'     TO  WS-LU6ORH-ERROR-FLAG        NXC22035
                       END-IF                                           NXC22035
                  WHEN 'B'                                              NXC22035
                       IF CORORH-NP-ORDER-IND     = 'B'                 NXC22035
                             SET WS-NP-ORDER-IND TO TRUE                NXC22035
                       ELSE                                             NXC22035
                          MOVE '6'      TO  WS-LU6ORH-ERROR-SW          NXC22035
                          MOVE 'E6'     TO  WS-LU6ORH-ERROR-FLAG        NXC22035
                       END-IF                                           NXC22035
              END-EVALUATE                                              NXC22035
           END-IF.                                                      NXC22035
                                                                        NXC22035
           IF WS-NP-ORDER-IND                                           NXC22035
              IF CORORH-DIRECT-SHIP      = 'Y'                          NXC22035
                 IF CORORH-NP-ORDER-IND  = 'S'                          NXC22035
                    NEXT SENTENCE                                       NXC22035
                 ELSE                                                   NXC22035
                    MOVE '6'            TO  WS-LU6ORH-ERROR-SW          NXC22035
                    MOVE 'E6'           TO  WS-LU6ORH-ERROR-FLAG        NXC22035
                 END-IF                                                 NXC22035
              ELSE                                                      NXC22035
                 IF CORORH-NP-ORDER-IND  = ('B' OR 'R')                 NXC22035
                    NEXT SENTENCE                                       NXC22035
                 ELSE                                                   NXC22035
                    MOVE '6'            TO  WS-LU6ORH-ERROR-SW          NXC22035
                    MOVE 'E6'           TO  WS-LU6ORH-ERROR-FLAG        NXC22035
                 END-IF                                                 NXC22035
              END-IF                                                    NXC22035
           END-IF.                                                      NXC22035
                                                                        MS221281
193704     IF NOT WS-LU6ORH-ERROR-ALL-OK                                ROR04064
193705        GO TO S0050-EXIT                                          ROR04064
193706     END-IF.                                                      ROR04064
193800*                                                                 ROR04064
193900*                                                                 ROR05314
194000     IF ORH-FLOOR-SUF                                             ROR05314
194100        MOVE WS-FLOOR-TERMS           TO  WS-DEFAULT-TERMS        ROR05314
194200     ELSE                                                         ROR05314
194300        MOVE CUB-TERMS                TO  WS-DEFAULT-TERMS        ROR05314
194400     END-IF.                                                      ROR05314
      *                                                                 SS122155
           IF CORORH-CISCO-ORD-SW > SPACES                              KXS25010
              IF CORORH-CISCO-CCWR-ALL                                  KXS25010
                 IF TB-IL-ALLOW-CIS-CCWR-DES-Y                          KXS25010
                    CONTINUE                                            KXS25010
                 ELSE                                                   KXS25010
                    MOVE 'B'           TO  WS-LU6ORH-ERROR-SW           KXS25010
                    MOVE 'HB'          TO  WS-LU6ORH-ERROR-FLAG         KXS25010
                    SET CORORH-R-ERR-NOT-ALW-CISCO-IND TO TRUE          KXS25010
                    GO TO S0050-EXIT                                    KXS25010
                 END-IF                                                 KXS25010
              ELSE                                                      KXS25010
                 MOVE 'A'              TO  WS-LU6ORH-ERROR-SW           KXS25010
                 MOVE 'HA'             TO  WS-LU6ORH-ERROR-FLAG         KXS25010
                 SET  CORORH-R-ERR-INV-CISCO-IND TO TRUE                KXS25010
                 GO TO S0050-EXIT                                       KXS25010
              END-IF                                                    KXS25010
           END-IF.                                                      KXS25010
194500*                                                                 ROR05314
194600* HERE WE HAVE TO MAKE SURE WE DO ALL THE SECURITY CHECKS,        ROR05314
194700*  B4 ALLOWING CERTAIN TRANSACTIONS TO CHANGE CERTAIN RESTRICTED  ROR05314
194800*   FIELDS ON THE ORDER.                                          ROR05314
194900*                                                                 ROR05314
195000     PERFORM S0060-PROCESS-SEC-CHECK  THRU S0060-EXIT.            ROR05314
195100     IF NOT WS-LU6ORH-ERROR-ALL-OK                                ROR05314
195200        GO TO S0050-EXIT                                          ROR05314
195300     END-IF.                                                      ROR05314
195400*                                                                 ROR05314
195401*                                                                 ROR05314
195402 S0050-EXIT.    EXIT.                                             SXK98180
195403*--------------------------------------------------------------*  ROR05307
195404 0051-PROCESS-SELSRC-MODEL.                                       ROR05307
195405*--------------------------------------------------------------*  ROR05307
195406*                                                                 ROR05307
195407* THIS BELOW FIELD WILL BE GREATER THAN SPACES ONLY FOR TRANSACS  ROR05307
195408* COMING THRU EAI DIRECTLY INTO THIS PROGRAM WITHOUT GOING THRU   ROR05307
195409* OUR DRIVER PROGRAMS.  WE ARE NOT REFERING/POPULATING THIS FIELD ROR05307
195410* ANYWHERE ELSE , SO NO PROBLEM OF DOING THIS LOGIC TWICE.        ROR05307
195420*                                                                 ROR05307
195430     IF CORORH-SS-END-USER > SPACES                               ROR05307
195440        NEXT SENTENCE                                             ROR05307
195450     ELSE                                                         ROR05307
195460        GO TO 0051-EXIT                                           ROR05307
195470     END-IF.                                                      ROR05307
195480*                                                                 ROR05307
195490     INITIALIZE CUX080-PARAMETERS.                                ROR05307
195500     MOVE CORORH-COMPANY           TO CUX080-COUNTRY-CODE         ROR05307
195600                                      TC-COMPANY.                 ROR05307
195700     MOVE CORORH-BR-NBR            TO CUX080-CUSTOMER-BR.         ROR05307
195800     MOVE CORORH-CUST-NBR          TO CUX080-CUSTOMER-NBR.        ROR05307
195900     MOVE CORORH-SS-END-USER       TO CUX080-SS-END-USER          ROR05307
196000                                      WS-SS-END-USER.             ROR05307
196100     MOVE 'LUOH'                   TO CUX080-REQUEST-FUNCTION.    ROR05307
196100* PASSING TERM-ID TO CUP080 TO SUPPORT IM360 BRAZIL               MS220208
196100* TO RESOLVE SELECT SOURCE END-USER                               MS220208
196100     MOVE WS-TERM-ID               TO CUX080-TERM-ID.             MS220208
196200*                                                                 ROR05307
196300* ONCE WE OPEN THIS LOGIC HERE FOR ALL THE TRANSACTIONS AND NOT   ROR05307
196400* JUST FOR EAI TRANSACTIONS,HAVE TO FIGURE OUT HOW TO POPULATE    ROR05307
196500* THIS FILED CUX080-OPID DIFFERENTLY FOR WEB/INLN TRANSACTIONS,IF ROR05307
196600* WE NEED TO POPULATE THEM DIFFERENTLY FOR CUX080.                ROR05307
196700*                                                                 ROR05307
196800*    MOVE 'INLN'                   TO CUX080-OPID                 ROR05307
196900*                                                                 ROR05307
197000     IF CORORH-SS-RESELLER-SUF > SPACES                           ROR05307
197100        MOVE CORORH-SS-RESELLER-SUF                               ROR05307
197200                                   TO CUX080-SS-RESELLER-SUFFIX.  ROR05307
197300     MOVE 'ORP971'                 TO CUX080-CALLING-PGM          ROR05307
197400     MOVE 'CUP080'                 TO WS-SUBROUTINE               ROR05307
197500     CALL WS-SUBROUTINE         USING DFHEIBLK                    ROR05307
197600                                      CUX080-PARAMETERS.          ROR05307
197700                                                                  ROR05307
197800     MOVE CUX080-RETURN-CODE             TO WS-SS-ERROR-SW.       ROR05307
197900*                                                                 ROR05307
198000*---------- FOR SELECT SOURCE CUSTOMERS USE END USER ID           ROR05307
198100*                                                                 ROR05307
198200     IF WS-SS-ERROR-SW = 'N'                                      ROR05307
198300        MOVE CUX080-R-SS-RESELLER       TO WS-SS-RESELLER         ROR05307
198400        IF TC-LATIN-AM-COMPANY                                    ROR05307
198500           MOVE WS-SS-RESELLER-BR       TO CORORH-SS-RESELLER-BR  ROR05307
198600           MOVE WS-SS-RESELLER-NBR      TO CORORH-SS-RESELLER-NBR ROR05307
198700           MOVE WS-SS-RESELLER-SUF      TO CORORH-SS-RESELLER-SUF ROR05307
198800        ELSE                                                      ROR05307
198900           MOVE CORORH-BR-NBR           TO CORORH-SS-RESELLER-BR  ROR05307
199000           MOVE CORORH-CUST-NBR         TO CORORH-SS-RESELLER-NBR ROR05307
199100           IF CORORH-SS-RESELLER-SUF NOT GREATER THAN SPACES      ROR05307
199200              MOVE '000'                TO CORORH-SS-RESELLER-SUF ROR05307
199300           END-IF                                                 ROR05307
199400        END-IF                                                    ROR05307
199500        MOVE WS-SS-EU-BR                TO CORORH-BR-NBR          ROR05307
199600        MOVE WS-SS-EU-NBR               TO CORORH-CUST-NBR        ROR05307
199700     ELSE                                                         ROR05307
199800       MOVE 'S'                 TO WS-LU6ORH-ERROR-FLAG(1:1)      ROR05307
199900       MOVE WS-SS-ERROR-SW      TO WS-LU6ORH-ERROR-SW             ROR05307
200000                                   WS-LU6ORH-ERROR-FLAG(2:1)      ROR05307
200100     END-IF.                                                      ROR05307
200200*                                                                 ROR05307
200300 0051-EXIT.  EXIT.                                                ROR05307
200400*                                                                 ROR05314
200500*--------------------------------------------------------------*  ROR07317
200600 0052-GET-DEF-BRANCH-SHIPBILL.                                    ROR07317
200700*--------------------------------------------------------------*  ROR07317
200800*                                                                 ROR07317
200900****                                                              ROR07317
201000**** TO GET DEF SHIP-TO , BILL-TO  FROM CUSBRN SEGMENT.           ROR07317
201100**** IF BILL-TO  AND  SHIP-TO/DROPSHIP IS COMING IN ,             ROR07317
201200****   GO OUT OF THIS PARA.                                       ROR07317
201300****                                                              ROR07317
      ******************************************************************AYB24152
      * SE8924 GLN IMPLEMENTATION - ADDING BELOW CHECK HERE TO NOT      AYB24152
      * OVERRIDE SHIP TO SUFFIX WHEN WE GET GLN VALUE IN THE INPUT AND  AYB24152
      * BILL TO SUFFIX IS ALSO PROVIDED IN THE INPUT.                   AYB24152
      ******************************************************************AYB24152
201400     IF ((CORORH-SUFFIX GREATER THAN SPACES) AND                  ROR07317
201500         ((CORORH-SHIP-TO-SUFFIX GREATER THAN SPACES) OR          ROR07317
               (CORORH-GLOBAL-LOC-NBR GREATER THAN SPACES) OR           AYB24152
201600          (WS-SHIP-TO-ADDRESS OR                                  ROR07317
201700           WS-SHIP-TO-ADDRESS-SPCL = 'Y')))                       ROR07317
201800           GO TO 0052-EXIT                                        ROR07317
201900     END-IF.                                                      ROR07317
202000*                                                                 ROR07317
202100*---  GET CUSTOMER INFORMATION                                    ROR07317
202200*                                                                 ROR07317
202300     IF NOT WS-DLI-SCHEDULED                                      ROR07317
202400         PERFORM 980-SCHEDULE-DLI.                                ROR07317
202500*                                                                 ROR07317
202600     MOVE CORORH-COMPANY-CODE         TO  WS-CUSHED-CO.           ROR07317
202700     MOVE CORORH-BR-NBR               TO  WS-CUSHED-BR            ROR07317
202800                                          WS-CUSBRN-BR.           ROR07317
202900     MOVE CORORH-CUST-NBR             TO  WS-CUSHED-CUST.         ROR07317
203000*                                                                 ROR07317
203100     PERFORM 1000-GU-CUSHED.                                      ROR07317
203200*                                                                 ROR07317
203300     IF CU-DELETE OR                                              ROR07317
203400        (NOT WS-CUSHED-NORESP)                                    ROR07317
203500         GO TO 0052-EXIT                                          ROR07317
203600     END-IF.                                                      ROR07317
203700*                                                                 ROR07317
203800     IF WS-CUSHED-NORESP                                          ROR07317
203900        PERFORM 1004-GU-CUSBRN                                    ROR07317
204000        IF WS-CUSBRN-NORESP                                       ROR07317
204100           NEXT SENTENCE                                          ROR07317
204200        ELSE                                                      ROR07317
204300           GO TO 0052-EXIT                                        ROR07317
204400        END-IF                                                    ROR07317
204500     END-IF.                                                      ROR07317
204600*                                                                 ROR07317
204700* IF BILL-TO-SUFFIX  IS COMING IN , ALWAYS USE IT.                ROR07317
204800* IF NOT COMING IN , USE THE DEFAULT ONE ON CUSBRN SEGMENT.       ROR07317
204900*                                                                 ROR07317
205000     IF CORORH-SUFFIX GREATER THAN SPACES                         ROR07317
205100        MOVE CORORH-SUFFIX   TO WS-CUSADR-SUFFIX                  ROR07317
205200     ELSE                                                         ROR07317
205300        MOVE CUB-BILL-TO-SUF TO CORORH-SUFFIX                     ROR07317
205400                                WS-CUSADR-SUFFIX                  ROR07317
205500     END-IF.                                                      ROR07317
205600*                                                                 ROR07317
205700* HERE WE GET THE DEFAULT SHIPTO FROM BILL-TO  AND SAVE IT IN A   ROR07317
205800* TEMP FIELD.THIS VALUE WILL BE USED LATER,IF NO SHIP-TO COMES IN ROR07317
205900*                                                                 ROR07317
206000     IF WS-CUSADR-SUFFIX GREATER THAN SPACES                      ROR07317
206100        PERFORM 1002-GU-CUSADR                                    ROR07317
206200        IF WS-CUSADR-NOTFND OR CUA-ADDR-DELETE                    ROR07317
206300           NEXT SENTENCE                                          ROR07317
206400        ELSE                                                      ROR07317
206500           MOVE CUA-DEF-SHIP-BILL-TO TO WS-BRANCH-SHIP-SUF        ROR07317
206600        END-IF                                                    ROR07317
206700     END-IF.                                                      ROR07317
206800*                                                                 ROR07317
206900* IF NO SHIP-TO COMES IN , THEN USE THE VALUE OBTAINED FROM       ROR07317
207000* ABOVE LOGIC. IF NO VALUE  THEN USE DEF SHIP-TO FROM CUSBRN.     ROR07317
207100*                                                                 ROR07317
      ******************************************************************AYB24152
      * SE8924 GLN IMPLEMENTATION - ADDING BELOW CHECK HERE TO NOT      AYB24152
      * OVERRIDE SHIP TO SUFFIX WHEN WE GET GLN VALUE IN THE INPUT AND  AYB24152
      * BILL TO SUFFIX IS NOT PROVIDED IN THE INPUT.                    AYB24152
      ******************************************************************AYB24152
207200     IF ((CORORH-SHIP-TO-SUFFIX GREATER THAN SPACES) OR           ROR07317
207300        (WS-SHIP-TO-ADDRESS OR                                    ROR07317
               (CORORH-GLOBAL-LOC-NBR GREATER THAN SPACES) OR           AYB24152
207400          WS-SHIP-TO-ADDRESS-SPCL = 'Y'))                         ROR07317
207500        GO TO 0052-EXIT                                           ROR07317
207600     ELSE                                                         ROR07317
207700        IF WS-BRANCH-SHIP-SUF GREATER THAN SPACES                 ROR07317
207800           MOVE WS-BRANCH-SHIP-SUF TO CORORH-SHIP-TO-SUFFIX       ROR07317
207900        ELSE                                                      ROR07317
208000           MOVE CUB-SHIP-TO-SUF TO CORORH-SHIP-TO-SUFFIX          ROR07317
208100        END-IF                                                    ROR07317
208200     END-IF.                                                      ROR07317
208300*                                                                 ROR07317
208400 0052-EXIT.  EXIT.                                                ROR07317
208500*                                                                 ROR07317
      * MAKE SURE THE TB-DPAS-PROC AREA IS USED HERE AND NOT ANYWHERE   BYA21127
      * AFTER THE BELOW PIECE OF CODE SINCE TBXPGID SEEMS TO BE         BYA21127
      * OVERRIDING THE PROC-AREA OF DPAS TABLE                          BYA21127
       0310-DPAS-LOGIC.                                                 BYA21127
                                                                        BYA21127
           MOVE CORORH-EXPECTED-DELIVERY-DATE                           BYA21127
                                  TO SYU-INPUT-ISO-DATE-8               BYA21127
           MOVE CORORH-COMPANY    TO SYU-COMPANY-INDICATOR              BYA21127
           CALL 'SYU777' USING SYU-DFHEIBLK                             BYA21127
                                  SYU-DFHCOMMAREA                       BYA21127
                                  SYU-DATE-ROUTINE-FIELDS               BYA21127
           IF SYU-ERROR-SW = SPACES                                     BYA21127
              MOVE SYU-OUTPUT-ISO-DATE-8                                BYA21127
                                  TO WS-EXPECTED-DELIVERY-DATE          BYA21127
              MOVE SYU-OUTPUT-JULIAN-DATE-7                             BYA21127
                                  TO WS-ORSHOF-EDD-CCYYDDD              BYA21127
              IF WS-EXPECTED-DELIVERY-DATE <= WS-PRESENT-DATE           BYA21127
                 MOVE 'A'            TO WS-LU6ORH-ERROR-SW              BYA21127
                 MOVE 'DA'           TO WS-LU6ORH-ERROR-FLAG            BYA21127
                 GO TO 0310-EXIT                                        BYA21127
              END-IF                                                    BYA21127
           ELSE                                                         BYA21127
              MOVE 'A'            TO WS-LU6ORH-ERROR-SW                 BYA21127
              MOVE 'DA'           TO WS-LU6ORH-ERROR-FLAG               BYA21127
              GO TO 0310-EXIT                                           BYA21127
           END-IF.                                                      BYA21127
                                                                        BYA21127
           MOVE CORORH-DPAS-CODE TO TB-DPAS-CODE                        BYA21127
           MOVE TC-COMPANY       TO TB-DPAS-CO                          BYA21127
           CALL 'SYU510'   USING TB-DPAS-PROC-IA                        BYA21127
           IF TB-DPAS-NORESP                                            BYA21127
              MOVE TB-DPAS-PRTY-CD    TO  WS-ORH-PRIORITY-CODE          BYA21127
           ELSE                                                         BYA21127
              MOVE 'C'  TO WS-LU6ORH-ERROR-SW                           BYA21127
              MOVE 'DC' TO WS-LU6ORH-ERROR-FLAG                         BYA21127
              GO TO 0310-EXIT                                           BYA21127
           END-IF.                                                      BYA21127
                                                                        BYA21127
           MOVE CORORH-DPAS-PGM-ID    TO TB-PGID-CODE                   BYA21127
           MOVE TC-COMPANY            TO TB-PGID-CO                     BYA21127
           CALL 'SYU510'   USING TB-PGID-PROC-IA                        BYA21127
           IF NOT TB-PGID-NORESP                                        BYA21127
              MOVE 'E'  TO WS-LU6ORH-ERROR-SW                           BYA21127
              MOVE 'DE' TO WS-LU6ORH-ERROR-FLAG                         BYA21127
              GO TO 0310-EXIT                                           BYA21127
           END-IF.                                                      BYA21127
                                                                        BYA21127
       0310-EXIT.  EXIT.                                                BYA21127
                                                                        BYA21127
208600*--------------------------------------------------------------*  ROR05314
208700 S0060-PROCESS-SEC-CHECK.                                         ROR05314
208800*--------------------------------------------------------------*  ROR05314
208900*                                                                 ROR05314
209000****                                                              ROR05314
209100**** TERMS :                                                      ROR05314
209200****   HERE WE PERFORM SECURITY CLEARENCE FOR CERTAIN CONDITIONS  ROR05314
209300****     AND WE ALSO DO TERMS VALIDATIONS.                        ROR05314
209400****                                                              ROR05314
209500     IF CORORH-TERMS GREATER THAN SPACES                          ROR05314
209600        PERFORM S0061-CHECK-TERMS-SECURITY THRU  S0061-EXIT       ROR05314
209700        IF NOT WS-LU6ORH-ERROR-ALL-OK                             ROR05314
209800           GO TO S0060-EXIT                                       ROR05314
209900        END-IF                                                    ROR05314
210000     END-IF.                                                      ROR05314
210100*                                                                 ROR05314
210200****                                                              ROR05314
210300**** FREIGHT OUT CODE :                                           ROR05314
210400****   HERE WE PERFORM SECURITY CLEARENCE FOR ALL CONDITIONS.     ROR05314
210500****                                                              ROR05314
210600     IF CORORH-FRT-OUT-CODE > SPACES                              ROR05314
210700        PERFORM S0062-CHECK-FOC-SECURITY   THRU  S0062-EXIT       ROR05314
210800        IF NOT WS-LU6ORH-ERROR-ALL-OK                             ROR05314
210900           GO TO S0060-EXIT                                       ROR05314
211000        END-IF                                                    ROR05314
211100     END-IF.                                                      ROR05314
211200*                                                                 ROR05314
211300*                                                                 PKV09266
211400****                                                              PKV09266
211500**** WAIVE MIN ORD FEE:                                           PKV09266
211600****   HERE WE PERFORM SECURITY CLEARENCE FOR ALL CONDITIONS.     PKV09266
211700****                                                              PKV09266
211800     IF CORORH-WAIVE-MINORD-FEE EQUAL 'Y'                         PKV09266
211900        PERFORM S0063-CHECK-MOF-SECURITY   THRU  S0063-EXIT       PKV09266
212000        IF NOT WS-LU6ORH-ERROR-ALL-OK                             PKV09266
212100           GO TO S0060-EXIT                                       PKV09266
212200        END-IF                                                    PKV09266
212300     END-IF.                                                      PKV09266
212400*                                                                 ROR05314
212500* NO SEC CHECK FOR THESE FIELD'S , SO WE ARE OKAY.                ROR05314
212600*                                                                 ROR05314
212700*    IF CORORH-FREIGHT-FORWARDER GREATER THAN SPACES              ROR05314
212800*    IF CORORH-OS-SALESMAN       GREATER THAN SPACES              ROR05314
212900*                                                                 ROR05314
213000*                                                                 ROR05314
213100*                                                                 ROR05314
213200 S0060-EXIT. EXIT.                                                ROR05314
213300*                                                                 ROR05314
213400*--------------------------------------------------------------*  ROR05314
213500 S0061-CHECK-TERMS-SECURITY.                                      ROR05314
213600*--------------------------------------------------------------*  ROR05314
213700*                                                                 ROR05314
213800*   MIMICED THIS LOGIC FROM ORP570 :                              ROR05314
213900*     SECURITY FOR CHANGING TERMS ON ORDER TO 992.                ROR05314
214000*                                                                 ROR05314
214100*   NEW SECURITY LOGIC ADDED :                                    ROR05314
214200*     SECURITY FOR CHANGING TERMS FROM LOWER TO HIGHER VALUE.     ROR05314
214300*                                                                 ROR05314
214400*                                                                 ROR05314
214500* THIS IS EXISTING LOGIC THATS BEING MOVED HERE.                  ROR05314
214600*   NO SECURITY CHECKS AS ITS BEING TAKEN CARE OF BY SYSTEMS      ROR05314
214700*    THAT PLACE ORDERS WITH THESE TERM-ID'S.(WEB , STOREFRONTS)   ROR05314
214800*                                                                 ROR05314
      *    IF (CORORH-INTERNET     AND                                  TZM22231
      *       (CORORH-TERM-ID(1:3) = 'WEB'      OR                      TZM22231
      *        CORORH-TERM-ID      = 'HERM'))   OR                      TZM22231
      *       (CORORH-PASSTHRU-PROGRAM AND                              TZM22231
      *        CORORH-FROM-STOREFRONT)          OR                      TZM22231
      *       (CORORH-TERM-ID = 'WEBL')         OR                      TZM22231
      *       (CORORH-TERM-ID = 'WEBX')         OR                      TZM22231
      *       (CORORH-FROM-PCG3)                OR                      TZM22231
      *       (CORORH-TERM-ID = 'HERM')         OR                      TZM22231
      *       (CORORH-TERM-ID = 'RNEW')         OR                      TZM22231
      *       (CORORH-TERM-ID = 'PWRS')         OR                      TZM22231
      *       (CORORH-TERM-ID = 'CBLU')                                 TZM22231
      *       PERFORM S1115-VALIDATE-TERMS THRU S1115-EXIT              TZM22231
      *       GO TO S0061-EXIT                                          TZM22231
      *    END-IF.                                                      TZM22231
215900*                                                                 ROR05314
216000*                                                                 ROR05314
      * NOTE -                                                          TZM22231
      * REDESIGNED THE ABOVE IF ELSE LOGIC ..                           TZM22231
      * REMOVED CONDITION TO CHECK INTERNET & PASSTHR - RAM             TZM22231
      *                                                                 TZM22231
           IF TB-IL-ALLOW-TERMS-OVERRIDE                                TZM22231
              PERFORM S1115-VALIDATE-TERMS THRU S1115-EXIT              TZM22231
              GO TO S0061-EXIT                                          TZM22231
           END-IF.                                                      TZM22231
                                                                        TZM22231
216100* THIS BELOW LOGIC IS NEW LOGIC.                                  ROR05314
216200*                                                                 ROR05314
216300* IF TERM-ID IS ALLOWED TO CHANGE THE TERMS , WE ALLOW IT  TO     ROR05314
216400*  CHANGE THE TERMS AFTER  GOING THRU  CERTAIN VALIDATIONS.       ROR05314
216500*                                                                 ROR05314
      *    IF WS-TERMS-CHG-OK                                           TZM22231
           IF TB-IL-ALLOW-TERMS-SEC-CHK                                 TZM22231
216700        NEXT SENTENCE                                             ROR05314
216800     ELSE                                                         ROR05314
216900        GO TO S0061-EXIT                                          ROR05314
217000     END-IF.                                                      ROR05314
217100*                                                                 ROR05314
217200*                                                                 ROR05314
217300** FOR CHANGING TERMS TO 992 OR  FROM DEFAULT TO HIGHER,          ROR05314
217400*    THESE TERM-ID'S REQUIRE  ADDTL SECURITY CLEARENCE AT TBXSEC. ROR05314
217500*    --> OPER-ID FIELD NEEDS TO BE SENT IN HERE FOR THIS SCENARIO.ROR05314
217600*                                                                 ROR05314
217700** FOR CHANGING TERMS FROM DEFAULT TO LOWER,                      ROR05314
217800*    THESE TERM-ID'S DONT REQUIRE ANY SECURITY.                   ROR05314
217900*                                                                 ROR05314
218000     IF (CORORH-TERMS EQUAL 992) OR                               ROR05314
218100        (CORORH-TERMS GREATER THAN WS-DEFAULT-TERMS)              ROR05314
218200        IF CORORH-OPER-ID GREATER THAN SPACES                     ROR05314
218300           NEXT SENTENCE                                          ROR05314
218400        ELSE                                                      ROR05314
218500           MOVE 'G'              TO  WS-LU6ORH-ERROR-SW           ROR05314
218600           MOVE 'SG'             TO  WS-LU6ORH-ERROR-FLAG         ROR05314
218700           GO TO S0061-EXIT                                       ROR05314
218800        END-IF                                                    ROR05314
218900     END-IF.                                                      ROR05314
219000*                                                                 ROR05314
219100     IF CORORH-TERMS EQUAL 992                                    ROR05314
219200        MOVE 'CS'         TO  TB-SEC-SYSTEM                       ROR05314
219300        MOVE 'TERM'       TO  TB-SEC-TRANSACTION                  ROR05314
219400        MOVE '01'         TO  TB-SEC-FIELD-NBR                    ROR05314
219500        PERFORM 1000-GENERIC-SECURITY THRU                        ROR05314
219600                1000-GENERIC-SECURITY-EXIT                        ROR05314
219700        IF NOT TB-SEC-NORESP                                      ROR05314
219800           MOVE 'H'              TO  WS-LU6ORH-ERROR-SW           ROR05314
219900           MOVE 'SH'             TO  WS-LU6ORH-ERROR-FLAG         ROR05314
220000           GO TO S0061-EXIT                                       ROR05314
220100        ELSE                                                      ROR05314
220200           PERFORM S1115-VALIDATE-TERMS THRU S1115-EXIT           ROR05314
220300           GO TO S0061-EXIT                                       ROR05314
220400        END-IF                                                    ROR05314
220500     END-IF.                                                      ROR05314
220600*                                                                 ROR05314
220700* SKIP THE BELOW CS TERM 05 SECURITY CHECK FOR USA , CANADA       ROR08339
220800*       PER KEN ,SCOTT AND JECKIE ...AS ITS NOT DONE IN TELESALES.ROR08339
220900     IF CORORH-TERMS GREATER THAN WS-DEFAULT-TERMS                ROR05314
221000        IF (TC-USA OR TC-CANADA OR                                NXM25248
                 (TC-MEXICO AND (CORORH-TERMS EQUAL 990 OR 995)))       NXM25248
222400           PERFORM S1115-VALIDATE-TERMS THRU S1115-EXIT           NXM25248
222300        ELSE                                                      NXM25248
221100           MOVE 'CS'         TO  TB-SEC-SYSTEM                    NXM25248
221200           MOVE 'TERM'       TO  TB-SEC-TRANSACTION               NXM25248
221300           MOVE '05'         TO  TB-SEC-FIELD-NBR                 NXM25248
221400           PERFORM 1000-GENERIC-SECURITY THRU                     NXM25248
221500                1000-GENERIC-SECURITY-EXIT                        ROR05314
221600           IF NOT TB-SEC-NORESP                                   NXM25248
221700              MOVE 'E'              TO  WS-LU6ORH-ERROR-SW        NXM25248
221800              MOVE 'SE'             TO  WS-LU6ORH-ERROR-FLAG      NXM25248
221900              GO TO S0061-EXIT                                    NXM25248
222000           ELSE                                                   NXM25248
222100              PERFORM S1115-VALIDATE-TERMS THRU S1115-EXIT        NXM25248
222200           END-IF                                                 NXM25248
222200        END-IF                                                    NXM25248
222300     ELSE                                                         ROR05314
222400        PERFORM S1115-VALIDATE-TERMS THRU S1115-EXIT              ROR05314
222500     END-IF.                                                      ROR05314
222600*                                                                 ROR05314
222700*                                                                 ROR05314
222800 S0061-EXIT. EXIT.                                                ROR05314
222900*--------------------------------------------------------------*  ROR05314
223000 S0062-CHECK-FOC-SECURITY.                                        ROR05314
223100*--------------------------------------------------------------*  ROR05314
223200*                                                                 ROR05314
223300*   MIMICED THIS LOGIC FROM ORP570 :                              ROR05314
223400*     SECURITY FOR CHANGING FREIGHT OUT CODE ON ORDER TO "P".     ROR05314
223500*                                                                 ROR05314
223600*   NEW SECURITY LOGIC ADDED :                                    ROR05314
223700*     SECURITY FOR CHANGING FREIGHT OUT CODE ON THE ORDER.        ROR05314
223800*                                                                 ROR05314
223900* IF TERM-ID IS ALLOWED TO CHANGE THE FOC   , WE ALLOW IT  TO     ROR05314
224000*  CHANGE THE FOC   AFTER  GOING THRU  CERTAIN VALIDATIONS.       ROR05314
224100*                                                                 ROR05314
      *    IF WS-FRT-FWD-CHG-OK                                         TZM22231
      *       NEXT SENTENCE                                             TZM22231
      *    ELSE                                                         TZM22231
      *       GO TO S0062-EXIT                                          TZM22231
      *    END-IF.                                                      TZM22231
      * BYPASSING SECURITY CHECK ON APPROVAL FROM POWER RMA TEAM 'PWRS' KXD19305
      *                                                                 TZM22231
      *    IF CORORH-TERM-ID = 'PWRS'                                   TZM22231
      *       GO TO S0062-EXIT                                          TZM22231
      *    END-IF.                                                      TZM22231
      *                                                                 TZM22231
      *RANAME IT TO TB-IL-ALLOW-FRT-OUT-CODE-SW FOR LATER RELEASE       TZM22231
      *                                                                 TZM22231
           IF TB-IL-FRT-FWD-SECURE                                      TZM22231
              NEXT SENTENCE                                             TZM22231
           ELSE                                                         TZM22231
              GO TO S0062-EXIT                                          TZM22231
           END-IF.                                                      TZM22231
                                                                        TZM22231
224800     IF CORORH-OPER-ID GREATER THAN SPACES                        ROR05321
224900        NEXT SENTENCE                                             ROR05321
225000     ELSE                                                         ROR05321
225100        MOVE 'G'                 TO  WS-LU6ORH-ERROR-SW           ROR05321
225200        MOVE 'SG'                TO  WS-LU6ORH-ERROR-FLAG         ROR05321
225300        GO TO S0062-EXIT                                          ROR05321
225400     END-IF.                                                      ROR05321
225500*                                                                 ROR05321
225700     IF TB-CPO3-ALLOW-FRT-OUT-P                                   ROR05314
225600        IF CORORH-FRT-OUT-CODE EQUAL 'P'                          PXM20193
                 IF CUA-DEF-OUT-FRT-CODE = 'P'                          PXM20193
                    NEXT SENTENCE                                       PXM20193
                 ELSE                                                   PXM20193
225800              MOVE 'OR' TO TB-SEC-SYSTEM                          ROR05314
225900              MOVE 'FRT ' TO TB-SEC-TRANSACTION                   ROR05314
226000              MOVE '01' TO TB-SEC-FIELD-NBR                       ROR05314
226100              PERFORM 1000-GENERIC-SECURITY THRU                  ROR05314
226200                      1000-GENERIC-SECURITY-EXIT                  ROR05314
226300              IF NOT TB-SEC-NORESP                                ROR05314
226400                 MOVE 'J'        TO  WS-LU6ORH-ERROR-SW           ROR05314
226500                 MOVE 'SJ'       TO  WS-LU6ORH-ERROR-FLAG         ROR05314
226600                 GO TO S0062-EXIT                                 ROR05314
326700              END-IF                                              ROR05314
326700           END-IF                                                 PXM20193
326700        END-IF                                                    PXM20193
326700     END-IF.                                                      PXM20193
                                                                        PXM20193
           IF TB-CPO6-FRT-MOF-SECURITY-YES                              PXM20193
227400        MOVE 'OR'      TO TB-SEC-SYSTEM                           ROR05314
227500        MOVE 'FRT '    TO TB-SEC-TRANSACTION                      ROR05314
227600        MOVE '02'      TO TB-SEC-FIELD-NBR                        ROR05314
227700        PERFORM 1000-GENERIC-SECURITY THRU                        ROR05314
227800                1000-GENERIC-SECURITY-EXIT                        ROR05314
227900        IF NOT TB-SEC-NORESP                                      ROR05314
228000           MOVE 'F'              TO  WS-LU6ORH-ERROR-SW           ROR05314
228100           MOVE 'SF'             TO  WS-LU6ORH-ERROR-FLAG         ROR05314
228200           GO TO S0062-EXIT                                       ROR05314
228300        END-IF                                                    ROR05314
228400     END-IF.                                                      ROR05314
228500*                                                                 ROR05314
228501 S0062-EXIT. EXIT.                                                ROR05314
228502*                                                                         
228503*--------------------------------------------------------------*  PKV09266
228504 S0063-CHECK-MOF-SECURITY.                                        PKV09266
228505*--------------------------------------------------------------*  PKV09266
228506*                                                                 PKV09266
228507* IF REQUEST TO OVERRIDE  WAIVE MINORD FEE IS NOT COMING IN FROM  PKV09266
228508*  SUBSTATION( SERVICE) , IGNORE IT.                              PKV09266
228509* WE DONT WANT ANYONE ELSE OTHER THAN USERS COMING IN THRU        PKV09266
228510*   SUBSTATION TO BE ABLE TO OVERRIDE THIS FIELD.                 PKV09266
      *    NOT APPLICABLE FOR MOBILE ORDERS , AS THEY SHOULD BEHAVE     ROR19067
      *    THE SAME WAY-WHEN THEY CAME THROUGH RPC/JGATE ROUTE,         ROR19067
      *    EVEN WHEN THEY COME THROUGH SUBSTATION ROUTE- ARMOR PROJECT  ROR19067
      * ALLOW TO WAIVE THE HANDLING FEE FOR BILL ONLY ORDERS FOR POWER  AZN20031
      * APPLICATIONS ALSO BYPASSING THE SECURITY CHECKS FOR THE SAME.   AZN20031
      *                                                                 AZN20031
           EVALUATE TB-IL-WAIVE-MINORD-FEE-OVRD-SW                      TZM22231
           WHEN 'N'                                                     TZM22231
                MOVE SPACE TO CORORH-WAIVE-MINORD-FEE                   TZM22231
                GO TO S0063-EXIT                                        TZM22231
           WHEN 'X'                                                     TZM22231
                GO TO S0063-EXIT                                        TZM22231
           WHEN OTHER                                                   TZM22231
                CONTINUE                                                TZM22231
           END-EVALUATE.                                                TZM22231
      *    EVALUATE WS-TERM-ID                                          TZM22231
      *    WHEN 'WEBM'                                                  TZM22231
      *         MOVE SPACE TO CORORH-WAIVE-MINORD-FEE                   TZM22231
      *         GO TO S0063-EXIT                                        TZM22231
      *    WHEN 'PWRS'                                                  TZM22231
      *         GO TO S0063-EXIT                                        TZM22231
      *    WHEN OTHER                                                   TZM22231
      *         CONTINUE                                                TZM22231
      *    END-EVALUATE.                                                TZM22231
                                                                        TZM22231
228530*    IF WS-FROM-SUBSTATION                                        AZN20031
      *    AND NOT WS-TERM-ID-FROM-WEB-MOBILE                           AZN20031
      *    AND NOT WS-TERM-ID-FROM-POWER-APPL                           AZN20031
228540*       NEXT SENTENCE                                             AZN20031
228550*    ELSE                                                         AZN20031
228560*       MOVE SPACE TO CORORH-WAIVE-MINORD-FEE                     AZN20031
228570*       GO TO S0063-EXIT                                          AZN20031
228580*    END-IF.                                                      AZN20031
228590*                                                                 PKV09266
228600* IF INCOMING VALUE IS SAME AS THE VALUE ON CUSTOMER PROFILE ,    PKV09266
228700*  DONT NEED TO DO ANY OTHER CHECKS.                              PKV09266
228800*                                                                 PKV09266
228900     IF CORORH-WAIVE-MINORD-FEE = 'Y' AND                         PKV09266
229000        (CORORH-WAIVE-MINORD-FEE EQUAL TO CU-WAIVE-MIN-ORD-SW)    PKV09266
229100         GO TO S0063-EXIT.                                        PKV09266
229200*                                                                 PKV09266
229300* IF NOT REQD TO DO ANY CHECKS AS PER THAT REGIONS SETTINGS ,     PKV09266
229400*  THEN DONT NEED TO DO ANY OTHER CHECKS.                         PKV09266
229500*                                                                 PKV09266
229600     IF TB-CPO6-FRT-MOF-SECURITY-YES                              PKV09266
229700        NEXT SENTENCE                                             PKV09266
229800     ELSE                                                         PKV09266
229900        GO TO S0063-EXIT                                          PKV09266
230000     END-IF.                                                      PKV09266
230100*                                                                 PKV09266
230200* IF REQD TO DO SECURITY CHECKS AND OPER-ID IS NOT COMING IN,     PKV09266
230300*  THEN SEND AN ERROR BACK.                                       PKV09266
230400*                                                                 PKV09266
230500     IF CORORH-OPER-ID NOT GREATER THAN SPACES                    PKV09266
230600        MOVE 'G'                 TO  WS-LU6ORH-ERROR-SW           PKV09266
230700        MOVE 'SG'                TO  WS-LU6ORH-ERROR-FLAG         PKV09266
230800        GO TO S0063-EXIT.                                         PKV09266
230900*                                                                 PKV09266
231000* IF INCOMING OPER-ID DOESNT HAVE ENOUGH ACCESS TO OVERRIDE THE   PKV09266
231100*  MIN ORDER FEE , THEN SEND AN ERROR BACK.                       PKV09266
231200*                                                                 PKV09266
231300     MOVE 'OR'  TO            TB-SEC-SYSTEM.                      PKV09266
231400     MOVE 'WMO' TO            TB-SEC-TRANSACTION.                 PKV09266
231500     MOVE '01'  TO            TB-SEC-FIELD-NBR.                   PKV09266
231600     PERFORM 1000-GENERIC-SECURITY THRU                           PKV09266
231700             1000-GENERIC-SECURITY-EXIT.                          PKV09266
231800     IF NOT TB-SEC-NORESP                                         PKV09266
231900        MOVE 'U'                 TO  WS-LU6ORH-ERROR-SW           PKV09266
232000        MOVE 'U9'                TO  WS-LU6ORH-ERROR-FLAG         PKV09266
232100        GO TO S0063-EXIT.                                         PKV09266
232200*                                                                 PKV09266
232300 S0063-EXIT. EXIT.                                                PKV09266
232301*                                                                 PKV09266
232302*                                                                         
232303 S0051-PROCESS-SHIP-BILL-SUFFIX.                                  SXK96332
232304*                                                                 SXK96332
232305     MOVE CORORH-SHIP-TO-SUFFIX       TO  CUA-SUFFIX.             SXK96332
232306     IF CUA-SHIP-TO-SUF                                           SXK96332
232307*    CORORH-SHIP-TO-SUFFIX = WS-CUSADR-SUFFIX INDICATES THAT      SXK96332
232308*    WE READ SHIP-TO-SUFFIX PREVIOUSLY AS THERE WERE NO BILL-TO   SXK96332
232309*    AND CUA-DEF-SHIP-BILL-TO NOW HAVE BILL-TO-SUFFIX             SXK96332
232310       IF   CORORH-SHIP-TO-SUFFIX     =   WS-CUSADR-SUFFIX        SXK96332
232311         MOVE CUA-DEF-SHIP-BILL-TO    TO  WS-CUSADR-SUFFIX        SXK96332
232312                                          WS-CUST-SUFFIX          SXK96332
232313                                          CORORH-SUFFIX           SXK96332
232314           IF CORORH-SUFFIX            =   SPACES                 SXK98180
232315              MOVE '000'              TO  WS-CUSADR-SUFFIX        SXK98180
232316                                          WS-CUST-SUFFIX          SXK98180
232317                                          CORORH-SUFFIX           SXK98180
232318           END-IF                                                 SXK98180
232319*    CHECK CUSTOMER SUFFIX                                        SXK96332
232320           IF WS-SUFFIX-000                                       SXK96332
232321              PERFORM 1002-GU-CUSADR                              SXK98180
232322              IF WS-CUSADR-NOTFND OR CUA-ADDR-DELETE              SXK98180
232323                 MOVE 'R'         TO  WS-LU6ORH-ERROR-SW          SXK98180
232324                 GO TO S0051-EXIT                                 SXK98180
232325              END-IF                                              SXK98180
232326           ELSE                                                   SXK96332
232327           IF WS-SUFFIX-FLOORING                                  SXK96332
232328              PERFORM 500-CHECK-FLOORING  THRU  500-EXIT          ROR00080
232329           ELSE                                                   SXK96332
232330              MOVE 'R'            TO  WS-LU6ORH-ERROR-SW          SXK96332
232331              GO TO S0051-EXIT                                    SXK98180
232332           END-IF END-IF                                          SXK96332
232333           IF CUA-DEF-CARRIER GREATER THAN SPACES                 ROR01068
232334              MOVE CUA-DEF-CARRIER    TO  WS-BT-DEF-CAR           ROR01068
232335           END-IF                                                 ROR01068
232336           IF CUA-ALT-DEF-CAR GREATER THAN SPACES                 ROR01068
232337              MOVE CUA-ALT-DEF-CAR    TO  WS-BT-ALT-DEF-CAR       ROR01068
232338           END-IF                                                 ROR01068
232339           IF CUA-DEF-OUT-FRT-CODE GREATER THAN SPACE             ROR01068
232340              MOVE CUA-DEF-OUT-FRT-CODE                           ROR01068
232341                                      TO  WS-BT-FRT-OUT-CODE      ROR01068
232342           END-IF                                                 ROR01068
232343           IF CUA-STATE-CODE  GREATER THAN SPACES                 NXC17174
232344              MOVE CUA-STATE-CODE                                 NXC17174
232345                                      TO  WS-BT-STATE-CODE        NXC17174
232346           END-IF                                                 NXC17174
232347           IF CUA-CAPS-ID-CODE GREATER THAN SPACES                ROR01116
232348              MOVE CUA-CAPS-ID-CODE   TO  WS-CAPS-ID-CODE         ROR01116
232349           END-IF                                                 ROR01116
232350         MOVE CORORH-SHIP-TO-SUFFIX   TO  WS-CUSADR-SUFFIX        SXK98180
232351         MOVE 'Y'     TO WS-READ-SHIP-TO-SEG                      SXK98180
232352         PERFORM 1002-GU-CUSADR                                   SXK98180
232353         IF WS-CUSADR-NOTFND OR CUA-ADDR-DELETE                   SXK98180
232354            MOVE 'R'                  TO  WS-LU6ORH-ERROR-SW      SXK98180
232355         END-IF                                                   SXK98180
232356         IF CUA-DEF-CARRIER GREATER THAN SPACES                   ROR01068
232357            MOVE CUA-DEF-CARRIER      TO  WS-ST-DEF-CAR           ROR01068
232358         END-IF                                                   ROR01068
232359         IF CUA-ALT-DEF-CAR GREATER THAN SPACES                   ROR01068
232360            MOVE CUA-ALT-DEF-CAR      TO  WS-ST-ALT-DEF-CAR       ROR01068
232361         END-IF                                                   ROR01068
232362         IF CUA-DEF-OUT-FRT-CODE GREATER THAN SPACE               ROR01068
232363            MOVE CUA-DEF-OUT-FRT-CODE TO  WS-ST-FRT-OUT-CODE      ROR01068
232364         END-IF                                                   ROR01068
               IF CUA-STATE-CODE  GREATER THAN SPACES                   NXC22077
                  MOVE CUA-STATE-CODE                                   NXC22077
                                          TO  WS-ST-STATE-CODE          NXC22077
               END-IF                                                   NXC22077
232365       ELSE                                                       SXK96332
232366         MOVE CORORH-SHIP-TO-SUFFIX   TO  WS-CUSADR-SUFFIX        SXK96332
232367         MOVE 'Y'     TO WS-READ-SHIP-TO-SEG                      SXK96332
232368         PERFORM 1002-GU-CUSADR                                   SXK96332
232369         IF WS-CUSADR-NOTFND OR CUA-ADDR-DELETE                   SXK96332
232370            MOVE 'R'                  TO  WS-LU6ORH-ERROR-SW      SXK96332
232371         END-IF                                                   SXK96332
232372         IF CUA-DEF-CARRIER GREATER THAN SPACES                   ROR01068
232373            MOVE CUA-DEF-CARRIER      TO  WS-ST-DEF-CAR           ROR01068
232374         END-IF                                                   ROR01068
232375         IF CUA-ALT-DEF-CAR GREATER THAN SPACES                   ROR01068
232376            MOVE CUA-ALT-DEF-CAR      TO  WS-ST-ALT-DEF-CAR       ROR01068
232377         END-IF                                                   ROR01068
232378         IF CUA-DEF-OUT-FRT-CODE GREATER THAN SPACE               ROR01068
232379            MOVE CUA-DEF-OUT-FRT-CODE TO  WS-ST-FRT-OUT-CODE      ROR01068
232380         END-IF                                                   ROR01068
232390         IF CUA-STATE-CODE  GREATER THAN SPACES                   NXC17174
232400            MOVE CUA-STATE-CODE                                   NXC17174
232500                                    TO  WS-ST-STATE-CODE          NXC17174
232501         END-IF                                                   NXC17174
232502     ELSE                                                         SXK96332
232503          MOVE 'R'                    TO  WS-LU6ORH-ERROR-SW.     SXK96332
232504*                                                                 ROR00080
232505* CURRENTLY WE ARE IDENTIFYING AS SHIP TO EXPORT ORDER ONLY FOR   SXG03305
232506* US, BUT WITH EAGLE PROJECT WE HAVE TO DO THIS FOR ALL COUNTRIES SXG03305
232507*    IF WS-LU6ORH-ERROR-ALL-OK AND TC-USA                         SXG03305
232508*       PERFORM S1080-GET-SHIPTODEN-ADDRESS  THRU S1080-EXIT.     SXG03305
232509     IF TC-USA                                                    SXG03305
232510        IF WS-LU6ORH-ERROR-ALL-OK                                 SXG03305
232511           PERFORM S1080-GET-SHIPTO-ADDRESS-US THRU S1080-EXIT    SXG03305
232512        END-IF                                                    SXG03305
232513     ELSE                                                         SXG03305
232514*      IF TB-CO-VAL-EXP-COMPL-OK                                  ROR04162
232515        IF WS-LU6ORH-ERROR-ALL-OK                                 SXG03305
232516           AND CORORH-COMPANY-CODE NOT EQUAL TO 'MD'              SXG03305
232517           PERFORM S1081-GET-SHIPTOEXP-NON-US  THRU S1081-EXIT    SXG03305
232518        END-IF                                                    SXG03305
232519*      END-IF                                                     ROR04162
232520     END-IF.                                                      SXG03305
232521*                                                                 ROR00080
232522 S0051-EXIT.    EXIT.                                             SXK96332
232523*                                                                         
232524*                                                                         
232525*                                                                         
232526 S0052-EDIT-CARRIER-CODE.                                         SXK97077
232527***************************************************************** SXK97077
232528**  THIS PARAGRAPH WILL VALIDATE THE CARRIER CODE IS OK FOR    ** SXK97077
232529**  THIS ZIP CODE                                              ** SXK97077
232530***************************************************************** SXK97077
232531     IF CORORH-FLOOR-SUF                                          SXK97077
232532        MOVE WS-FLOOR-TERMS           TO  WS-TERMS                SXK97077
232533     ELSE                                                         SXK97077
232534        IF CUB-TERMS NUMERIC                                      TEH00245
232535           MOVE CUB-TERMS                TO  WS-TERMS             TEH00245
232536        ELSE                                                      TEH00245
232537           MOVE +0                       TO WS-TERMS              TEH00245
232538        END-IF                                                    TEH00245
232539      END-IF.                                                     TEH00245
232540      MOVE CORORH-COMPANY-CODE   TO WS-CARR-CODE(1:2)             SXK97070
232541                                    ORH-COMPANY.                  SXK97070
232542      MOVE CORORH-SHIP-VIA-CARRIER-CODE TO WS-CARR-CODE(3:2).     SXK97077
232543      MOVE WS-CARR-CODE           TO TB-CARR-ENTRY(1:4).          SXK97077
232544      CALL 'SYU510' USING TB-CARRIER-TABLE-IA.                    SXK97077
232545      IF NOT TB-CARR-NORESP                                       SXK97077
232546         IF WS-HOLD-ON-ERROR                                      ROR05277
232547            SET WS-HOLD-ON-CARR-ERR TO TRUE                       ROR06075
232548            MOVE 'Y'                TO WS-HOLD-ON-ERROR-TYPE      ROR06075
232549         ELSE                                                     ROR01316
232550            MOVE 'V'                       TO WS-LU6ORH-ERROR-SW  ROR01316
232551            GO                             TO S0052-EXIT          ROR01316
232552         END-IF                                                   ROR01316
232553      END-IF.                                                     ROR01316
232554*                                                                         
232555*                                                                 ROR01088
232556     MOVE SPACES                   TO    WS-BR-NBR-SHIP-FROM.     SXK97077
232557     IF CUA-SHIP-FROM > ZEROES                                    SXK97077
232558        MOVE CUA-SHIP-FROM         TO    WS-BR-NBR-SHIP-FROM      SXK97077
232559     ELSE                                                         SXK97077
232560        MOVE WS-CUST-BR-NBR     TO    WS-BR-NBR-SHIP-FROM.        TEH05046
232561                                                                  SXK97077
232562                                                                  SXK97077
232563     IF WS-SHIP-TO-ADDRESS                                        ROR01088
232564        IF WS-APO-FPO-ORDER                                       TEH05046
232565           NEXT SENTENCE                                          ROR01088
232566        ELSE                                                      ROR01088
232567           PERFORM Z9000-ZIPBR THRU Z9000-EXIT                    ROR01088
232568        END-IF                                                    ROR01088
232569     END-IF.                                                      ROR01088
232570*                                                                 ROR01088
232571     IF WS-BR-NBR-SHIP-FROM GREATER THAN SPACES                   ROR01088
232572        MOVE WS-BR-NBR-SHIP-FROM   TO    ORSH-BR-NBR-SHIP-FROM.   ROR01088
232573                                                                  SXK97077
232574     IF ORH-CONFIGURATION-ORDER                                   SXK97077
232575        MOVE '0'                    TO  WS-BP-REC-SEQ             SXK97077
232576        MOVE   WS-BR-NBR-SHIP-FROM  TO  WS-BP-BR-NBR              SXK97077
232577        MOVE TC-COMPANY             TO  WS-BP-COMPANY             SXK97077
232578        PERFORM    S5500-READ-BPMAST THRU S5500-EXIT              ROR02344
232579        IF WS-BP-NORESP                                           SXK97077
232580           MOVE  BP-BR-NBR-CONFIG   TO   WS-BR-NBR-SHIP-FROM      SXK97077
232581        ELSE                                                      SXK97077
232582           MOVE  '10'               TO WS-BP-BR-NBR               SXK97077
232583           PERFORM    S5500-READ-BPMAST THRU S5500-EXIT           ROR02344
232584           IF WS-BP-NORESP                                        SXK97077
232585             MOVE  BP-BR-NBR-CONFIG TO   WS-BR-NBR-SHIP-FROM      SXK97077
232586           ELSE                                                   SXK97077
232587             MOVE  '10'             TO   WS-BR-NBR-SHIP-FROM.     SXK97077
232588                                                                  SXK97077
232589* DONT NEED THIS BELOW TBXMANC VALIDATION HERE.                   ROR09217
232590*  WE ARE SUPPOSED TO DO THIS VALIDATION WITH SHIPPING BRANCH     ROR09217
232600*   WHICH IS NOT THE CASE HERE.                                   ROR09217
232700*  REMOVED THIS PER TRAM/CAROL RECOMENDATION.                     ROR09217
232800*    AS ITS DONE IN WHP990  WHEN NEEDED.                          ROR09217
232900*                                                                 ROR09217
232901*   SXK97077 ---  FVB000129 --ROR01316  --ROR05277 -ROR06075      ROR09217
232902*     IF TB-CARR-USED-BY-BR                                       ROR09217
232903*        MOVE CORORH-COMPANY-CODE      TO TB-MANIF-CO             ROR09217
232904*        MOVE WS-BR-NBR-SHIP-FROM      TO TB-MANIF-SF             ROR09217
232905*        MOVE CORORH-SHIP-VIA-CARRIER-CODE TO TB-MANIF-CC         ROR09217
232906*        CALL 'SYU510'               USING TB-MANIF-TABLE-IA      ROR09217
232907** IF TABLE READ FAILS FOR BRANCH SPECIFIC CARRIER TURN BASE RATE ROR09217
232908** ON AND DO NOT ISSUE AN ERROR FOR ALL LINK-IN TRANS.            ROR09217
232909*        IF NOT TB-MANIF-NORESP                                   ROR09217
232910*           IF LINK-IN AND                                        ROR09217
232920*              (TB-CPO-BASE-RATE-ORDER-SW = 'T' OR 'Y') AND       ROR09217
232921*              NOT WS-HOLD-ON-ERROR                               ROR09217
232922*              MOVE 'Y'                TO ORH-BASE-RATE-ORDER-SW  ROR09217
232923*           ELSE                                                  ROR09217
232924*                IF WS-HOLD-ON-ERROR                              ROR09217
232925*                   SET WS-HOLD-ON-CARR-ERR TO TRUE               ROR09217
232926*                   MOVE 'Y'        TO WS-HOLD-ON-ERROR-TYPE      ROR09217
232927*                ELSE                                             ROR09217
232928*                   MOVE 'V'           TO WS-LU6ORH-ERROR-SW      ROR09217
232929*                   GO                 TO S0052-EXIT              ROR09217
232930*                END-IF                                           ROR09217
232931*           END-IF                                                ROR09217
232932*        END-IF.                                                  ROR09217
232933                                                                  SXK97077
232934 S0052-EXIT.  EXIT.                                               SXK97077
232935*                                                                 SXK98180
232936 S0054-READ-TBXMAFC.                                              SXG04030
232937*                                                                 SXG04030
232938     IF TC-CANADA                                                 SXG04030
232939        IF CUA-SHIP-FROM > ZEROES                                 SXG04030
232940          MOVE CUA-SHIP-FROM     TO WS-BR-NBR-SHIP-FROM           SXG04030
232941        ELSE                                                      SXG04030
232942          MOVE WS-CUST-BR-NBR      TO    WS-BR-NBR-SHIP-FROM      SXG04030
232943        END-IF                                                    SXG04030
232944     END-IF.                                                      SXG04030
232945                                                                  SXG04030
232946     MOVE CORORH-COMPANY-CODE    TO TB-MAIF-CO.                   SXG04030
232947     MOVE WS-BR-NBR-SHIP-FROM     TO TB-MAIF-SF.                  SXG04030
232948     MOVE TB-CARRIER             TO TB-MAIF-CARRIER-TYPE.         SXG04030
232949     MOVE '1'                    TO TB-MAIF-SEQ.                  SXG04030
232950     MOVE WS-CUST-BR-NBR         TO TB-MAIF-BILL-TO-BR.           SXG04030
232951     MOVE WS-CUST-NUMBER         TO TB-MAIF-BILL-TO-NBR.          SXG04030
232952     MOVE WS-CUST-SUFFIX         TO TB-MAIF-BILL-TO-SUFFIX.       SXG04030
232953     CALL 'SYU510'         USING TB-MAIF-TABLE-IA.                SXG04030
232954     IF TB-MAIF-NORESP                                            SXG04030
232955        NEXT SENTENCE                                             SXG04030
232956     ELSE                                                         SXG04030
232957         MOVE ALL '0'            TO TB-MAIF-BILL-TO               SXG04030
232958         CALL 'SYU510'           USING TB-MAIF-TABLE-IA           SXG04030
232959         IF NOT TB-MAIF-NORESP                                    SXG04030
232960            IF TC-USA AND WS-HOLD-ON-ERROR                        ROR05277
232970               SET WS-HOLD-ON-CARR-ERR TO TRUE                    ROR06075
232971               MOVE 'Y'          TO WS-HOLD-ON-ERROR-TYPE         ROR06075
232972            ELSE                                                  SXG04030
232973               MOVE 'V'          TO WS-LU6ORH-ERROR-SW            SXG04030
232974            END-IF.                                               SXG04030
232975*                                                                 SXG04030
232976 S0054-EXIT.  EXIT.                                               SXG04030
232977*                                                                 SXG04030
232978 S0056-EDIT-CARRIER-ZIP.                                          SXK98180
232979*                                                                         
232980* IF THERE IS NO CARRIER CODE CHG THEN WE STILL NEED TO EDIT      SXK98180
232981* CHECK THE DEFAULT IN ORDER TO PREVENT ERROR CONDITIONS LATER    SXK98180
232982* ON IN PICK ASSIGNMENT AND/OR BILLING.                           SXK98180
232983********** FORCE ALL ORDERS TO GO THROUGH CARRIER CODE VALIDATION SXK98180
232984********** IF NO EDIT ERRORS FOUND TO THIS POINT.                 SXK98180
232985*                                                                 ROR04289
232986* BYPASS CARRIER VALIDATIONS FOR AMAZON EUROPE ACCOUNTS!          ROR04289
232987*  AMAZON EUROPE PROJECT . PTE # 35333.                           ROR04289
232988*                                                                 ROR04289
232989     IF WS-LU6ORH-ERROR-ALL-OK                                    ROR04289
232990        IF (TC-UNITED-KINGDOM AND WS-AMAZON-UK ) OR               ROR04289
232991           (TC-GERMANY        AND WS-AMAZON-DE )                  ROR04289
232992           NEXT SENTENCE                                          ROR04289
232993        ELSE                                                      ROR04289
232994         IF TC-EUROPE                                             ROR00326
232995            IF TC-UNITED-KINGDOM                                  ROR00326
232996               PERFORM S0058U-UK-VALIDATE-CARRIER THRU            ROR00326
232997                              S0058U-EXIT                         ROR00326
232998            ELSE                                                  ROR00326
232999               PERFORM S0058-EDIT-CARRIER-CODE    THRU            ROR00326
233000                              S0058-EXIT                          ROR00326
233001            END-IF                                                ROR00326
233002         END-IF                                                   ROR00326
233003        END-IF                                                    ROR04289
233004     END-IF.                                                      ROR00326
233005*                                                                 SXK98180
233006     IF TC-CANADA                                                 ROR00326
233007      IF CUA-DEF-OUT-FRT-CODE > SPACES                            SXK98180
233008         NEXT SENTENCE                                            SXK98180
233009      ELSE                                                        SXK98180
233010        IF CORORH-SHIP-VIA-CARRIER-CODE                           SXK98180
233011                       = 'PA' OR 'UR' OR 'LA' OR 'A9' OR 'AW'     SXK98180
233012           MOVE 'B'     TO  CUA-DEF-OUT-FRT-CODE.                 SXK98180
233013 S0056-EXIT.  EXIT.                                               SXK98180
233014*                                                                 SXK98180
233015 S0057-VALIDATE-POSTCODE.                                         SXK98180
233016*                                                                 SXK98180
233017*  AMAZON EUROPE PROJECT.                                         ROR04289
233018* BYPASS ADDRESS VALIDATIONS FOR FOLLOWING ACCOUNTS.              ROR04289
233019*                                                                 ROR04289
233020     IF (TC-UNITED-KINGDOM AND WS-AMAZON-UK ) OR                  ROR04289
233021        (TC-GERMANY        AND WS-AMAZON-DE )                     ROR04289
233022        MOVE WS-POSTAL-CODES TO CORORH-SHIP-TO-ZIP                ROR04289
233023                                WS-POSTAL-7                       ROR04289
233024                                WS-EUR-POSTAL                     ROR04289
233025        MOVE CORORH-SHIP-TO-CITY TO WS-CITY-14                    ROR04289
233026        MOVE WS-POSTAL-CITY TO CORORH-SHIP-TO-CITY                ROR04289
233027        MOVE CORORH-SHIP-TO-STATE TO ORH-SHIP-TO-STATE            ROR04289
233028        GO TO S0057-EXIT                                          ROR04289
233029     END-IF.                                                      ROR04289
233030*                                                                 ROR04289
233040*  REPLACE THE OLD HARD CODE LOGIC THAT WE HAD HERE               ROR06194
233050*   WITH SYSZIP MODULE THAT EDI EDP701 CURRENTLY USES.            ROR06194
233060*  THIS SYSZIP MODEL IS BEING EXECUTED IN S0057A- FOR             ROR06194
233070*    ELIGIBLE COUNTRIES.                                          ROR06194
233080*                                                                 ROR06194
233090     EVALUATE WS-TO-COUNTRY-CODE                                  ROR06194
233100     WHEN 'FO'                                                    ROR06194
233200     WHEN 'DK'                                                    ROR06194
233300     WHEN 'HU'                                                    ROR06194
233400     WHEN 'RO'                                                    ROR06194
233500     WHEN 'PT'                                                    ROR06194
233600     WHEN 'NO'                                                    ROR06194
233700     WHEN 'ES'                                                    ROR06194
233800     WHEN 'FR'                                                    ROR06194
233900     WHEN 'IT'                                                    ROR06194
           WHEN 'Z3'                                                    NR122063
234000     WHEN 'FI'                                                    ROR06194
234100     WHEN 'CZ'                                                    ROR06194
234200     WHEN 'SK'                                                    ROR06194
234300     WHEN 'SE'                                                    ROR06194
234400     WHEN 'BE'                                                    ROR06194
234500     WHEN 'LU'                                                    ROR06194
234600     WHEN 'AT'                                                    ROR06194
234700     WHEN 'DE'                                                    ROR06194
           WHEN 'PL'                                                    RYB24215
234800     WHEN 'DC'                                                    ROR06194
234900     WHEN 'NL'                                                    ROR06194
235000           PERFORM S0057A-VALIDATE-POSTCODE THRU S0057A-EXIT      ROR06194
235100     WHEN 'FT'                                                    ROR06194
235200       IF  CORORH-SHIP-TO-STATE = SPACES                          ROR06194
235300           MOVE 'S'                       TO WS-LU6ORH-ERROR-SW   ROR06194
235400           SET CORORH-R-ERROR-SHIP-VIA    TO TRUE                 ROR06194
235500           GO TO S0057-EXIT                                       ROR06194
235600       ELSE                                                       ROR06194
235700           MOVE CORORH-SHIP-TO-STATE      TO ORH-SHIP-TO-STATE    ROR06194
235800           GO TO S0057-EXIT                                       ROR06194
235900       END-IF                                                     ROR06194
236000     WHEN 'AU'                                                    ROR06194
236100* IN AUSTRALIA , STATE CODE IS A 3 BYTE FIELD.                    ROR06194
236200* SINCE WE HAVE ONLY 2 BYTES FOR STATE FIELD IN DATABASE ,        ROR06194
236300* WE ASKED THEM TO SEND CITY AND STATE IN CITY FIELD AND LEAVE    ROR06194
236400*  STATE FIELD AS SPACE.                                          ROR06194
236500           MOVE SPACES                    TO ORH-SHIP-TO-STATE    ROR06194
236600           GO TO S0057-EXIT                                       ROR06194
236700     WHEN 'HK'                                                    ROR14277
236800           CONTINUE                                               ROR14277
236900** CHANGES IS MADE FOR CH IMONLINE PROJECT TO REMOVE SPACE BETWEENPZD15128
237000** ZIP CODE AND CITY                                              PZD15128
237100     WHEN 'CH'                                                    PZD15128
237200           MOVE WS-POSTAL-CODES           TO CORORH-SHIP-TO-ZIP   PZD15128
237300                                             WS-POSTAL-5          PZD15128
237400           IF TC-EUROPE                                           PZD15128
237500              MOVE WS-POSTAL-CODES        TO WS-EUR-POSTAL        PZD15128
237600           END-IF                                                 PZD15128
237700           MOVE CORORH-SHIP-TO-CITY       TO WS-CITY-16           PZD15128
237800           MOVE WS-POSTAL-CITY            TO CORORH-SHIP-TO-CITY  PZD15128
237900           MOVE CORORH-SHIP-TO-STATE      TO ORH-SHIP-TO-STATE    PZD15128
238000     WHEN OTHER                                                   ROR06194
238100           MOVE WS-POSTAL-CODES           TO CORORH-SHIP-TO-ZIP   ROR06194
238200                                             WS-POSTAL-7          ROR06194
238300           IF TC-EUROPE                                           ROR06194
238400              MOVE WS-POSTAL-CODES        TO WS-EUR-POSTAL        ROR06194
238500           END-IF                                                 ROR06194
238600           MOVE CORORH-SHIP-TO-CITY       TO WS-CITY-14           ROR06194
                 IF WS-TO-COUNTRY-CODE = 'MX'                           FXS22063
                    MOVE WS-CITY-14             TO CORORH-SHIP-TO-CITY  FXS22063
                 ELSE                                                   FXS22063
                    MOVE WS-POSTAL-CITY         TO CORORH-SHIP-TO-CITY  FXS22063
                 END-IF                                                 FXS22063
238800           MOVE CORORH-SHIP-TO-STATE      TO ORH-SHIP-TO-STATE    ROR06194
238900           GO TO S0057-EXIT                                       ROR06194
239000     END-EVALUATE.                                                ROR06194
239100*                                                                 ROR06194
248000 S0057-EXIT.    EXIT.                                             SXK98180
248100*                                                                 SXK98180
248200*                                                                 ROR06194
248300 S0057A-VALIDATE-POSTCODE.                                        ROR06194
248400*                                                                 ROR06194
248500*                                                                 ROR06194
248600     IF TB-CPO-EUROPEAN-CNTRY                                     ROR06194
248700        NEXT SENTENCE                                             ROR06194
248800     ELSE                                                         ROR06194
248900        MOVE WS-POSTAL-CODES              TO CORORH-SHIP-TO-ZIP   ROR06194
249000                                             WS-POSTAL-7          ROR06194
249100        IF TC-EUROPE                                              ROR06194
249200           MOVE WS-POSTAL-CODES           TO WS-EUR-POSTAL        ROR06194
249300        END-IF                                                    ROR06194
249400        MOVE CORORH-SHIP-TO-CITY          TO WS-CITY-14           ROR06194
249500        MOVE WS-POSTAL-CITY               TO CORORH-SHIP-TO-CITY  ROR06194
249600        MOVE CORORH-SHIP-TO-STATE         TO ORH-SHIP-TO-STATE    ROR06194
249700        GO TO S0057A-EXIT                                         ROR06194
249800     END-IF.                                                      ROR06194
249900*                                                                 ROR06194
250000     INITIALIZE SYWZIP-2-ADDR                                     ROR06194
250100                SYWZIP-2-ZIP                                      ROR06194
250200                SYWZIP-2-COUNTRY.                                 ROR06194
250300*                                                                 ROR06194
250400     MOVE WS-POSTAL-CODES               TO WS-ST-ZIP-CODE.        ROR06194
250500     IF WS-ST-ZIP-CODE GREATER THAN SPACES                        ROR06194
250600         IF WS-ST-ZIP-4 = SPACES                                  ROR06194
250700         AND (CORORH-COMPANY-CODE = 'MD')                         ROR06194
250800            MOVE '0000'                 TO WS-ST-ZIP-4            ROR06194
250900         END-IF                                                   ROR06194
251000         MOVE WS-ST-ZIP-CODE            TO SYWZIP-2-ZIP.          ROR06194
251100     IF CORORH-SHIP-TO-CITY GREATER THAN SPACES                   ROR06194
251200         MOVE CORORH-SHIP-TO-CITY       TO SYWZIP-2-ADDR.         ROR06194
251300     IF CORORH-SHIP-TO-CNTRY-CODE GREATER THAN SPACES             ROR06194
251400         MOVE CORORH-SHIP-TO-CNTRY-CODE TO SYWZIP-2-COUNTRY.      ROR06194
251500*                                                                 ROR06194
251600* THIS WS-ERROR-MESSAGE IS BEING USED IN F4000-PARA.              ROR06194
251700*   SINCE WE DONT GO TO F4000- PARA IF WE GET AN ERROR HERE,      ROR06194
251800*   WE CAN USE THAT FIELD FOR OUR ERROR TRAPPING HERE.            ROR06194
251900*  THIS FIELD GETS MOVED TO CORORH-R-ERROR-MESSAGE AT THE END,    ROR06194
252000*   SO WE CAN USE THAT FIELD TO KNOW WHAT EXACT ERROR WE GOT      ROR06194
252100*   FROM SYSZIP MODULE ALONG WITH ISSUING GENERIC EV ERROR.       ROR06194
252200*                                                                 ROR06194
252300     PERFORM SYSZIP-000-VALIDATE THRU SYSZIP-000-EXIT.            ROR06194
252400     IF SYWZIP-ERROR                                              ROR06194
252500        MOVE 'S'                          TO WS-LU6ORH-ERROR-SW   ROR06194
252600        SET CORORH-R-ERROR-SHIP-VIA       TO TRUE                 ROR06194
252700        MOVE SPACES                       TO WS-ERROR-MESSAGE     ROR06194
252800        MOVE SYWZIP-ERROR-CODE            TO WS-ERROR-MESSAGE     ROR06194
252900        GO TO S0057A-EXIT                                         ROR06194
253000     ELSE                                                         ROR06194
253100* NEED THIS BELOW SPECIAL LOGIC FOR ITALY.                        ROR06201
253200* NEED TO SAVE CUSTOMER SENT IN CITY ON ADDRESS -LINE 3 AND       ROR06201
253300*   CUSTOMER SENT POSTAL CODE ON CITY FIELD.                      ROR06201
253400*  REASON : CUSTOMER SENDS IN PROVINCE CODE ALONG WITH POST CODE  ROR06201
253500*   AND THIS IS NEEDED TO ASSIGN APPROPRIATE CARR BY SALES.       ROR06201
      * ADDED THE BELOW LOGIC FOR IM360 ORDERS, AS BUSINESS REQUESTED   VXA21078
      * THAT THE ADDRESS LINE 3 SHOULD NOT BE OVERRIDDEN WITH           VXA21078
      * CITY AS IT CAUSES ISSUES FOR WAREHOUSE TO SHIP THE PRODUCTS     VXA21078
      * BELOW LOGIC IS ADDED FOR CITY SHOULD BE SENT ON ADDRESS-LINE4   MXU26198
      * AS PART OF AN SE RAISED FOR ITALIAN ORDERS.                     MXU26198
              IF WS-TO-COUNTRY-CODE = 'IT' OR 'Z3'                      NR122063
                 IF TB-IL2-ADDR4-CITY-CHG                               MXU26198
                      MOVE WS-POSTAL-CODES (1:5) TO WS-EUR-POSTAL       VXA21078
                      MOVE WS-EUR-POSTAL TO ORH-POSTAL-CODES            VXA21078
                      MOVE WS-EUR-POSTAL TO CORORH-SHIP-TO-CITY(1:5)    VXA21078
                      MOVE SPACE TO CORORH-SHIP-TO-CITY (6:1)           VXA21078
                      MOVE '-'   TO CORORH-SHIP-TO-CITY (7:1)           VXA21078
                      MOVE WS-ENTER-SHIP-TO-CITY TO                     VXA21078
                                    CORORH-SHIP-TO-CITY (8:14)          VXA21078
                      MOVE CORORH-SHIP-TO-STATE  TO                     VXA21078
                                         ORH-SHIP-TO-STATE              VXA21078
                      GO TO S0057A-EXIT                                 VXA21078
                 END-IF                                                 VXA21078
              END-IF                                                    VXA21078
              IF WS-TO-COUNTRY-CODE = 'IT' OR 'Z3'                      NR122063
253700           MOVE WS-POSTAL-CODES (1:5) TO WS-EUR-POSTAL            ROR06201
253800           MOVE CORORH-SHIP-TO-CITY                               ROR06201
253900             TO CORORH-SHIP-TO-ADDRESS-3                          ROR06201
254000           MOVE CORORH-SHIP-TO-ZIP                                ROR06201
254100             TO CORORH-SHIP-TO-CITY                               ROR06201
254200           MOVE WS-EUR-POSTAL TO ORH-POSTAL-CODES                 ROR06201
254300        ELSE                                                      ROR06201
254400           MOVE SYWZIP-2-ADDR             TO CORORH-SHIP-TO-CITY  ROR06194
254500           MOVE SYWZIP-2-ZIP              TO CORORH-SHIP-TO-ZIP   ROR06194
254600                                             WS-POSTAL-7          ROR06194
254700                                             WS-EUR-POSTAL        ROR06194
254800                                             ORH-POSTAL-CODES     ROR06194
254900        END-IF                                                    ROR06201
255000        MOVE CORORH-SHIP-TO-STATE         TO ORH-SHIP-TO-STATE    ROR06194
255100     END-IF.                                                      ROR06194
255200*                                                                 ROR06194
255300 S0057A-EXIT.   EXIT.                                             ROR06194
255301*                                                                 ROR06194
255302*                                                                 SXK98180
255303*                                                                 SXK98180
255304 S0057U-UK-VALIDATE-POSTCODE.                                     SXK98180
255305*                                                                 ROR04289
255306* BYPASS UK ADDRESS VALIDATIONS FOR ALL COUNTRIES EXCEPT UK.      ROR11315
255307*                                                                 ROR11315
255308     IF TC-UNITED-KINGDOM                                         ROR11315
255309        NEXT SENTENCE                                             ROR11315
255310     ELSE                                                         ROR11315
255320        MOVE CORORH-SHIP-TO-ZIP    TO ORH-POSTAL-CODES            ROR11315
255330        GO TO S0057U-EXIT                                         ROR11315
255340     END-IF.                                                      ROR11315
255341*                                                                 ROR11315
255342* BYPASS ADDRESS VALIDATIONS FOR FOLLOWING ACCOUNTS.              ROR04289
255343*  AMAZON EUROPE PROJECT.                                         ROR04289
255344*                                                                 ROR04289
255345     IF (TC-UNITED-KINGDOM AND WS-AMAZON-UK ) OR                  ROR04289
255346        (TC-GERMANY        AND WS-AMAZON-DE )                     ROR04289
255347     OR (WS-TO-COUNTRY-CODE = 'IE')                               PKV10104
255348        MOVE CORORH-SHIP-TO-ZIP    TO ORH-POSTAL-CODES            ROR04289
255349        GO TO S0057U-EXIT                                         ROR04289
255350     END-IF.                                                      ROR04289
255351*                                                                 ROR04289
255352     MOVE SPACES                 TO WS-POSTCODE-UK.               SXK98180
255353     IF CORORH-SHIP-TO-ZIP (3:1) = SPACES                         SXK98180
255354         MOVE CORORH-SHIP-TO-ZIP (1:2) TO WS-POSTCODE-PREFIX      SXK98180
255355         MOVE CORORH-SHIP-TO-ZIP (4:3) TO WS-POSTCODE-SUFFIX      SXK98180
255356     ELSE                                                         SXK98180
255357     IF CORORH-SHIP-TO-ZIP (4:1) = SPACES                         SXK98180
255358         MOVE CORORH-SHIP-TO-ZIP (1:3) TO WS-POSTCODE-PREFIX      SXK98180
255359         MOVE CORORH-SHIP-TO-ZIP (5:3) TO WS-POSTCODE-SUFFIX      SXK98180
255360     ELSE                                                         SXK98180
255361     IF CORORH-SHIP-TO-ZIP (5:1) = SPACES                         SXK98180
255362         MOVE CORORH-SHIP-TO-ZIP (1:4) TO WS-POSTCODE-PREFIX      SXK98180
255363         MOVE CORORH-SHIP-TO-ZIP (6:3) TO WS-POSTCODE-SUFFIX      SXK98180
255364     ELSE                                                         SXK98180
255365         MOVE 'S'                TO WS-LU6ORH-ERROR-SW            SXK98180
255366         SET CORORH-R-ERROR-SHIP-VIA        TO TRUE               SXK98180
255367*              MOVE 'INVALID POSTCODE'                            SXK98180
255368         GO TO S0057U-EXIT.                                       SXK98180
255369*                                                                 SXK98180
255370     IF WS-POSTCODE-PREFIX = 'EIRE' OR 'XXX '                     SXK98180
255371        GO TO S0057U-EXIT                                         SXK98180
255372     ELSE                                                         SXK98180
255373        IF WS-POSTCODE-SUFFIX (1:1) NOT NUMERIC                   SXK98180
255374           OR (WS-POSTCODE-SUFFIX (2:2) NOT ALPHABETIC            SXK98180
255375           OR WS-POSTCODE-SUFFIX (2:2) = SPACES)                  SXK98180
255376           MOVE 'S'              TO WS-LU6ORH-ERROR-SW            SXK98180
255377           SET CORORH-R-ERROR-SHIP-VIA  TO TRUE                   SXK98180
255378*          MOVE 'INVALID SUFFIX'                                  SXK98180
255379           GO TO S0057U-EXIT.                                     SXK98180
255380*                                                                 SXK98180
255381     MOVE LOW-VALUE              TO  ORP-PCR-KEY.                 SXK98180
255382     MOVE 'UK'                   TO  ORP-PCR-CO.                  TKC04099
255383     MOVE 'Z'                    TO  ORP-PCR-CODE.                SXK98180
255384     MOVE WS-POSTCODE-PREFIX     TO  ORP-PCR-PREFIX.              SXK98180
255385*                                                                 SXK98180
255386     EXEC CICS READ                                               SXK98180
255387               FILE    (WS-ORP-FILE-NAME)                         SXK98180
255388               LENGTH  (WS-ORP-PCR-RECLEN)                        SXK98180
255389               INTO    (ORP-POSTCODE-RECORD)                      SXK98180
255390               RIDFLD  (ORP-PCR-KEY)                              SXK98180
255391               RESP    (WS-EIBRESP)                               SXK98180
255392     END-EXEC.                                                    SXK98180
255393*                                                                 SXK98180
255394     IF WS-EIB-NORESP                                             SXK98180
255395        NEXT SENTENCE                                             SXK98180
255396     ELSE                                                         SXK98180
255397        IF WS-EIB-NOTFND                                          SXK98180
255398           MOVE 'S'              TO WS-LU6ORH-ERROR-SW            SXK98180
255399           SET CORORH-R-ERROR-SHIP-VIA  TO TRUE                   SXK98180
255400*          MOVE 'INVALID PREFIX'                                  SXK98180
255401        ELSE                                                      SXK98180
255402           MOVE 'S0057U'         TO WS-ABCODE                     SXK98180
255403           PERFORM 999-ABEND.                                     SXK98180
255404                                                                  SXK98180
255405     IF NOT WS-ERROR-FOUND                                        SXK98180
255406          MOVE WS-POSTCODE-UK    TO  ORH-POSTAL-CODES.            SXK98251
255407*                                                                 SXK98180
255408 S0057U-EXIT.   EXIT.                                             SXK98180
255409*                                                                 SXK98180
255410*                                                                 SXK98180
255420 S0058-EDIT-CARRIER-CODE.                                         SXK98180
255500     MOVE CORORH-COMPANY-CODE    TO ORH-COMPANY                   SXK98180
255600                                    WS-CARR-CODE(1:2).            SXK98180
255700     IF TC-FRANCE AND WS-CARR-NOT-ENTERED                         ROR00178
255800        MOVE WS-DEFAULT-CARRIER  TO CORORH-SHIP-VIA-CARRIER-CODE  ROR01173
256000     END-IF                                                       FVB00038
256100*                                                                 ROR01173
256200     IF CORORH-SHIP-VIA-CARRIER-CODE > SPACES                     SXK98180
256300        MOVE CORORH-SHIP-VIA-CARRIER-CODE TO WS-CARR-CODE(3:2)    SXK98180
256400                                             WS-EUR-CARR-OUT      SXK98180
256500     END-IF.                                                      ROR01173
257200     IF CORORH-SHIP-TO-ZIP >       SPACES                         SXK98180
257300        MOVE  CORORH-SHIP-TO-ZIP     TO   WS-EUR-POSTCODE         SXK98180
257400     ELSE                                                         SXK98180
257500        MOVE  CUA-POSTAL-CODES       TO   WS-EUR-POSTCODE.        SXK98180
257600     PERFORM S0058A-EUR-VALIDATE-CARRIER THRU S0058A-EXIT.        SXK98180
257700* IF WS-EUR-CARR-OUT COMES OUT THE OF THE ABOVE ROUTINE AS SPACES ROR01129
257800*   MOVE THE OLD VALUE BACK IN TO THIS  FIELD.REASON FOR MASKING  ROR01129
257900*   THIS  ERROR..OF  WS-EUR-CARR-OUT  BEING SPACES...IS  WEB      ROR01129
258000*   CANT  SEND  IN A CARRIER ON THE HEADER TRANSACTION.           ROR01129
258100     IF  WS-TAT-FRANCE                                            FVB00038
258200         IF  WS-EUR-CARR-OUT EQUAL SPACES                         ROR01129
258300             IF ITS-A-WEB-ORDER                                   ROR01152
258400                MOVE WS-CARR-CODE (3:2) TO                        ROR01152
258500                                 WS-EUR-CARR-OUT                  ROR01152
258600                                 CORORH-SHIP-VIA-CARRIER-CODE     ROR01129
258700             ELSE                                                 ROR01152
258800                NEXT SENTENCE                                     ROR01152
258900             END-IF                                               ROR01152
259000         ELSE                                                     ROR01129
259100             MOVE WS-EUR-CARR-OUT    TO                           ROR01129
259200                                 WS-CARR-CODE (3:2)               ROR01129
259300                                 CORORH-SHIP-VIA-CARRIER-CODE     ROR01129
259400         END-IF                                                   ROR01129
259500     END-IF.                                                      ROR01152
259600     IF  WS-EUR-CARR-OUT NOT = WS-CARR-CODE (3:2)                 SXK98180
259700         MOVE 'V' TO WS-LU6ORH-ERROR-SW                           SXK98180
259800         SET CORORH-R-ERROR-SHIP-VIA TO TRUE.                     SXK98180
259900     IF TC-CANADA                                                 ROR00326
260000      IF CUA-DEF-OUT-FRT-CODE > SPACES                            SXK98251
260100         NEXT SENTENCE                                            SXK98251
260200      ELSE                                                        SXK98251
260300        IF CORORH-SHIP-VIA-CARRIER-CODE                           SXK98251
260400                       = 'PA' OR 'UR' OR 'LA' OR 'A9' OR 'AW'     SXK98251
260500           MOVE 'B'     TO  CUA-DEF-OUT-FRT-CODE.                 SXK98251
260600 S0058-EXIT.   EXIT.                                              SXK98180
260700 S0058A-EUR-VALIDATE-CARRIER.                                     SXK98180
260800     IF WS-TAT-FRANCE AND NOT WS-TAT-FRANCE-ECONOCOM              KXA07030
260900         MOVE ORH-COMPANY      TO SYWTAT-COUNTRY                  KXA07030
261000         MOVE WS-EUR-CARR-OUT  TO SYWTAT-CARRIER-CODE             KXA07030
261100         MOVE WS-EUR-POSTCODE  TO SYWTAT-ZIP                      KXA07030
261200         PERFORM S0058B-TAT-VALIDATE-CARRIER                      KXA07030
261300           THRU S0058B-EXIT                                       KXA07030
261400         MOVE SYWTAT-CARRIER-CODE                                 KXA07030
261500                               TO WS-EUR-CARR-OUT                 KXA07030
261600         IF SYWTAT-FAILURE = 'Y'                                  KXA07030
261700             MOVE 'V'          TO WS-LU6ORH-ERROR-SW              KXA07030
261800             SET CORORH-R-ERROR-SHIP-VIA                          KXA07030
261900                               TO TRUE                            KXA07030
262000         END-IF                                                   KXA07030
262100     ELSE                                                         KXA07030
262200         PERFORM S0058C-EUR-VALIDATE-CARRIER                      KXA07030
262300           THRU S0058C-EXIT                                       KXA07030
262400     END-IF.                                                      KXA07030
262500                                                                  KXA07030
262600 S0058A-EXIT.  EXIT.                                              KXA07030
262700*                                                                 KXA07030
262800 S0058B-TAT-VALIDATE-CARRIER.                                     KXA07030
262900       COPY SYSTATO.                                              KXA07030
263000 S0058B-EXIT.  EXIT.                                              KXA07030
263100*                                                                 KXA07030
263200 S0058C-EUR-VALIDATE-CARRIER.                                     KXA07030
263300       COPY ORSPCODE.                                             KXA07030
263400 S0058C-EXIT.  EXIT.                                              KXA07030
263401*                                                                 ROR06075
263402 S0058U-UK-VALIDATE-CARRIER.                                      SXK98180
263403*                                                                 ROR06075
263404     IF CORORH-SHIP-VIA-CARRIER-CODE > SPACES                     SXK98180
263405        MOVE CORORH-SHIP-VIA-CARRIER-CODE TO WS-HOLD-CARRIER      SXK98180
263406     ELSE                                                         SXK98180
263407           MOVE 'V'            TO WS-LU6ORH-ERROR-SW              SXK98180
263408           SET CORORH-R-ERROR-SHIP-VIA  TO TRUE                   SXK98180
263409           GO TO S0058U-EXIT.                                     SXK98180
263410*                                                                 ROR06075
263420     INITIALIZE COP-ORWUKCAR.                                     ROR06075
263430     MOVE CORORH-CUSTOMER-KEY(3:8)     TO WS-ORWUKCAR-CUST-KEY.   ROR06075
263440     MOVE CORORH-COMPANY-CODE          TO WS-CARR-CODE(1:2)       ROR06075
263450                                          WS-ORWUKCAR-CO-CODE.    ROR06075
263460     MOVE CORORH-SHIP-VIA-CARRIER-CODE TO WS-ORWUKCAR-CARRIER     ROR06075
263470                                          WS-CARR-CODE(3:2).      ROR06075
263480     MOVE CORORH-SHIP-TO-CNTRY-CODE    TO WS-ORWUKCAR-CNTRY-CODE. ROR06075
263490     MOVE CORORH-SHIP-TO-ZIP           TO WS-ORWUKCAR-SHIP-TO-ZIP.ROR06075
263500     MOVE WS-POSTCODE-PREFIX           TO                         ROR06075
263600          WS-ORWUKCAR-POSTCODE-PREF.                              ROR06075
263700     MOVE WS-SHIP-TO-ADDRESS-SW        TO                         ROR06075
263800          WS-ORWUKCAR-SHIP-TO-ADDR-SW.                            ROR06075
263900* NEED THIS BELOW STATEMENT AS ITS NEEDEDIN WHSUKCC COPYBOOK.     ROR06194
264000     MOVE CORORH-COMPANY-CODE          TO ORH-COMPANY.            ROR06194
264100*                                                                 ROR06075
264200     PERFORM P040-CHECK-UK-CARRIER THRU P040-EXIT.                ROR06075
264300*                                                                 ROR06075
264400     MOVE WS-ORWUKCAR-POSTCODE-PREF    TO                         ROR06075
264500          WS-POSTCODE-PREFIX.                                     ROR06075
264600*                                                                 ROR06075
264700*    IF WS-ORWUKCAR-ABEND-SW EQUAL 'Y'                            ROR06075
264800*       MOVE 'S0058U'         TO WS-ABCODE                        ROR06075
264900*       PERFORM 999-ABEND.                                        ROR06075
265000*                                                                 ROR06075
265100*                                                                 ROR06194
265200* THIS WS-ERROR-MESSAGE IS BEING USED IN F4000-PARA.              ROR06194
265300*   SINCE WE DONT GO TO F4000- PARA IF WE GET AN ERROR HERE,      ROR06194
265400*   WE CAN USE THAT FIELD FOR OUR ERROR TRAPPING HERE.            ROR06194
265500*  THIS FIELD GETS MOVED TO CORORH-R-ERROR-MESSAGE AT THE END,    ROR06194
265600*   SO WE CAN USE THAT FIELD TO KNOW WHAT EXACT ERROR WE GOT      ROR06194
265700*   FROM ORSUKCAR MODULE ALONG WITH ISSUING GENERIC EV ERROR.     ROR06194
265800*                                                                 ROR06194
265900     IF WS-ORWUKCAR-ERROR-SW EQUAL 'Y'                            ROR06075
266000        IF WS-UKCC-ERROR GREATER THAN SPACES                      ROR06194
266100           MOVE SPACES                    TO WS-ERROR-MESSAGE     ROR06194
266200           MOVE WS-UKCC-ERROR             TO WS-ERROR-MESSAGE     ROR06194
266300        END-IF                                                    ROR06194
266400        MOVE 'V'               TO WS-LU6ORH-ERROR-SW              ROR06075
266500        SET CORORH-R-ERROR-SHIP-VIA    TO TRUE.                   ROR06075
266600*                                                                 ROR06075
279900 S0058U-EXIT.  EXIT.                                              SXK98180
285300*                                                                         
285400 S1000-SET-ERRORS.                                                ROR02128
285500*                                                                         
285600*---  SET ERROR FLAG FOR ELCON LUOUT (LAYOUT CORORH)              PXP95004
285700*                                                                         
285800     INITIALIZE                           CORORH-RESPONSE-AREA.   PXP95004
285900     IF WS-LU6ORH-ERROR-FLAG > SPACES                             ROR99135
286000        MOVE WS-LU6ORH-ERROR-FLAG     TO                          ROR99135
286100                                   CORORH-R-RECORD-RESPONSE       ROR00080
286200     ELSE                                                         ROR99135
286300        MOVE 'E'                      TO                          ROR99135
286400                                   CORORH-R-RECORD-RESPONSE-FLAG  ROR99135
286500*                                                                 ROR06075
286600* HERE WE ARE MAKING SURE THAT WE ARE NOT SENDING "E " BACK       ROR06075
286700* WE WANT TO SET "E#" WHEN WE GET AN ABEND INSTEAD OF "E " FOR    ROR06075
286800* UNDOCUMENTED ABENDS AND WE WILL POPULATE ABENDCODE IN           ROR06075
286900* ERROR MESSAGE AREA.                                             ROR06075
287000*                                                                 ROR06075
287001     IF WS-LU6ORH-ERROR-SW GREATER THAN SPACES                    ROR06075
287002        MOVE WS-LU6ORH-ERROR-SW       TO  CORORH-R-ERROR-TYPE     ROR99135
287003     ELSE                                                         ROR06075
287004        MOVE '#'                      TO  CORORH-R-ERROR-TYPE     ROR06075
287005     END-IF                                                       ROR06075
287006     IF WS-ABCODE GREATER THAN SPACE                              ROR06075
287007        MOVE WS-ABCODE                TO  CORORH-R-ERROR-MESSAGE  ROR06075
287008     ELSE                                                         ROR06075
287009        MOVE WS-ERROR-MESSAGE         TO  CORORH-R-ERROR-MESSAGE  TEH00259
287010     END-IF                                                       ROR06075
287011     MOVE WS-ADDR-ERR-TYPE            TO  CORORH-R-ADDR-ERR-TYPE  ROR99214
287012     END-IF.                                                      ROR99135
                                                                        KXD19278
      * POPULATING ORDER NUMBER SO THAT INCOMPLETE ORDERS WITH ONLY     KXD19278
      * ORDER HEADER DO NOT LEAD TO RESENT ORDERS BEING REJECTED AS     KXD19278
      * DUPLICATES.                                                     KXD19278
                                                                        KXD19278
           IF WS-LU6ORH-ERROR-FLAG = 'EI'                               KXD19278
              MOVE TC-ORDER-BR-NBR             TO CORORH-R-ORDER-BRANCH KXD19278
              MOVE TC-ORDER-NBR                TO CORORH-R-ORDER-NBR    KXD19278
           END-IF                                                       KXD19278
287013*                                                                         
287014     PERFORM S1500-WRITE-LUOT-QUEUE.                                      
287100*                                                                         
287200*                                                                         
287300 S1000-EXIT. EXIT.                                                ROR02128
287400*                                                                         
287500*                                                                 ROR99330
287600******************************************************************ROR99330
287700 S1010-GROUP1-VERIFICATION.                                       ROR99330
287800*                                                                 ROR00060
287900****************************************************              ROR00060
288000*PREVENT EXPORT ORDERS FROM GOING THRU GROUP1 (EXCEPT FOR         ROR00060
288100*  STATE CODES ..PR..GU..VI..AA..AP..AE.. ) AND                   ROR00060
288200*..SET A FLAG ON ORSSHH INDICATING THIS AS AN EXPORT ORDER        ROR00060
288300****************************************************              ROR00060
288400     IF NOT TB-CPO2-GRP1-CODE1-ENABLED                            ROR00060
288500*       GO TO S1010-EXIT                                          ROR17111
288510        GO TO S1010-CODE1-EXIT                                    ROR17111
288600     END-IF.                                                      ROR00060
288700*                                                                 ROR00060
288800     IF WS-GROUP1-EXPORT-SW NOT EQUAL SPACES                      ROR00060
288900*       GO TO S1010-EXIT                                          ROR17111
288910        GO TO S1010-CODE1-EXIT                                    ROR17111
289000     END-IF.                                                      ROR00060
289100                                                                  ROR17111
289200     MOVE TC-ORDER-NBR                       TO WS-CD1-ORDER-NBR. ROR17111
289300     IF CORORH-FRT-OUT-CODE GREATER THAN SPACE                    ROR17111
289400        MOVE CORORH-FRT-OUT-CODE             TO WS-CD1-FRTO-CODE  ROR17111
289500     ELSE                                                         ROR17111
289600        MOVE SPACE                           TO WS-CD1-FRTO-CODE  ROR17111
289700     END-IF.                                                      ROR17111
289800     IF CORORH-SHIP-VIA-CARRIER-CODE GREATER THAN SPACES          ROR17111
289900        MOVE CORORH-SHIP-VIA-CARRIER-CODE    TO WS-CD1-CARR-CODE  ROR17111
290000     ELSE                                                         ROR17111
290100        MOVE SPACE                           TO WS-CD1-CARR-CODE  ROR17111
290200     END-IF.                                                      ROR17111
290300     IF CORORH-SHIP-TO-ZIP  GREATER THAN SPACES                   ROR17111
290400        MOVE CORORH-SHIP-TO-ZIP              TO WS-CD1-ZIPCODE    ROR17111
290500     ELSE                                                         ROR17111
290600        MOVE SPACE                           TO WS-CD1-ZIPCODE    ROR17111
290700     END-IF.                                                      ROR17111
290800     IF  CORORH-COMPANY-CODE = 'FT'                               ROR17111
290900        MOVE 'CA'                            TO WS-CD1-COUNTRY    ROR17111
291000     ELSE                                                         ROR17111
291100        MOVE CORORH-COMPANY-CODE             TO WS-CD1-COUNTRY    ROR17111
291200     END-IF.                                                      ROR17111
291300     MOVE 'Y'                   TO WS-AUDIT-CODE1-SW.             ROR17111
291400     IF TB-COD1-NORESP                                            ROR17111
291500        IF TB-COD1-BYPASS-YES                                     ROR17111
291600           MOVE 'Y'                   TO WS-BYPASS-CODE1-SW       ROR17111
291700           MOVE 'ORDER ENTRY METHOD TBXCODE1 BYPASS'              ROR17111
291800                                   TO WS-CD1-BYP-MESSAGE          ROR17111
291900               MOVE 'W' TO CORORH-R-RECORD-RESPONSE-FLAG          ROR17111
292000                           WS-R-WARN-FLAG                         ROR17111
292100               MOVE 'C' TO WS-LU6ORH-WARNING-SW                   ROR17111
292200                           WS-R-WARN-TYPE                         ROR17111
292300               PERFORM S8000-SET-WARNINGS THRU S8000-EXIT         ROR17111
292400        ELSE                                                      ROR17111
292500           IF TB-COD1-SUPPR-ENABLED                               ROR17111
292600              MOVE CORORH-COMPANY     TO   TC-COMPANY             ROR17111
292700              MOVE CORORH-BR-NBR      TO   TC-BR-NBR              ROR17111
292800              MOVE CORORH-CUST-NBR    TO   TC-BR-CUST-NBR(3:6)    ROR17111
292900              MOVE CORORH-SUFFIX      TO   TC-CUST-SUFFIX         ROR17111
293000              PERFORM S1010-CODE1-BYPASS-CHECK THRU               ROR17111
293100                      S1010-EXIT                                  ROR17111
293200           END-IF                                                 ROR17111
293300        END-IF                                                    ROR17111
293301     END-IF.                                                      ROR17111
293302*                                                                 ROR99330
293303* CALL CODE1 LOGIC FOR VALIDATING ADDRESS                         ROR17111
293304*    IF CUOF-ECOM-BYPASS-GROUP1                                   ROR17111
293305     IF WS-BYPASS-CODE1-SW = 'Y'                                  ROR17111
293306        IF CORORH-RESIDENTIAL-SW = 'R'    OR                      TEH05195
293307           CORORH-RESIDENTIAL-SW = 'F'                            TEH05195
293308           MOVE CORORH-RESIDENTIAL-SW   TO WS-HOLD-USPS-SW        TEH05195
293309        ELSE                                                      TEH05195
293310           PERFORM S1020-GROUP1-ADDR-VALIDATION THRU S1020-EXIT   TEH05195
293311     ELSE                                                         TEH05195
293312        PERFORM S1020-GROUP1-ADDR-VALIDATION THRU S1020-EXIT.     ROR99330
293313*                                                                 ROR99330
293314*--  IF IN CASE REQUEST COMING FROM EAI,DO NOT SWITCH OVRD SW     DXB16281
293315*--  TO Y(VERSION NUMBER FOR EAI IS ALWAYS BLANK OR LESS THAN 2   DXB16281
293316     IF CORORH-VERSION-NBR < 2                                    ROR99330
293317       IF WS-FROM-SUBSTATION AND                                  DXB16281
293318*         CORORH-TERM-ID = 'WEBX'                                 AZD18124
293319          CORORH-FROM-PCG3                                        AZD18124
293320          CONTINUE                                                DXB16281
293321        ELSE                                                      DXB16281
293330          MOVE 'Y' TO CORORH-ADDRESS-OVERRIDE-FLAG                ROR99330
293331        END-IF                                                            
293332     END-IF.                                                      ROR99330
293333*    IF CUOF-ECOM-BYPASS-GROUP1                                   ROR17111
           IF ((WS-BYPASS-CODE1-SW = 'Y') OR                            TXT21050
               CUOF-ECOM-RT-BYPASS-GROUP1)                              TXT21050
293335        MOVE 'N'           TO CUWG1ERR-RETURN-CODE                TEH04167
293336     END-IF.                                                      TEH04167
293337*                                                                 ROR99330
293338***************************************************************   ROR99330
293339* IRRESPECTIVE OF VERSION NBR  'S2' AND 'S6' ARE  ERRORS          ROR99330
293340* ..BECAUSE  OF  UNACCEPTABLE  STREET ADDRESS AND ZIP RESPECTIVELYROR99330
293341* 'S2'   NOT AN  ERROR  FOR PHASE1..AS  CUSTOMERS  ARE NOT        ROR99330
293342* FOLLOWING THE  STANDARD  OF GIVING ADDR  ON LINES 1 & 2         ROR99330
293343* *************************************************************   ROR99330
293344     EVALUATE CUWG1ERR-RETURN-CODE                                ROR99330
293345     WHEN  'S'                                                    ROR99330
293346        EVALUATE CUWG1ERR-MSG-RETURNED                            ROR99330
293347        WHEN    'ERROR: NEED MORE ADDR INFO'                      ROR99330
293348                 MOVE 'S1'           TO WS-ADDR-ERR-TYPE          ROR99330
293349        WHEN    'ERROR: STREET NOT FOUND IN ZIP'                  ROR99330
293350*                MOVE 'S'            TO WS-LU6ORH-ERROR-SW        ROR99330
293351                 MOVE 'S2'           TO WS-ADDR-ERR-TYPE          ROR99330
293352*                GO TO S1010-EXIT                                 ROR99330
293353        WHEN    'ERROR: HOUSE/POBOX NOT ON STREET'                ROR99330
293354                 MOVE 'S3'           TO WS-ADDR-ERR-TYPE          ROR99330
293355        WHEN    'ERROR: UNIT# MISSING/NOT FOUND'                  ROR99330
293356                 MOVE 'S4'           TO WS-ADDR-ERR-TYPE          ROR99330
293357        WHEN    'WARNING: MULTI ADDRS FND - VERIFY'               ROR99330
293358                 MOVE 'S5'           TO WS-ADDR-ERR-TYPE          ROR99330
293359        WHEN    'ERROR: HOUSE RANGE NOT ON STREET'                ROR17111
293360                 MOVE 'S7'           TO WS-ADDR-ERR-TYPE          ROR17111
293370        WHEN    'ERROR: APT # MISSING/NOT FOUND'                  ROR17111
293371                 MOVE 'S8'           TO WS-ADDR-ERR-TYPE          ROR17111
293372        WHEN    'ERROR: POST OFFICE BOX RANGE NOT FOUND'          ROR17111
293373                 MOVE 'SB'           TO WS-ADDR-ERR-TYPE          ROR17111
293374        WHEN    'ERROR:ROUTE SERVICE IDENTIFIER NOT FOUND'        ROR17111
293375                 MOVE 'SC'           TO WS-ADDR-ERR-TYPE          ROR17111
293376        END-EVALUATE                                              ROR99330
293377     WHEN  'Y'                                                    ROR99330
293378        EVALUATE CUWG1ERR-MSG-RETURNED                            ROR99330
293379        WHEN    'WARNING: ADDR CHANGED - VERIFY'                  ROR99330
293380                 MOVE 'W1'           TO WS-ADDR-ERR-TYPE          ROR99330
293381        WHEN    'WARNING: DIRECTIONAL CHGD -VERIFY'               ROR99330
293382                 MOVE 'W2'           TO WS-ADDR-ERR-TYPE          ROR99330
293383        WHEN    'WARNING: DIRECTIONAL ADDED -VERIFY'              ROR99330
293384                 MOVE 'W3'           TO WS-ADDR-ERR-TYPE          ROR99330
293385        WHEN    'WARNING: SUFFIX CHANGED -VERIFY'                 ROR99330
293386                 MOVE 'W4'           TO WS-ADDR-ERR-TYPE          ROR99330
293387        WHEN    'WARNING: SUFFIX HAS BEEN ADDED'                  ROR99330
293400                 MOVE 'W5'           TO WS-ADDR-ERR-TYPE          ROR99330
293500        WHEN    'WARNING: MISSING UNIT #'                         ROR99330
293600                 MOVE 'W6'           TO WS-ADDR-ERR-TYPE          ROR99330
293700        WHEN    'ERROR: INVALID UNIT # - VERIFY'                  ROR99330
293800                 MOVE 'W7'           TO WS-ADDR-ERR-TYPE          ROR99330
293801        WHEN    'WARNING: MISSING APT #'                          ROR17111
293802                 MOVE 'W8'           TO WS-ADDR-ERR-TYPE          ROR17111
293803        WHEN    'ERROR: INVALID APT # RANGE-VERIFY'               ROR17111
293804                 MOVE 'W9'           TO WS-ADDR-ERR-TYPE          ROR17111
293900        END-EVALUATE                                              ROR99330
294000     WHEN  'Z'                                                    ROR99330
294100           MOVE 'S'                  TO WS-LU6ORH-ERROR-SW        ROR99330
294200           MOVE 'S6'                 TO WS-ADDR-ERR-TYPE          ROR99330
294300           EVALUATE CUWG1ERR-MSG-RETURNED                         ROR17111
294400             WHEN    'ERROR: INVALID ZIPCODE'                     ROR17111
294500              MOVE 'S6'           TO WS-ADDR-ERR-TYPE             ROR17111
294600             WHEN    'ERROR: ZIP CODE AND CITY NOT FOUND'         ROR17111
294700              MOVE 'SA'          TO WS-ADDR-ERR-TYPE              ROR17111
294701           END-EVALUATE                                           ROR17111
294702*          GO TO S1010-EXIT                                       ROR17111
294703           GO TO S1010-CODE1-EXIT                                 ROR17111
294704     END-EVALUATE.                                                ROR99330
294705*                                                                 ROR99330
294706***************************************************************   ROR99330
294707***************************************************************   ROR99330
294800* IRRESPECTIVE OF VERSION NBR OR OVERRIDE FLAG  ..                ROR99330
294900* ..IF  GROUP1 CHANGES THE  ADDRESS  SEND  BACK A WARNING .."Y"   ROR99330
295000* .. AND MODIFIED ADDRESS..                                       ROR99330
295100* *************************************************************   ROR99330
295200     EVALUATE CUWG1ERR-RETURN-CODE                                ROR99330
295300     WHEN  'Y'                                                    ROR99330
295400         EVALUATE CUWG1ERR-MSG-RETURNED                           ROR99330
295500         WHEN  'SUCCESSFUL ADDRESS MATCH'                         ROR99330
295510         WHEN  'VALID ADDRESS,CANNOT NORMALIZE'                   ROR17111
295600               MOVE CUWG1ERR-GRP1-FIRM   TO WS-SHIP-TO-FIRM-NAME  ROR02318
295700               MOVE CUWG1ERR-ADDR1       TO WS-SHIP-TO-ADDRESS1   ROR99330
295800               MOVE CUWG1ERR-ADDR2       TO WS-SHIP-TO-ADDRESS2   ROR99330
295900               MOVE CUWG1ERR-CITY        TO WS-SHIP-TO-CITY       ROR99330
296000               MOVE CUWG1ERR-STATE       TO WS-SHIP-TO-STATE      ROR99330
296100               MOVE CUWG1ERR-GRP1-USPS-CODE                       TEH00275
296200                                      TO WS-HOLD-USPS-SW          TEH00275
296210               IF CORORH-COMPANY-CODE  = 'MD'                     ABM17279
296300*              INSPECT CUWG1ERR-ZIP REPLACING ALL SPACES BY ZEROS ABM17279
296301                  INSPECT CUWG1ERR-ZIP REPLACING                  ABM17279
296302                                              ALL SPACES BY ZEROS ABM17279
296400                  MOVE CUWG1ERR-ZIP         TO WS-SHIP-TO-ZIP     ABM17279
296500                                               WS-ZIP-CODE        ABM17279
296600               ELSE                                               ABM17279
296700                  MOVE CUWG1ERR-ZIP         TO WS-SHIP-TO-ZIP     ABM17279
296800                                               WS-ZIP-CODEX       ABM17279
296801               END-IF                                             ABM17279
296802         WHEN  'WARNING: ADDR CHANGED - VERIFY'                   ROR99330
296803         WHEN  'WARNING: DIRECTIONAL CHGD -VERIFY'                ROR99330
296804         WHEN  'WARNING: DIRECTIONAL ADDED -VERIFY'               ROR99330
296900         WHEN  'WARNING: SUFFIX CHANGED -VERIFY'                  ROR99330
297000         WHEN  'WARNING: MISSING UNIT #'                          ROR99330
297100         WHEN  'WARNING: SUFFIX HAS BEEN ADDED'                   ROR99330
297110         WHEN  'WARNING: MISSING APT #'                           ROR17111
297200         WHEN  'ERROR: INVALID UNIT # - VERIFY'                   ROR99330
297210         WHEN  'ERROR: INVALID APT # RANGE-VERIFY'                ROR17111
297300               MOVE 'W' TO CORORH-R-RECORD-RESPONSE-FLAG          ROR99330
297310                           WS-R-WARN-FLAG                         ROR06075
297400               MOVE 'Y' TO WS-LU6ORH-WARNING-SW                   ROR99330
297500                           WS-R-WARN-TYPE                         ROR06075
297501               PERFORM S8000-SET-WARNINGS THRU S8000-EXIT         ROR06075
297502               MOVE CUWG1ERR-GRP1-FIRM   TO WS-SHIP-TO-FIRM-NAME  ROR02318
297600               MOVE CUWG1ERR-ADDR1         TO WS-SHIP-TO-ADDRESS1 ROR99330
297700               MOVE CUWG1ERR-ADDR2         TO WS-SHIP-TO-ADDRESS2 ROR99330
297800               MOVE CUWG1ERR-CITY          TO WS-SHIP-TO-CITY     ROR99330
297900               MOVE CUWG1ERR-STATE         TO WS-SHIP-TO-STATE    ROR99330
298000               MOVE CUWG1ERR-GRP1-USPS-CODE                       TEH00275
298100                                      TO WS-HOLD-USPS-SW          TEH00275
298110               IF CORORH-COMPANY-CODE  = 'MD'                     ABM17279
298200*              INSPECT CUWG1ERR-ZIP REPLACING ALL SPACES BY ZEROS ABM17279
298300                  INSPECT CUWG1ERR-ZIP REPLACING                  ABM17279
298301                                              ALL SPACES BY ZEROS ABM17279
298302                  MOVE CUWG1ERR-ZIP           TO WS-SHIP-TO-ZIP   ABM17279
298400                                                 WS-ZIP-CODE      ABM17279
298500               ELSE                                               ABM17279
298600                  MOVE CUWG1ERR-ZIP           TO WS-SHIP-TO-ZIP   ABM17279
298700                                                 WS-ZIP-CODEX     ABM17279
298701               END-IF                                             ABM17279
298702         END-EVALUATE                                             ROR99330
298703     WHEN  'S'                                                    ROR99330
298704         EVALUATE CORORH-ADDRESS-OVERRIDE-FLAG                    ROR99330
298800         WHEN  'Y'                                                ROR99330
298900               MOVE 'W' TO CORORH-R-RECORD-RESPONSE-FLAG          ROR99330
298910                           WS-R-WARN-FLAG                         ROR06075
299000               MOVE 'L' TO WS-LU6ORH-WARNING-SW                   ROR99330
299100                           WS-R-WARN-TYPE                         ROR06075
299101               PERFORM S8000-SET-WARNINGS THRU S8000-EXIT         ROR06075
299102               MOVE CORORH-FIRM-NAME     TO WS-SHIP-TO-FIRM-NAME  ROR02318
299200               MOVE CORORH-SHIP-TO-ADDRESS-1                      ROR99330
299300                                         TO WS-SHIP-TO-ADDRESS1   ROR99330
299400               MOVE CORORH-SHIP-TO-ADDRESS-2                      ROR99330
299500                                         TO WS-SHIP-TO-ADDRESS2   ROR99330
299600               MOVE CORORH-SHIP-TO-CITY  TO WS-SHIP-TO-CITY       ROR99330
299700               MOVE CORORH-SHIP-TO-STATE TO WS-SHIP-TO-STATE      ROR99330
299800               MOVE CUWG1ERR-GRP1-USPS-CODE                       TEH00275
299900                                      TO WS-HOLD-USPS-SW          TEH00275
300000               MOVE CORORH-SHIP-TO-ZIP   TO WS-SHIP-TO-ZIP        ROR99330
300100         WHEN  OTHER                                              ROR99330
300200               MOVE 'S'                  TO WS-LU6ORH-ERROR-SW    ROR99330
300300*              GO TO S1010-EXIT                                   ROR17111
300310               GO TO S1010-CODE1-EXIT                             ROR17111
300400         END-EVALUATE                                             ROR99330
300500     WHEN  'N'                                                    ROR99330
300600           MOVE CORORH-FIRM-NAME       TO WS-SHIP-TO-FIRM-NAME    ROR02318
300700           MOVE CORORH-SHIP-TO-ADDRESS-1                          ROR99330
300800                                       TO WS-SHIP-TO-ADDRESS1     ROR99330
300900           MOVE CORORH-SHIP-TO-ADDRESS-2                          ROR99330
301000                                       TO WS-SHIP-TO-ADDRESS2     ROR99330
301100           MOVE CORORH-SHIP-TO-CITY    TO WS-SHIP-TO-CITY         ROR99330
301200           MOVE CORORH-SHIP-TO-STATE   TO WS-SHIP-TO-STATE        ROR99330
301300           MOVE CORORH-SHIP-TO-ZIP     TO WS-SHIP-TO-ZIP          ROR99330
301310           IF WS-HOLD-USPS-SW  NOT > SPACE                        TEH05195
301400              MOVE CUWG1ERR-GRP1-USPS-CODE                        TEH00275
301500                                      TO WS-HOLD-USPS-SW          TEH00275
301510           END-IF                                                 TEH05195
301600     END-EVALUATE                                                 ROR99330
301700             MOVE CUWG1ERR-GRP1-PO-BOX-IND TO WS-GRP1-PO-BOX-IND  TKC02151
301800             MOVE WS-SHIP-TO-FIRM-NAME TO CORORH-FIRM-NAME        ROR02318
301900             MOVE WS-SHIP-TO-ADDRESS1 TO CORORH-SHIP-TO-ADDRESS-1 ROR99330
302000             MOVE WS-SHIP-TO-ADDRESS2 TO CORORH-SHIP-TO-ADDRESS-2 ROR99330
302100             MOVE WS-SHIP-TO-CITY TO CORORH-SHIP-TO-CITY          ROR99330
302200             MOVE WS-SHIP-TO-STATE TO CORORH-SHIP-TO-STATE        ROR99330
302300                                      ORH-SHIP-TO-STATE           ROR03072
302400             MOVE WS-SHIP-TO-ZIP TO CORORH-SHIP-TO-ZIP.           ROR99330
302500*                                                                 ROR99330
302600*S1010-EXIT.                                                      ROR17111
302700 S1010-CODE1-EXIT.                                                ROR17111
302800*                                                                 ROR17111
302900*S1010-CODE1-BYPASS-CHECK.                                        ROR17111
303000                                                                  ROR17111
303100     EXEC SQL                                                     ROR17111
303200          INCLUDE COD1SUPR                                        ROR17111
303300     END-EXEC.                                                    ROR17111
303301                                                                  ROR17111
303302******************************************************************ROR99330
303303******************************************************************ROR99015
303304* VALIDATE ADDRESSING DATA FROM LINES 1, 2, 4.                   *ROR99015
303305******************************************************************ROR99015
303306 S1020-GROUP1-ADDR-VALIDATION.                                    ROR99015
303307*                                                                 ROR99015
303308     MOVE CORORH-FIRM-NAME         TO CUW-GRP1-FIRM.              ROR02318
303400     MOVE CORORH-SHIP-TO-ADDRESS-1 TO CUW-GRP1-ADDR1.             ROR99015
303500     MOVE CORORH-SHIP-TO-ADDRESS-2 TO CUW-GRP1-ADDR2.             ROR99015
303600     MOVE SPACES  TO CUW-GRP1-ADDR4.                              ROR99015
303700     MOVE CORORH-SHIP-TO-CITY TO CUW-GRP1-CITY.                   ROR99015
303800     MOVE CORORH-SHIP-TO-STATE TO CUW-GRP1-STATE.                 ROR99015
303900     MOVE CORORH-SHIP-TO-ZIP TO CUW-GRP1-ZIP.                     ROR99015
304000*                                                                 ROR99015
304100*    COPY CUSGRP1.                                                ROR17111
304200*                                                                 ROR17111
304300*    EXEC CICS LINK                                               ROR17111
304400*         PROGRAM  ('C1MATCHI')                                   ROR17111
304500*         COMMAREA (CUW-GROUP1)                                   ROR17111
304600*         LENGTH   (CUW-GROUP1-LENGTH)                            ROR17111
304700*           RESP   (WS-EIBRESP)                                   ROR17111
304800*    END-EXEC.                                                    ROR17111
304900*                                                                 ROR17111
305000*    IF  NOT WS-EIB-NORESP                                        ROR17111
305100*        MOVE '300A'             TO WS-ABCODE                     ROR17111
305200*        PERFORM 999-ABEND.                                       ROR17111
305300*                                                                 ROR17111
305400*    MOVE CUW-P9OUT TO P9OUT.                                     ROR17111
305500*                                                                 ROR17111
305600*    COPY CUSG1ERR.                                               ROR17111
305700*                                                                 ROR17111
305800*S1020-EXIT.                                                      ROR17111
305900*                                                                 ROR17111
306000*  IF CORORH-SHIP-TO-ZIP HAS _ WITH IN ,                          ROR17111
306100*   SHOULD WE REPLACE IT WITH SPACES LIKE TELESALES ???           ROR17111
306200*   STILL WAITING FOR CONFIRMATION- B4 TURNING ON CANADA ADDR VAL ROR17111
306300*                                                                 ROR17111
306400     IF TC-USA                                                    ROR17111
306500        PERFORM S1025-CALL-US-CODE1 THRU                          ROR17111
306600                S1025-CALL-US-CODE1-EXIT                          ROR17111
306700     ELSE                                                         ROR17111
306800        IF TC-CANADA                                              ROR17111
306900           PERFORM S1027-CALL-CANADA-CODE1 THRU                   ROR17111
307000                   S1027-CALL-CANADA-CODE1-EXIT                   ROR17111
307100        END-IF                                                    ROR17111
307200     END-IF.                                                      ROR17111
307300                                                                  ROR17111
307400 S1020-EXIT.                                                      ROR17111
307500     EXIT.                                                        ROR17111
307600                                                                  ROR17111
307700*CALLING US CODE1                                                 ROR17111
307800 S1025-CALL-US-CODE1.                                             ROR17111
307801                                                                  ROR17111
307802     COPY CUSGRP1.                                                ROR17111
307803                                                                  ROR17111
307804     EXEC CICS LINK                                               ROR17111
307805          PROGRAM  ('C1MATCHI')                                   ROR17111
307806          COMMAREA (CUW-GROUP1)                                   ROR17111
307807          LENGTH   (CUW-GROUP1-LENGTH)                            ROR17111
307808            RESP   (WS-EIBRESP)                                   ROR17111
307809     END-EXEC.                                                    ROR17111
307810                                                                  ROR17111
307811     IF  NOT WS-EIB-NORESP                                        ROR17111
307812         MOVE '300A'             TO WS-ABCODE                     ROR17111
307813         PERFORM 999-ABEND.                                       ROR17111
307814                                                                  ROR17111
307815     MOVE CUW-P9OUT TO P9OUT.                                     ROR17111
307816                                                                  ROR17111
307817     COPY CUSG1ERR.                                               ROR17111
307818                                                                  ROR17111
307819 S1025-CALL-US-CODE1-EXIT.                                        ROR17111
307820     EXIT.                                                        ROR17111
307830                                                                  ROR17111
307840*CALLING CANADA CODE1                                             ROR17111
307850 S1027-CALL-CANADA-CODE1.                                         ROR17111
307860                                                                  ROR17111
307870     COPY CCAGRP1.                                                ROR17111
307880*                                                                 ROR17111
307890*    THIS SHOULD BE SET HERE.                                     ROR17111
307900     MOVE CORORH-SHIP-TO-ZIP TO MIA-PC                            ROR17111
308000                                                                  ROR17111
308100     EXEC CICS LINK                                               ROR17111
308200          PROGRAM (WS-C6CICSM)                                    ROR17111
308300          COMMAREA (C6MATCH-PARAMETERS)                           ROR17111
308400          LENGTH (WS-LEN-C6PARM)                                  ROR17111
308500          RESP (WS-EIBRESP)                                       ROR17111
308600     END-EXEC.                                                    ROR17111
308700                                                                  ROR17111
308800     IF NOT WS-EIB-NORESP                                         ROR17111
308900        MOVE '301A'             TO WS-ABCODE                      ROR17111
309000        PERFORM 999-ABEND                                         ROR17111
309100     END-IF.                                                      ROR17111
309200                                                                  ROR17111
309300     COPY CCAG1ERR.                                               ROR17111
309400                                                                  ROR17111
309500 S1027-CALL-CANADA-CODE1-EXIT.                                    ROR17111
309600     EXIT.                                                        ROR17111
309700*                                                                 ROR17111
309800*                                                                 ROR17111
309900*CAPTURING CODE1 RESPONSES  WHEN APPLICABLE.                      ROR17111
310000 S1028-GROUP1-CODE-CAPTURE.                                       ROR17111
310100*                                                                 ROR17111
310200*                                                                 ROR17111
310300     IF TC-USA                                                    ROR17111
310400        IF   P9OGRC = LOW-VALUES                                  ROR17111
310500          MOVE SPACES       TO WS-ORHOF-C1-GENERAL-ADDR-RC        ROR17111
310600        ELSE                                                      ROR17111
310700          MOVE P9OGRC       TO WS-ORHOF-C1-GENERAL-ADDR-RC        ROR17111
310800        END-IF                                                    ROR17111
310900        IF   P9OSRC = LOW-VALUES                                  ROR17111
311000          MOVE SPACES       TO WS-ORHOF-C1-SUFFIX-MATCH-RC        ROR17111
311100        ELSE                                                      ROR17111
311200          MOVE P9OSRC       TO WS-ORHOF-C1-SUFFIX-MATCH-RC        ROR17111
311300        END-IF                                                    ROR17111
311400        IF   P9OPRB IS NOT NUMERIC                                ROR17111
311500          MOVE ZERO         TO WS-ORHOF-C1-CORRECTNESS-IND        ROR17111
311600        ELSE                                                      ROR17111
311700          MOVE P9OPRB       TO WS-ORHOF-C1-CORRECTNESS-IND        ROR17111
311800        END-IF                                                    ROR17111
311900        IF   P9ODRC = LOW-VALUES                                  ROR17111
312000          MOVE ZERO         TO WS-ORHOF-C1-DIRECT-MATCH-RC        ROR17111
312100        ELSE                                                      ROR17111
312200          MOVE P9ODRC       TO WS-ORHOF-C1-DIRECT-MATCH-RC        ROR17111
312300        END-IF                                                    ROR17111
312400        IF   P9OARC = LOW-VALUES                                  ROR17111
312500          MOVE ZERO         TO WS-ORHOF-C1-APTMNT-MTCH-RC         ROR17111
312600        ELSE                                                      ROR17111
312700          MOVE P9OARC       TO WS-ORHOF-C1-APTMNT-MTCH-RC         ROR17111
312800        END-IF                                                    ROR17111
312900     ELSE                                                         ROR17111
313000        IF TC-CANADA                                              ROR17111
313100          MOVE MOA-CAN-O-GENERAL-RC                               ROR17111
313200               TO WS-ORHOF-C1-GENERAL-ADDR-RC                     ROR17111
313300          MOVE MOA-CAN-O-STREET-TYPE-RC                           ROR17111
313400               TO WS-ORHOF-C1-SUFFIX-MATCH-RC                     ROR17111
313500          MOVE MOA-CAN-O-OVRLL-PRB-COR-SCR                        ROR17111
313600               TO WS-ORHOF-C1-CORRECTNESS-IND                     ROR17111
313700          MOVE MOA-CAN-O-DIRECTION-RC                             ROR17111
313800               TO WS-ORHOF-C1-DIRECT-MATCH-RC                     ROR17111
313900          MOVE MOA-CAN-O-APT-RC                                   ROR17111
314000               TO WS-ORHOF-C1-APTMNT-MTCH-RC                      ROR17111
314100        END-IF                                                    ROR17111
314200      END-IF.                                                     ROR17111
314300*                                                                 ROR17111
314400 S1028-EXIT.                                                      ROR17111
314500     EXIT.                                                        ROR17111
314600*                                                                 ROR17111
314601*                                                                 ROR17111
314602*---------------------------                                      ROR99330
314603 S1040-APO-FPO-VALIDATION.                                        ROR99330
314604*                                                                 ROR99330
314605******************************************************************ROR99330
314606* VALIDATE STATE AND ZIP  FOR APO-FPO ADDRESS                    *ROR99330
314607******************************************************************ROR99330
314608        MOVE WS-ZIP-CODE         TO  WS-VALID-APO-ZIP             ROR99330
314609        MOVE CORORH-SHIP-TO-STATE TO  WS-VALID-APO-ST             ROR00060
314610        IF WS-VALID-AE-ZIP                                        ROR05307
314611            IF WS-VALID-AE-ST                                     ROR05307
314612                MOVE 'Y'          TO WS-APO-FPO-FLAG              ROR99330
314613                MOVE 'Y'          TO ORSH-EXPORT-ORD-IND          ROR00060
314614            ELSE                                                  ROR05307
314615                MOVE 'S'          TO WS-LU6ORH-ERROR-SW           ROR05307
314616                MOVE 'S6'         TO WS-ADDR-ERR-TYPE             ROR05307
314617        ELSE                                                      ROR05307
314618            IF WS-VALID-AA-ZIP                                    ROR05307
314619                IF WS-VALID-AA-ST                                 ROR05307
314620                    MOVE 'Y'      TO WS-APO-FPO-FLAG              ROR05307
314630                    MOVE 'Y'      TO ORSH-EXPORT-ORD-IND          ROR05307
314640                ELSE                                              ROR05307
314650                    MOVE 'S'      TO WS-LU6ORH-ERROR-SW           ROR05307
314660                    MOVE 'S6'     TO WS-ADDR-ERR-TYPE             ROR05307
314670            ELSE                                                  ROR05307
314680                IF WS-VALID-AP-ZIP                                ROR05307
314690                    IF WS-VALID-AP-ST                             ROR05307
314700                        MOVE 'Y'  TO WS-APO-FPO-FLAG              ROR05307
314800                        MOVE 'Y'  TO ORSH-EXPORT-ORD-IND          ROR05307
314900                    ELSE                                          ROR05307
315000                        MOVE 'S'  TO WS-LU6ORH-ERROR-SW           ROR05307
315001                        MOVE 'S6' TO WS-ADDR-ERR-TYPE.            ROR05307
315002*                                                                 ROR99330
315003 S1040-EXIT.                                                      ROR99330
315004*---------------------------                                      ROR99330
315005*---------------------------                                      ROR99350
315006 S1050-ADDRESS-VERIFY.                                            ROR99350
315007*                                                                 ROR99350
315008****************************************************              ROR99350
315009*PREVENT EXPORT ORDERS FROM GOING THRU GROUP1 (EXCEPT FOR         ROR99350
315010*  STATE CODES ..PR..GU..VI..AA..AP..AE.. ) AND                   ROR99350
315011*..SET A FLAG ON ORSSHH INDICATING THIS AS AN EXPORT ORDER        ROR99350
315012****************************************************              ROR99350
315013*                                                                 ROR99350
315014     MOVE CORORH-SHIP-TO-CNTRY-CODE       TO WS-EXP-ST-CNTRY-CODE.ROR04162
315015     EVALUATE CORORH-SHIP-TO-STATE                                ROR99350
315016     WHEN  'AS'                                                   ROR00175
315017     WHEN  'GU'                                                   ROR99350
315018     WHEN  'MP'                                                   ROR00175
315019     WHEN  'PR'                                                   ROR00175
315020     WHEN  'VI'                                                   ROR99350
315021         EVALUATE WS-EXP-ST-CNTRY-CODE                            ROR00060
315022         WHEN  'US'                                               ROR99350
315023         WHEN  CORORH-SHIP-TO-STATE                               ROR99350
315024               MOVE CORORH-SHIP-TO-STATE  TO WS-EXP-ST-CNTRY-CODE ROR99350
315025               SET ORSH-EXPORT-ORDER      TO TRUE                 ROR00080
315026               SET ITS-SHIP-TO-EXPORT-ORDER TO TRUE               ROR00199
315027         END-EVALUATE                                             ROR99350
315028     END-EVALUATE.                                                ROR99350
315029*                                                                 ROR00060
315030     MOVE WS-EXP-ST-CNTRY-CODE TO WS-CHECK-REGION.                ROR00060
315040     IF WS-US-REGION                                              ROR00060
315041     OR WS-VALID-APO                                              ROR05307
315042         MOVE SPACES                      TO WS-GROUP1-EXPORT-SW  ROR00060
315043     ELSE                                                         ROR00060
315044         MOVE 'Y'                         TO WS-GROUP1-EXPORT-SW  ROR00060
315045     END-IF.                                                      ROR00060
315046*                                                                 ROR99350
315047     EVALUATE WS-EXP-ST-CNTRY-CODE                                ROR99350
315048     WHEN  NOT 'US'                                               ROR99350
315049          IF WS-EXP-ST-CNTRY-CODE NOT EQUAL TO CORORH-COMPANY-CODEROR99350
315050             SET ORSH-EXPORT-ORDER          TO TRUE               ROR00080
315051             SET ITS-SHIP-TO-EXPORT-ORDER   TO TRUE               ROR00199
315052          END-IF                                                  ROR99350
315053     END-EVALUATE.                                                ROR99350
315054*                                                                 ROR00080
315055*                                                                 ROR99350
315056*---------------------------                                      ROR99350
315057 S1050-EXIT. EXIT.                                                ROR99350
315058*---------------------------                                      ROR99350
315059* S1051- WILL BE EXECUTED FOR COUNTRIES OTHER THAN US.            SXG03305
315060*---------------------------                                      SXG03305
315061 S1051-ST-ADD-NON-US.                                             SXG03305
315062*                                                                 SXG03305
315063     EVALUATE CORORH-SHIP-TO-CNTRY-CODE                           SXG03305
315064     WHEN  SPACES                                                 SXG03305
315065     WHEN  LOW-VALUES                                             SXG03305
315066           MOVE CORORH-COMPANY-CODE       TO WS-EXP-ST-CNTRY-CODE SXG03305
315067* THIS MEANS ORDERS ARE PLACED IN NORDIC REGION.                  ROR07030
315068           IF CORORH-COMPANY-CODE = 'SE'                          ROR07030
315069              EVALUATE CORORH-BR-NBR                              ROR07030
315070              WHEN '30'                                           ROR07030
315080                   MOVE 'DK' TO WS-EXP-ST-CNTRY-CODE              ROR07030
315090              WHEN '31'                                           ROR07030
315100                   MOVE 'FI' TO WS-EXP-ST-CNTRY-CODE              ROR07030
315200              WHEN '32'                                           ROR07030
315300                   MOVE 'NO' TO WS-EXP-ST-CNTRY-CODE              ROR07030
315400              END-EVALUATE                                        ROR07030
315401           END-IF                                                 ROR07030
315402     WHEN  OTHER                                                  SXG03305
315403           MOVE CORORH-SHIP-TO-CNTRY-CODE TO WS-EXP-ST-CNTRY-CODE SXG03305
315404     END-EVALUATE.                                                SXG03305
315405*                                                                 SXG03305
315406     IF TB-CO-VAL-EXP-COMPL-OK AND                                ROR04162
315407        (WS-EXP-ST-CNTRY-CODE NOT EQUAL TO CORORH-COMPANY-CODE)   ROR04162
315408         MOVE TC-COMPANY TO TB-CNTRY-CO                           SXG03305
315409         MOVE WS-EXP-ST-CNTRY-CODE TO TB-CNTRY-CODE               SXG03305
315410         CALL 'SYU510' USING TB-CNTRY-TABLE-IA                    SXG03305
315411         IF  NOT TB-DOMESTIC-IN-THIS-REGION                       SXG03305
315412             SET ORSH-EXPORT-ORDER          TO TRUE               SXG03305
315413             SET ITS-SHIP-TO-EXPORT-ORDER   TO TRUE               SXG03305
315414             SET WS-ST-NON-US-EXPORT        TO TRUE               SXG03305
315415         ELSE                                                     SXG03305
315416            SET  WS-NON-EXP-ST-DOMESTIC TO TRUE                   SXG03305
315417         END-IF                                                   SXG03305
315418     END-IF.                                                      ROR04162
315419*                                                                 SXG03305
315500 S1051-EXIT. EXIT.                                                SXG03305
315600*---------------------------                                      SXG03305
315700*---------------------------                                      ROR00080
315800 S1070-GET-BILLTO-ADDRESS-US.                                     SXG03305
315900*                                                                 ROR00080
316000     IF NOT WS-DLI-SCHEDULED                                      SXG03305
316100        PERFORM 980-SCHEDULE-DLI.                                 SXG03305
316200*                                                                 SXG03305
316300     MOVE CORORH-COMPANY-CODE         TO  WS-CUSHED-CO.           SXG03305
316400     MOVE WS-CUST-BR-NBR              TO  WS-CUSHED-BR.           SXG03305
316500     MOVE WS-CUST-NUMBER              TO  WS-CUSHED-CUST.         SXG03305
316600     MOVE WS-CUST-SUFFIX              TO WS-CUSADR-SUFFIX.        SXG03308
316700*                                                                 SXG03305
316800     PERFORM 1002-GU-CUSADR                                       SXG03305
316900*                                                                 SXG03305
317000     IF WS-CUSADR-NORESP AND NOT CUA-ADDR-DELETE                  ROR00080
317100         MOVE CUA-ST-L                TO  WS-EXP-BI-STATE         ROR00080
317200         MOVE CUA-COUNTRY-CODE        TO  WS-EXP-BI-CNTRY         ROR00080
317300     ELSE                                                         ROR00080
317400         GO TO S1070-EXIT                                         ROR00080
317500     END-IF.                                                      ROR00080
317600     EVALUATE WS-EXP-BI-CNTRY                                     ROR00080
317700     WHEN  SPACES                                                 ROR00080
317800     WHEN  LOW-VALUES                                             ROR00080
318000           MOVE TB-CO-VAL-CNTRY-CODE  TO WS-EXP-BI-CNTRY-CODE     ROR04162
318100     WHEN  OTHER                                                  ROR00080
318200           MOVE WS-EXP-BI-CNTRY       TO WS-EXP-BI-CNTRY-CODE     ROR00080
318300     END-EVALUATE.                                                ROR00080
318400                                                                  ROR00080
318500     EVALUATE WS-EXP-BI-STATE                                     ROR00080
318600     WHEN  'AS'                                                   ROR00175
318700     WHEN  'GU'                                                   ROR00080
318800     WHEN  'MP'                                                   ROR00175
318900     WHEN  'PR'                                                   ROR00175
319000     WHEN  'VI'                                                   ROR00080
319100         EVALUATE WS-EXP-BI-CNTRY-CODE                            ROR00080
319200         WHEN  'US'                                               ROR00080
319300               MOVE WS-EXP-BI-STATE       TO WS-EXP-BI-CNTRY-CODE ROR00080
319400*              SET ORSH-EXPORT-ORDER      TO TRUE                 ROR00115
319500               SET ITS-BILL-TO-EXPORT-ORDER  TO TRUE              ROR00199
319600         END-EVALUATE                                             ROR00080
319700     END-EVALUATE.                                                ROR00080
319800                                                                  ROR00080
319900     EVALUATE WS-EXP-BI-CNTRY-CODE                                ROR00080
320000     WHEN NOT 'US'                                                ROR00080
320100         IF WS-EXP-BI-CNTRY-CODE NOT EQUAL TO CORORH-COMPANY-CODE ROR00080
320300            SET ITS-BILL-TO-EXPORT-ORDER   TO TRUE                ROR00199
320400         END-IF                                                   ROR00080
320500     END-EVALUATE.                                                ROR00080
320600 S1070-EXIT. EXIT.                                                ROR00080
320700*---------------------------                                      ROR00080
320800* S1071- WILL BE PERFORMED FOR COUNTRIES OTHER THAN US.           SXG03305
320900* THIS WILL DETERMINE WHETHER IT IS A BILL TO EXPORT ORDER OR NOT.SXG03305
321000*---------------------------                                      SXG03305
321100 S1071-GET-BILLTOEXP-NON-US.                                      SXG03305
321200*                                                                 SXG03305
321300     IF NOT WS-DLI-SCHEDULED                                      SXG03305
321400        PERFORM 980-SCHEDULE-DLI.                                 SXG03305
321500*                                                                 SXG03305
321600     MOVE CORORH-COMPANY-CODE         TO  WS-CUSHED-CO.           SXG03305
321700     MOVE WS-CUST-BR-NBR              TO  WS-CUSHED-BR.           SXG03305
321800     MOVE WS-CUST-NUMBER              TO  WS-CUSHED-CUST.         SXG03305
321900     IF CORORH-SUFFIX = SPACES                                    SXG03305
322000        MOVE '000'                    TO WS-CUSADR-SUFFIX         SXG03305
322100     ELSE                                                         SXG03305
322200        MOVE CORORH-SUFFIX            TO WS-CUSADR-SUFFIX         SXG03305
322300     END-IF.                                                      SXG03305
322400* THIS IS TO MAKE SURE FINAL BILL TO SUFFIX THAT WILL BE SAVED ON NXC17174
322500* THE ORDER IS USED TO GET THE BILL TO SATTE CODE HERE.           NXC17174
322600     IF TB-CPO4-INDIA-GST-PROCESS                                 NXC17174
322700        MOVE WS-CUST-SUFFIX   TO WS-CUSADR-SUFFIX                 NXC17174
322701     END-IF.                                                      NXC17174
322702*                                                                 SXG03305
322703     PERFORM 1002-GU-CUSADR                                       SXG03305
322704*                                                                 SXG03305
322705     IF WS-CUSADR-NORESP AND NOT CUA-ADDR-DELETE                  SXG03305
322800         MOVE CUA-COUNTRY-CODE        TO  WS-EXP-BI-CNTRY         SXG03305
322900         IF CUA-STATE-CODE  GREATER THAN SPACES                   NXC17174
323000            MOVE CUA-STATE-CODE   TO  WS-BT-STATE-CODE            NXC17174
323001         END-IF                                                   NXC17174
323002     ELSE                                                         SXG03305
323003         GO TO S1071-EXIT                                         SXG03305
323100     END-IF.                                                      SXG03305
323200                                                                  SXG03305
323210* HAVE TO MAKE CHANGES HERE RELATED TO NORDIC- PHASE2             ROR07030
323300     EVALUATE WS-EXP-BI-CNTRY                                     SXG03305
323400     WHEN  SPACES                                                 SXG03305
323500     WHEN  LOW-VALUES                                             SXG03305
323600           MOVE CORORH-COMPANY-CODE   TO WS-EXP-BI-CNTRY-CODE     SXG03305
323700     WHEN  OTHER                                                  SXG03305
323800           MOVE WS-EXP-BI-CNTRY       TO WS-EXP-BI-CNTRY-CODE     SXG03305
323900     END-EVALUATE.                                                SXG03305
324000                                                                  SXG03305
324200     IF TB-CO-VAL-EXP-COMPL-OK  AND                               ROR04162
324300        (WS-EXP-BI-CNTRY-CODE NOT EQUAL TO CORORH-COMPANY-CODE)   ROR04162
324400         MOVE TC-COMPANY TO TB-CNTRY-CO                           SXG03305
324500         MOVE WS-EXP-BI-CNTRY-CODE TO TB-CNTRY-CODE               SXG03305
324600         CALL 'SYU510' USING TB-CNTRY-TABLE-IA                    SXG03305
324700         IF  NOT TB-DOMESTIC-IN-THIS-REGION                       SXG03305
324800            SET ITS-BILL-TO-EXPORT-ORDER   TO TRUE                SXG03305
                  IF (TB-CNTRY-CO = 'UK' AND TB-CNTRY-CODE = 'IE')      NXC21023
                      CONTINUE                                          NXC21023
                  ELSE                                                  NXC21023
324900               SET WS-BI-NON-US-EXPORT        TO TRUE             SXG03305
                  END-IF                                                NXC21023
325000         ELSE                                                     SXG03305
325100            SET WS-NON-EXP-BI-DOMESTIC TO TRUE                    SXG03305
325200         END-IF                                                   SXG03305
325300     END-IF.                                                      SXG03305
325400                                                                  SXG03305
325500 S1071-EXIT. EXIT.                                                SXG03305
325600*---------------------------                                      SXG03305
325700*---------------------------                                      ROR00080
325800 S1080-GET-SHIPTO-ADDRESS-US.                                     SXG03305
325900*                                                                 ROR00080
326000     IF WS-CUSADR-NORESP AND NOT CUA-ADDR-DELETE                  ROR00080
326100         MOVE CUA-ST-L                TO  WS-EXP-SI-STATE         ROR00080
326200         MOVE CUA-COUNTRY-CODE        TO  WS-EXP-SI-CNTRY         ROR00080
326300     ELSE                                                         ROR00080
326400         GO TO S1080-EXIT                                         ROR00080
326500     END-IF.                                                      ROR00080
326600     EVALUATE WS-EXP-SI-CNTRY                                     ROR00080
326700     WHEN  SPACES                                                 ROR00080
326800     WHEN  LOW-VALUES                                             ROR00080
327000           MOVE TB-CO-VAL-CNTRY-CODE  TO WS-EXP-SI-CNTRY-CODE     ROR04162
327100     WHEN  OTHER                                                  ROR00080
327200           MOVE WS-EXP-SI-CNTRY       TO WS-EXP-SI-CNTRY-CODE     ROR00080
327300     END-EVALUATE.                                                ROR00080
327400                                                                  ROR00080
327500     EVALUATE WS-EXP-SI-STATE                                     ROR00080
327600     WHEN  'AS'                                                   ROR00175
327700     WHEN  'GU'                                                   ROR00080
327800     WHEN  'MP'                                                   ROR00175
327900     WHEN  'PR'                                                   ROR00175
328000     WHEN  'VI'                                                   ROR00080
328100         EVALUATE WS-EXP-SI-CNTRY-CODE                            ROR00080
328200         WHEN  'US'                                               ROR00080
328300               MOVE WS-EXP-SI-STATE       TO WS-EXP-SI-CNTRY-CODE ROR00080
328400               SET ORSH-EXPORT-ORDER      TO TRUE                 ROR00080
328500               SET ITS-SHIP-TO-EXPORT-ORDER  TO TRUE              ROR00199
328600         END-EVALUATE                                             ROR00080
328700     END-EVALUATE.                                                ROR00080
328800                                                                  ROR00080
328900     EVALUATE WS-EXP-SI-CNTRY-CODE                                ROR00080
329000     WHEN NOT 'US'                                                ROR00080
329100         IF WS-EXP-SI-CNTRY-CODE NOT EQUAL TO CORORH-COMPANY-CODE ROR00080
329200            SET ORSH-EXPORT-ORDER          TO TRUE                ROR00080
329300            SET ITS-SHIP-TO-EXPORT-ORDER   TO TRUE                ROR00199
329310            MOVE WS-EXP-SI-CNTRY-CODE TO CORORH-SHIP-TO-CNTRY-CODEROR05277
329400         END-IF                                                   ROR00080
329500     END-EVALUATE.                                                ROR00080
329600*                                                                 ROR00080
329700 S1080-EXIT. EXIT.                                                ROR00080
329800*---------------------------                                      ROR00080
329900* S1081- WILL BE PERFORMED FOR COUNTIRES OTHER THAN US.           SXG03305
330000 S1081-GET-SHIPTOEXP-NON-US.                                      SXG03305
330100*                                                                 SXG03305
330200     IF WS-CUSADR-NORESP AND NOT CUA-ADDR-DELETE                  SXG03305
330300         MOVE CUA-COUNTRY-CODE        TO  WS-EXP-SI-CNTRY         SXG03305
330400     ELSE                                                         SXG03305
330500         GO TO S1081-EXIT                                         SXG03305
330600     END-IF.                                                      SXG03305
330700*                                                                 SXG03305
330710* HAVE TO MAKE CHANGES HERE RELATED TO NORDIC- PHASE2             ROR07030
330800     EVALUATE WS-EXP-SI-CNTRY                                     SXG03305
330900     WHEN  SPACES                                                 SXG03305
331000     WHEN  LOW-VALUES                                             SXG03305
331100           MOVE CORORH-COMPANY-CODE   TO WS-EXP-SI-CNTRY-CODE     SXG03305
331200     WHEN  OTHER                                                  SXG03305
331300           MOVE WS-EXP-SI-CNTRY       TO WS-EXP-SI-CNTRY-CODE     SXG03305
331400     END-EVALUATE.                                                SXG03305
331500                                                                  SXG03305
331600*    IF WS-EXP-SI-CNTRY-CODE NOT EQUAL TO CORORH-COMPANY-CODE     ROR04162
331700     IF TB-CO-VAL-EXP-COMPL-OK AND                                ROR04162
331800        (WS-EXP-SI-CNTRY-CODE NOT EQUAL TO CORORH-COMPANY-CODE)   ROR04162
331900         MOVE TC-COMPANY TO TB-CNTRY-CO                           SXG03305
332000         MOVE WS-EXP-SI-CNTRY-CODE TO TB-CNTRY-CODE               SXG03305
332100         CALL 'SYU510' USING TB-CNTRY-TABLE-IA                    SXG03305
332200         IF  NOT TB-DOMESTIC-IN-THIS-REGION                       SXG03305
332300            SET ORSH-EXPORT-ORDER          TO TRUE                SXG03305
332400            SET ITS-SHIP-TO-EXPORT-ORDER   TO TRUE                SXG03305
332500         END-IF                                                   SXG03305
332600     END-IF.                                                      SXG03305
332700*                                                                 SXG03305
332800 S1081-EXIT. EXIT.                                                SXG03305
332900*---------------------------                                      SXG03305
333000* IF THE COUNTRY CODE IS CLASSIFIED AS 'E' (EMBARGO) THEN WE      SXG03305
333100* CANNOT ACCEPT THE ORDER                                         SXG03305
333200*---------------------------                                      SXG03305
333300 S1090-DETERMINE-E-CNTRY.                                         SXG03305
333400*                                                                 SXG03305
333500     IF ITS-BILL-TO-EXPORT-ORDER                                  SXG03305
333600        MOVE CUA-COUNTRY-CODE    TO TB-CNTY2-CODE                 SXG03305
333700        MOVE TC-COMPANY          TO TB-CNTY2-CO                   SXG03305
333800        CALL 'SYU510'         USING TB-CNTY2-TABLE-IA             SXG03305
333900        IF TB-CNTY2-NORESP  AND                                   SXG03305
334000          (TB-CNTY2-GROUP-1 = 'E' OR                              SXG03305
334100           TB-CNTY2-GROUP-2 = 'E' OR                              SXG03305
334200           TB-CNTY2-GROUP-3 = 'E' OR                              SXG03305
334300           TB-CNTY2-GROUP-4 = 'E' OR                              SXG03305
334400           TB-CNTY2-GROUP-5 = 'E')                                SXG03305
334500           MOVE 'Y'              TO WS-BILL-TO-E-CNTRY-SW         SXG03305
334600        END-IF                                                    SXG03305
334700     END-IF.                                                      SXG03305
334800                                                                  SXG03305
335100     IF WS-EXP-SHIPTO-CNTRY  > SPACE                              ROR04064
335200        MOVE WS-EXP-SHIPTO-CNTRY TO TB-CNTY2-CODE                 ROR04064
335300        MOVE TC-COMPANY          TO TB-CNTY2-CO                   SXG03305
335400        CALL 'SYU510'         USING TB-CNTY2-TABLE-IA             SXG03305
335500        IF TB-CNTY2-NORESP  AND                                   SXG03305
335600          (TB-CNTY2-GROUP-1 = 'E' OR                              SXG03305
335700           TB-CNTY2-GROUP-2 = 'E' OR                              SXG03305
335800           TB-CNTY2-GROUP-3 = 'E' OR                              SXG03305
335900           TB-CNTY2-GROUP-4 = 'E' OR                              SXG03305
336000           TB-CNTY2-GROUP-5 = 'E')                                SXG03305
336100           MOVE 'Y'              TO WS-SHIP-TO-E-CNTRY-SW         SXG03305
336200        END-IF                                                    SXG03305
336300     END-IF.                                                      SXG03305
336400*                                                                 SXG03305
336500     IF WS-BILL-TO-E-CNTRY OR WS-SHIP-TO-E-CNTRY                  SXG03305
336600           MOVE '0' TO WS-LU6ORH-ERROR-SW                         SXG03305
336700           MOVE 'X3' TO WS-LU6ORH-ERROR-FLAG                      SXG03305
336800     END-IF.                                                      SXG03305
336900*                                                                 SXG03305
337000 S1090-EXIT. EXIT.                                                SXG03305
337100*---------------------                                            SXG03305
337200* EXPORT FULFILLMENT LOGIC. WITH EAGLE PHASE 1, EXPORT FULFILLEMT SXG03305
337300* LOGIC APPLIES ONLY TO US.                                       SXG03305
337400*---------------------                                            SXG03305
337500 S1091-CHK-EXP-FULFILLMENT.                                       SXG03305
337600                                                                  SXG03305
337700      IF WS-EXP-SHIPTO-CNTRY  NOT = WS-EXP-BI-CNTRY-CODE          ROR04064
337800         MOVE TC-COMPANY TO TB-CNTRY-CO                           SXG03305
337900         MOVE WS-EXP-SHIPTO-CNTRY  TO TB-CNTY2-CODE               ROR04064
338000         CALL 'SYU510' USING TB-CNTRY-TABLE-IA                    SXG03305
338100         IF TB-CO-VAL-REGIONAL-COUNTRY AND                        SXG03305
338200            TB-DOMESTIC-IN-THIS-REGION                            SXG03305
338300            NEXT SENTENCE                                         SXG03305
338400         ELSE                                                     SXG03305
338500            MOVE 'Y'             TO WS-EXPORT-FULFILLMENT-SW      SXG03305
338600         END-IF                                                   SXG03305
338700      END-IF.                                                     SXG03305
338800                                                                  SXG03305
338900* SHIP-TO-COUNTRY-CODE                                            SXG03305
339000      IF WS-EXP-SHIPTO-CNTRY   = WS-EXP-BI-CNTRY-CODE             ROR04064
339100         IF CUA-SHIP-TO-SUF                                       SXG03305
339200            IF CU-NAME = CUA-ADD1                                 SXG03305
339300               NEXT SENTENCE                                      SXG03305
339400            ELSE                                                  SXG03305
339500               MOVE 'Y'          TO WS-EXPORT-FULFILLMENT-SW      SXG03305
339600            END-IF                                                SXG03305
339700         ELSE                                                     SXG03305
339800            IF (CU-NAME = WS-SHIP-TO-ADDRESS1)                    SXG03305
339900               NEXT SENTENCE                                      SXG03305
340000            ELSE                                                  SXG03305
340100               MOVE 'Y'          TO WS-EXPORT-FULFILLMENT-SW      SXG03305
340200            END-IF                                                SXG03305
340300         END-IF                                                   SXG03305
340400      END-IF.                                                     SXG03305
340500                                                                  SXG03305
340600      IF WS-EXPORT-FULFILLMENT                                    SXG03305
340700         MOVE WS-EXP-SHIPTO-CNTRY  TO TB-CNTY2-CODE               ROR04064
340800         MOVE TC-COMPANY         TO TB-CNTY2-CO                   SXG03305
340900         CALL 'SYU510' USING TB-CNTY2-TABLE-IA                    SXG03305
341000         IF TB-CNTY2-NORESP  AND                                  SXG03305
341100           (TB-CNTY2-GROUP-1 = 'D' OR                             SXG03305
341200            TB-CNTY2-GROUP-2 = 'D' OR                             SXG03305
341300            TB-CNTY2-GROUP-3 = 'D' OR                             SXG03305
341400            TB-CNTY2-GROUP-4 = 'D' OR                             SXG03305
341500            TB-CNTY2-GROUP-5 = 'D')                               SXG03305
341600            IF CU-EXPORT-FULFILL-D-CNTRY                          SXG03305
341700               NEXT SENTENCE                                      SXG03305
341800            ELSE                                                  SXG03305
341900              MOVE '0'                TO WS-LU6ORH-ERROR-SW       SXG03305
342000              MOVE 'X0'               TO WS-LU6ORH-ERROR-FLAG     SXG03305
342100            END-IF                                                SXG03305
342200         END-IF                                                   SXG03305
342300     END-IF.                                                      SXG03305
342400                                                                  SXG03305
342500 S1091-EXIT.                                                      SXG03305
342600     EXIT.                                                        SXG03305
342700                                                                  SXG03305
342800*---------------------------                                      ROR99330
342900 S1110-VALIDATE-GOVT-TYPES.                                       ROR99330
343000*                                                                 ROR99330
343100       IF CORORH-GOVT-SOLICITATION-NBR  EQUAL  SPACES  OR         ROR00101
343200          CORORH-GOVT-END-USER-DATA     EQUAL  SPACES  OR         ROR00101
343300          CORORH-GOVT-END-USER-ZIP      EQUAL  SPACES             ROR00101
343400           MOVE 'C' TO WS-LU6ORH-ERROR-SW                         ROR00101
343500           GO TO S1110-EXIT                                       ROR00101
343600       END-IF.                                                    ROR00101
343700       MOVE CORORH-COMPANY-CODE                                   ROR99330
343800                        TO TB-PRG-PROGRAM-CO.                     ROR99330
343900       MOVE CORORH-GOVT-PROGRAM-TYPE                              ROR99330
344000                        TO TB-PRG-PROGRAM-TYPE1.                  ROR99330
344100       MOVE CORORH-GOVT-END-USER-TYPE                             ROR99330
344200                        TO TB-PRG-PROGRAM-TYPE2.                  ROR99330
344300       CALL 'SYU510'  USING  TB-PRG-TABLE-IA.                     ROR99330
344400        IF TB-PRG-NORESP                                          ROR99330
344500          MOVE TB-PRG-CUST-SPECIFIC-SW TO WS-CUST-SPECIFIC-SW     ROR99330
344600        ELSE                                                      ROR99330
344700          MOVE 'C' TO WS-LU6ORH-ERROR-SW                          ROR99330
344800          GO TO S1110-EXIT                                        ROR99330
344900        END-IF.                                                   ROR99330
345000*                                                                 ROR99330
345100 S1110-EXIT.    EXIT.                                             ROR99330
345200*                                                                 ROR99330
345300*---------------------------                                      ROR00115
345400*---------------------------                                      ROR00115
345500*                                                                 ROR00115
345600 S1111-VALIDATE-ACOP-GROUP.                                       ROR00115
345700                                                                  ROR00115
345800     MOVE TC-COMPANY                   TO TB-PRG-PROGRAM-CO       ROR00115
345900                                          TB-ACOP-COMPANY-CODE.   ROR00115
346000     MOVE CU-ACOP-GROUP                TO TB-PRG-PROGRAM-TYPE1.   ROR00115
346100     MOVE SPACES                       TO TB-PRG-PROGRAM-TYPE2.   ROR00115
346200                                                                  ROR00115
346300     CALL 'SYU510' USING TB-PRG-TABLE-IA.                         ROR00115
346400                                                                  ROR00115
346500     IF TB-PRG-NORESP                                             ROR00115
346600        MOVE SPACES                    TO TB-ACOP-GENERIC-CODE    ROR00115
346700        MOVE 'B'                       TO TB-ACOP-TYPE-CODE       ROR00115
346800        CALL 'SYU510' USING TB-ACOP-PROC-IA                       ROR00115
346900        IF TB-ACOP-NORESP                                         ROR00115
347000           NEXT SENTENCE                                          ROR00115
347100        ELSE                                                      ROR00115
347200           MOVE 'N'                    TO TB-ACOP-ALLOW-GROUPS-SW ROR00115
347300     ELSE                                                         ROR00115
347400        MOVE 'N'                       TO TB-ACOP-ALLOW-GROUPS-SW.ROR00115
347500                                                                  ROR00115
347600 S1111-EXIT.    EXIT.                                             ROR00115
347700                                                                  ROR00115
347800*                                                                 ROR00199
347900 S1115-VALIDATE-TERMS.                                            ROR00276
348000*                                                                 ROR00276
348100     MOVE TC-COMPANY          TO TB-TERMS-CO                      ROR00276
348200     MOVE CORORH-TERMS        TO TB-TERMS-CODE                    ROR00276
348300     CALL 'SYU510'         USING TB-TERMS-TABLE-AI                ROR00276
348400     IF TB-TERMS-NORESP                                           ROR00276
348500        SET VALID-TERMS-ENTERED TO TRUE                           ROR00276
348600     ELSE                                                         ROR00276
348700        MOVE 'T' TO WS-LU6ORH-ERROR-SW                            ROR00276
348800        GO TO S1115-EXIT                                          ROR00276
348900     END-IF.                                                      ROR00276
349000*                                                                 ROR00276
349100 S1115-EXIT.  EXIT.                                               ROR00276
349200*                                                                 ROR00276
349300*                                                                 ROR00199
349400* THE FOLLOWING ROUTINE WILL ELIMINATE  ALL SPACES AND SPECIAL -  ROR00199
349500*  CHARACTERS  IN THE  ZIP-CODE  FIELD COMMING IN  !!!            ROR00199
349600*                                                                 ROR00199
349700*                                                                 ROR00199
349800 S1120-CHECK-CANADA-ZIP.                                          ROR00199
349900*                                                                 ROR00199
350000     MOVE CORORH-SHIP-TO-ZIP         TO  WS-ZIP-CODE-IN.          ROR00199
350100     MOVE SPACES                     TO  WS-ZIP-CODE-OUT.         ROR00199
350200     MOVE 1                          TO  OUT-SUB.                 ROR00199
350300     PERFORM S1130-CHECK-CANADA-ZIP-CODE THRU S1130-EXIT          ROR00199
350400        VARYING PART-SUB  FROM +1 BY +1                           ROR00199
350500           UNTIL PART-SUB > +9.                                   ROR00199
350600     MOVE WS-ZIP-CODE-OUT            TO  CORORH-SHIP-TO-ZIP.      ROR00199
350700*                                                                 ROR00199
350800 S1120-EXIT.  EXIT.                                               ROR00199
350900*                                                                 ROR00199
351000 S1130-CHECK-CANADA-ZIP-CODE.                                     ROR00199
351100*                                                                 ROR00199
351200     IF  WS-ZIP-IN (PART-SUB) NUMERIC       OR                    ROR00199
351300        (WS-ZIP-IN (PART-SUB) ALPHABETIC    AND                   ROR00199
351400         WS-ZIP-IN (PART-SUB) NOT = SPACES)                       ROR00199
351500         MOVE WS-ZIP-IN (PART-SUB) TO                             ROR00199
351600              WS-ZIP-OUT (OUT-SUB)                                ROR00199
351700         ADD  1  TO  OUT-SUB                                      ROR00199
351800         GO TO S1130-EXIT.                                        ROR00199
351900*                                                                 ROR00199
352000 S1130-EXIT.                                                      ROR00199
352100     EXIT.                                                        ROR00199
352200*                                                                 ROR00199
352201 S1140-AP-SCHEDULED-ORDS.                                         TEH05069
352202                                                                  TEH05069
352203     MOVE 'N'                    TO TB-DMSKU-REQUEST-CODE.        TEH05069
352204     CALL 'SYU510'            USING TB-DMSKU-TABLE-IA.            TEH05069
352205     IF TB-DMSKU-NORESP                                           TEH05069
352206         IF (TB-CPO3-RT-ETA-ALL     OR                            TEH05069
352207            TB-CPO3-RT-ETA-BCK-ONLY) AND                          TEH05069
352208           (TB-CPO3-RT-ETA-DAYS > SPACE)                          TEH05069
352209            COMPUTE WS-FUTURE-PROMISE-DATE =                      TEH05069
352210                EIBDATE + TB-DMSKU-FUTURE-DAYS                    TEH05069
352211            IF WS-FUTURE-PD-DAYS > 365                            TEH05069
352212                ADD 635           TO WS-FUTURE-PROMISE-DATE       TEH05069
352213            END-IF                                                TEH05069
352214            IF WS-PROMISE-DATE1-NUM > WS-FUTURE-PROMISE-DATE      TEH05069
352215                MOVE 'D'         TO WS-LU6ORH-ERROR-SW            TEH05069
352216                MOVE 'UD'        TO WS-LU6ORH-ERROR-FLAG          TEH05069
352217                SET CORORH-R-ERROR-PROMISE-DATE TO TRUE           TEH05069
352218            ELSE                                                  TEH05069
352219                SET WS-SCHEDULED-ORDER      TO TRUE               TEH05069
352220            END-IF                                                TEH05069
352221         ELSE                                                     TEH05069
352222             MOVE 'A'            TO WS-LU6ORH-ERROR-SW            TEH05069
352223             MOVE 'UA'           TO WS-LU6ORH-ERROR-FLAG          TEH05069
352224             SET CORORH-R-ERROR-TABLE-ENTRY TO TRUE               TEH05069
352225         END-IF                                                   TEH05069
352226     ELSE                                                         TEH05069
352227         IF (TB-CPO3-RT-ETA-ALL    OR                             TEH05069
352228             TB-CPO3-RT-ETA-BCK-ONLY) AND                         TEH05069
352229            (TB-CPO3-RT-ETA-DAYS > SPACE)                         TEH05069
352230               MOVE 'A'          TO WS-LU6ORH-ERROR-SW            TEH05069
352231               MOVE 'UA'         TO WS-LU6ORH-ERROR-FLAG          TEH05069
352232               SET CORORH-R-ERROR-TABLE-ENTRY TO TRUE             TEH05069
352233         END-IF                                                   TEH05069
352234     END-IF.                                                      TEH05069
352235                                                                  TEH05069
352236 S1140-EXIT.                                                      TEH05069
352237     EXIT.                                                        TEH05069
352320*                                                                 ROR99015
352400 S1500-WRITE-LUOT-QUEUE.                                                  
352500*                                                                         
352600*---  WRITE LUOT TD QUEUE (LAYOUT CORORH)                         PXP95004
352700*                                                                         
352800     IF CORORH-SYSTEM-ID = 'I' OR 'IM'                            ROR99032
352900        CONTINUE                                                  ROR99032
353000     ELSE                                                         ROR99032
353100     IF CORORH-R-RECORD-WARNING-FOUND                             ROK99015
353200       IF          CORORH-R-ERROR-TYPE = '5'                      ROR99015
353300       OR          CORORH-R-ERROR-TYPE = '8'                      ROR99015
353400       OR          CORORH-R-ERROR-TYPE = 'T'                      ROR99015
353500          MOVE 'W' TO CORORH-R-RECORD-RESPONSE-FLAG               ROR99015
353600          MOVE 'T' TO     CORORH-R-ERROR-TYPE                     ROK99015
353700       ELSE                                                       ROK99015
353800           MOVE SPACES TO CORORH-R-RECORD-RESPONSE-FLAG           ROK99015
353900                          CORORH-R-ERROR-TYPE                     ROK99015
354000     END-IF.                                                      ROK99015
354100     MOVE LENGTH OF CORORH-LU62-ORDER-REQUEST                     PXP95004
354200                                 TO WS-TS-REC-LENGTH.                     
354300     IF LINK-IN                                                   GTH96198
354400     NEXT SENTENCE                                                GTH96198
354500     ELSE                                                         GTH96198
354600*                                                                 GTH96198
354700     EXEC CICS WRITEQ TD                                                  
354800               QUEUE  (WS-TD-QUEUE-LUOT)                                  
354900               FROM   (CORORH-LU62-ORDER-REQUEST)                 PXP95004
355000               LENGTH (WS-TS-REC-LENGTH)                                  
355100               RESP   (WS-EIBRESP)                                        
355200     END-EXEC.                                                            
355300*                                                                         
355400 S2000-GET-CUSTOMER-INFO.                                                 
355500*                                                                         
355600*---  GET CUSTOMER INFORMATION                                            
355700*                                                                         
355800     IF NOT WS-DLI-SCHEDULED                                              
355900         PERFORM 980-SCHEDULE-DLI.                                        
356000*                                                                         
356100     MOVE CORORH-COMPANY-CODE         TO  TC-COMPANY.             PXP95004
356200*                                                                         
356300     MOVE TC-COMPANY                  TO  WS-CUSHED-CO.                   
356400     MOVE WS-CUST-BR-NBR              TO  WS-CUSHED-BR                    
356500                                          WS-CUSBRN-BR.                   
356600     MOVE WS-CUST-NUMBER              TO  WS-CUSHED-CUST.                 
356700     MOVE WS-CUST-SUFFIX              TO  WS-CUSADR-SUFFIX.               
356800*                                                                         
356900     PERFORM 1000-GU-CUSHED.                                      ROR04064
357000*                                                                 ROR04064
357100     IF CU-DELETE OR                                              ROR04064
357200        (NOT WS-CUSHED-NORESP)                                    ROR04064
357300         MOVE   'E'                   TO  WS-LU6ORH-ERROR-SW      ROR04064
357400         GO TO S2000-EXIT                                         ROR04064
357500     END-IF.                                                      ROR04064
357600*                                                                 ROR06117
357700     IF WS-CUSHED-NORESP                                          ROR06117
357900         MOVE '*P'                    TO WS-CUSHED-COMMAND-CODE   TEH04167
358000         MOVE '0'                     TO WS-CUSHEDOF-NBR          TEH04167
358100         PERFORM 1201-GU-CUSHEDOF                                 TEH04167
358200         IF WS-CUSHED-NORESP                                      TEH04167
358300            MOVE CUOF-CUSHEDOF        TO CUOF-CUSHEDOF-0          TEH04167
358400         END-IF                                                   TEH04167
358500         MOVE '*-'                    TO WS-CUSHED-COMMAND-CODE   TEH04167
358600     END-IF.                                                      TEH04167
358700*                                                                 ROR06117
358800* DONT DO INVALID CHAR CHECKING FRO P.O NUMBER FIELD FOR CUST'S   ROR06117
358900*  WHO'S ALLOW LOWERCASE FLAG IS TURNED ON CUSHEDOF.              ROR06117
359000*                                                                 ROR06117
359100     IF CORORH-CUSTOMER-TO-INGRAM-PO > SPACES                     ROR06117
359200        IF CUOF-ORD-CONTAINS-LOWERCASE                            ROR06117
359300           NEXT SENTENCE                                          ROR06117
359400        ELSE                                                      ROR06117
359500           MOVE CORORH-CUSTOMER-TO-INGRAM-PO TO VC-TEXT-AREA      ROR06117
359600           MOVE LENGTH OF CORORH-CUSTOMER-TO-INGRAM-PO            ROR06117
359700                                             TO VC-SUB-MAX        ROR06117
359800           IF CORORH-COMPANY-CODE = 'MD' OR 'UK' OR 'FT'          ROR06117
359900              PERFORM V100-CLEANUP-TEXT THRU V100-EXIT            ROR06117
360000              IF VC-INVLD-CHAR-COUNT > 0                          ROR06117
360100                 MOVE 'H'         TO  WS-LU6ORH-ERROR-SW          ROR06117
360200                 GO TO S2000-EXIT                                 ROR06117
360300              END-IF                                              ROR06117
360400           END-IF                                                 ROR06117
360500        END-IF                                                    ROR06117
360501     END-IF.                                                      ROR06117
360502*                                                                 ROR04064
360503* IF CUST SPECIFIC GOVT TYPES ARE SENT,EXECUTE BELOW LOGIC.       ROR04064
360504*                                                                 ROR04064
360505     IF TC-USA       AND                                          ROR04064
360506        WS-CUST-SPECIFIC-SW  EQUAL 'Y'                            ROR04064
360507        IF CU-CUSMSC-ACOP-SEG-COUNT NUMERIC  AND                  ROR04064
360508           CU-CUSMSC-ACOP-SEG-COUNT > ZEROES                      ROR04064
360509           PERFORM S2100-CHECK-CUST-SPEC-GOVT-TYP THRU S2100-EXIT ROR04064
360510           IF NOT WS-LU6ORH-ERROR-ALL-OK                          ROR04064
360511              GO TO S2000-EXIT                                    ROR04064
360512           END-IF                                                 ROR04064
360513        ELSE                                                      ROR04064
360514           MOVE 'C' TO WS-LU6ORH-ERROR-SW                         ROR04064
360515           GO TO S2000-EXIT                                       ROR04064
360516        END-IF                                                    ROR04064
360517     END-IF.                                                      ROR04064
360518*                                                                 ROR04064
360519     PERFORM 1004-GU-CUSBRN.                                      ROR04064
360520     IF WS-CUSBRN-NORESP                                          ROR04064
360530        IF CUB-EU-SELECTSOURCE                                    ROR06110
360540        AND TC-LATIN-AM-COMPANY                                   ROR06110
360550        AND CORORH-SS-RESELLER NOT > SPACES                       ROR06110
360560            MOVE '4'            TO WS-LU6ORH-ERROR-SW             ROR06110
360570            MOVE 'S4'           TO WS-LU6ORH-ERROR-FLAG           ROR06110
360580            SET CORORH-R-ERROR-RESELLER-MISS    TO TRUE           ROR06110
360590            GO TO S2000-EXIT                                      ROR06110
360591        END-IF                                                    ROR06110
360600        PERFORM 1002-GU-CUSADR                                    ROR04064
360700        IF WS-CUSADR-NOTFND OR CUA-ADDR-DELETE                    ROR04064
360800           MOVE 'E'               TO  WS-LU6ORH-ERROR-SW          ROR04064
360900           GO TO S2000-EXIT                                       ROR04064
361000        END-IF                                                    ROR04064
361100     ELSE                                                         ROR04064
361200        MOVE 'E'                  TO  WS-LU6ORH-ERROR-SW          ROR04064
361300        GO TO S2000-EXIT                                          ROR04064
361400     END-IF.                                                      ROR04064
361500                                                                  ROR99135
361600* FIX FOR EAGLE PROJECT!.                                         ROR04064
361700     IF  WS-LU6ORH-ERROR-ALL-OK AND                               ROR04064
361800         WS-SHIP-TO-ADDRESS                                       ROR04064
361900         IF TC-USA                                                ROR04064
362000            PERFORM S1050-ADDRESS-VERIFY THRU S1050-EXIT          ROR04064
362100         ELSE                                                     ROR04064
362200*           IF TB-CO-VAL-EXP-COMPL-OK                             ROR04162
362300               PERFORM S1051-ST-ADD-NON-US  THRU S1051-EXIT       ROR04064
362400*           END-IF                                                ROR04162
362500         END-IF                                                   ROR04064
362600     END-IF.                                                      ROR04064
362700*                                                                 ROR04064
362800*                                                                 ROR01068
362900     IF WS-LU6ORH-ERROR-ALL-OK                                    ROR01068
363000        IF CUA-DEF-CARRIER GREATER THAN SPACES                    ROR01068
363100           MOVE CUA-DEF-CARRIER       TO WS-BT-DEF-CAR            ROR01068
363200        END-IF                                                    ROR01068
363300        IF CUA-ALT-DEF-CAR GREATER THAN SPACES                    ROR01068
363400           MOVE CUA-ALT-DEF-CAR       TO WS-BT-ALT-DEF-CAR        ROR01068
363500        END-IF                                                    ROR01068
363600        IF CUA-DEF-OUT-FRT-CODE GREATER THAN SPACE                ROR01068
363700           MOVE CUA-DEF-OUT-FRT-CODE  TO WS-BT-FRT-OUT-CODE       ROR01068
363800        END-IF                                                    ROR01068
363900** IF NO BILL-TO-SUFFIX & ONLY  SHIP-TO-SUFFIX ..                 ROR01116
364000**        WS-CAPS-ID-CODE  WILL HAVE VALUE OF SHIP-TO-SUFFIX !!   ROR01116
364100        IF CUA-CAPS-ID-CODE GREATER THAN SPACES                   ROR01116
364200           MOVE CUA-CAPS-ID-CODE      TO WS-CAPS-ID-CODE          ROR01116
364300        END-IF                                                    ROR01116
364400     END-IF.                                                      ROR01068
364500                                                                  ROR00080
364600     MOVE CUB-PRTY-CODE TO  ORH-PRIORITY-CODE.                    ROR99135
364700     IF CUB-TERMS NUMERIC                                         TEH00245
364800         MOVE CUB-TERMS        TO WS-TERMS.                       TEH00245
364900     IF CORORH-PRIORITY-CODE > SPACES                             ROR99135
365000        IF CORORH-VALID-PRIORITY-CODE                             ROR99135
365100         MOVE CORORH-PRIORITY-CODE TO ORH-PRIORITY-CODE           ROR99135
365200        ELSE                                                      ROR99135
365300         MOVE  'C'             TO  WS-LU6ORH-ERROR-SW             ROR99135
365400         MOVE  'UC'            TO WS-LU6ORH-ERROR-FLAG            ROR99135
365410         SET CORORH-R-ERROR-PRIORITY-CODE    TO TRUE              TEH05069
365600     END-IF.                                                      ROR99135
      *----DPAS LOGIC - CAPTURE DPAS-PRIORITY-CODE-----*                BYA21100
           IF CORORH-DPAS-CODE > SPACES AND                             BYA21100
              TB-CPO7-DPAS-COMPANY-SW = 'Y'                             BYA21100
              MOVE WS-ORH-PRIORITY-CODE  TO  ORH-PRIORITY-CODE          BYA21100
           END-IF.                                                      BYA21100
365700*                                                                 ROR99330
365800 S2000-EXIT.    EXIT.                                             ROR99330
365900*                                                                 ROR99330
366000*                                                                 ROR99330
366100 S2100-CHECK-CUST-SPEC-GOVT-TYP.                                  ROR04064
366200*                                                                 ROR99330
366300     MOVE LOW-VALUES        TO  WS-CUSMSC-KEY-VALUE.              ROR04064
366400     MOVE 'P'               TO  WS-CUM-SEG-TYPE.                  ROR04064
366500     MOVE CORORH-GOVT-TYPES TO  WS-CUM-KEY.                       ROR04064
366600     PERFORM 1066-GNP-CUSMSC.                                     ROR04064
366700     IF NOT WS-CUSMSC-NORESP                                      ROR04064
366800        MOVE 'C' TO WS-LU6ORH-ERROR-SW                            ROR04064
366900        GO TO S2100-EXIT                                          ROR04064
367000     END-IF.                                                      ROR04064
367100*                                                                 ROR99330
367200 S2100-EXIT.    EXIT.                                             ROR99330
367300*                                                                 ROR99330
367400*--------------------------------------------------------------*  ROR04064
367500 S2500-EDIT-CUST-PO-NBR.                                          ROR04064
367600*--------------------------------------------------------------*  ROR04064
367700*    SEARCH FOR THE CUSTOMER P.O. ON THE ORDER DATABASE        *  ROR04064
367800*    OR OCCURRING IN THE PAST 60 DAYS IN INVOICE HISTORY.      *  ROR04064
367900*--- FOR EAI AND PCG REQUEST,DUPLICATE PO CHECK BEHAVES IN     *  DXB16281
367901*--- IN SIMILAR WAY                                            *  DXB16281
370500*    IF THE ORDER CREATED IN IMPULSE EXCEEDS THE TIMEOUT LIMIT *  KXD19278
370500*    SET IN EAI/SEEBURGER, THEN IT CREATES INCOMPLETE ORDERS   *  KXD19278
370500*    WITH ORDER HEADER ONLY. HERE WE ARE CHECKING IF ORDER NUM *  KXD19278
370500*    IS SENT BACK BY ORP329, WHICH WOULD INDICATE THAT ORDER IS*  KXD19278
370500*    INCOMPLETE DUE TO TIMEOUT. INTRODUCING NEW ERROR CODE     *  KXD19278
370500*    'EI' FOR THIS CASE.                                       *  KXD19278
367902*--------------------------------------------------------------*  ROR04064
368000                                                                  ROR04064
368100     MOVE WS-CUST-BR-NBR            TO  TC-BR-NBR                 ROR04064
368200     MOVE WS-CUST-NUMBER            TO  TC-CUST-NBR               ROR04064
368300     MOVE WS-CUST-SUFFIX            TO  TC-CUST-SUFFIX            ROR04064
368400     MOVE CORORH-CUSTOMER-TO-INGRAM-PO                            ROR04064
368500                                    TO  TC-CUST-PO-NBR            ROR04064
370500     MOVE 'ORP971'                  TO  TC-MAP-PROGRAM-ID         KXD19278
368600     MOVE +60                       TO  SUB                       ROR04064
368700     MOVE 'ORP329'                  TO  WS-SUBROUTINE             ROR04064
368800                                                                  ROR04064
368900     CALL WS-SUBROUTINE          USING  DFHEIBLK                  ROR04064
369000                                        TC-SYXCOM                 ROR04064
369100                                        ORPCB-CUST-ORDER-PTR      ROR04064
369200                                        SUB                       ROR04064
369300                                        WS-ERROR-SW               ROR04064
369310                                                                          
369400                                                                  ROR04064
369500     EVALUATE TRUE                                                ROR04064
369600        WHEN WS-ERROR-FOUND                                       ROR04064
369700             IF CUB-CHECK-CUST-PO-IL-WARN                         ROR06075
369800             OR (CUB-CHECK-CUST-PO           AND                  ROR08283
369900                 (WS-TERM-ID-FROM-WEB-ENDEAVOUR OR                ROR15254
370000                  WS-FROM-SUBSTATION))                            ROR15254
370100                EVALUATE CORORH-DUP-PO-SW                         ROR08283
370200                  WHEN 'O'                                        ROR08283
370300                    CONTINUE                                      ROR08283
370400                  WHEN 'C'                                        ROR08283
370500                    IF TC-ORDER-NBR GREATER THAN SPACES AND       KXD19278
370500                       TC-ORDER-BR-NBR GREATER THAN SPACES AND    KXD19278
                             CORORH-FROM-XML-ONLY AND                   KXD19278
                             CUB-CHECK-CUST-PO-RESENT                   KXD19278
370500                       MOVE 'I'         TO  WS-LU6ORH-ERROR-SW    KXD19278
370600                       MOVE 'EI'        TO  WS-LU6ORH-ERROR-FLAG  KXD19278
370600                    ELSE                                          KXD19278
370500                       MOVE 'M'         TO  WS-LU6ORH-ERROR-SW    KXD19278
370600                       MOVE 'EM'        TO  WS-LU6ORH-ERROR-FLAG  KXD19278
                          END-IF                                        KXD19278
370700                  WHEN 'E'                                        DXB16281
370800                    IF NOT CUB-CHECK-CUST-PO-IL-WARN OR           KXD19305
370800                       NOT  CORORH-FROM-POWER-APPL                KXD19305
370500                       IF TC-ORDER-NBR GREATER THAN SPACES AND    KXD19278
370500                          TC-ORDER-BR-NBR GREATER THAN SPACES AND KXD19278
                                CORORH-FROM-XML-ONLY AND                KXD19278
                                CUB-CHECK-CUST-PO-RESENT                KXD19278
370500                          MOVE 'I'      TO  WS-LU6ORH-ERROR-SW    KXD19278
370600                          MOVE 'EI'     TO  WS-LU6ORH-ERROR-FLAG  KXD19278
370600                       ELSE                                       KXD19278
370900                          MOVE 'M'      TO  WS-LU6ORH-ERROR-SW    KXD19278
371000                          MOVE 'EM'     TO  WS-LU6ORH-ERROR-FLAG  KXD19278
                             END-IF                                     KXD19278
371100                    ELSE                                          DXB16281
371200                       MOVE 'A'             TO WS-R-WARN-FLAG     DXB16281
371300                       MOVE '1'             TO WS-R-WARN-TYPE     DXB16281
371400                       PERFORM S8000-SET-WARNINGS THRU S8000-EXIT DXB16281
371500                       MOVE '#'          TO WS-LU6ORH-WARNING-SW  DXB16281
371600                    END-IF                                        DXB16281
371700                  WHEN OTHER                                      ROR08283
371800                    MOVE 'A'             TO WS-R-WARN-FLAG        ROR06075
371900                    MOVE '1'             TO WS-R-WARN-TYPE        ROR06075
372000                    PERFORM S8000-SET-WARNINGS THRU S8000-EXIT    ROR06075
372100                    MOVE '#'             TO WS-LU6ORH-WARNING-SW  ROR06075
372200                END-EVALUATE                                      ROR08283
372201             ELSE                                                 ROR06075
370500                IF TC-ORDER-NBR GREATER THAN SPACES AND           KXD19278
370500                   TC-ORDER-BR-NBR GREATER THAN SPACES AND        KXD19278
                         CORORH-FROM-XML-ONLY AND                       KXD19278
                         CUB-CHECK-CUST-PO-RESENT                       KXD19278
370500                   MOVE 'I'            TO  WS-LU6ORH-ERROR-SW     KXD19278
370600                   MOVE 'EI'           TO  WS-LU6ORH-ERROR-FLAG   KXD19278
370600                ELSE                                              KXD19278
372202                   MOVE 'M'            TO  WS-LU6ORH-ERROR-SW     KXD19278
372203                   MOVE 'EM'           TO  WS-LU6ORH-ERROR-FLAG   KXD19278
                      END-IF                                            KXD19278
372204             END-IF                                               ROR06075
372205        WHEN WS-NO-ERROR-FOUND                                    ROR04064
372206             CONTINUE                                             ROR04064
372207        WHEN OTHER                                                ROR04064
372208             IF CUB-CHECK-CUST-PO-IL-WARN                         ROR06075
372209             OR (CUB-CHECK-CUST-PO            AND                 ROR08283
372210                 (WS-TERM-ID-FROM-WEB-ENDEAVOUR OR                ROR15254
372220                  WS-FROM-SUBSTATION))                            ROR15254
372230                EVALUATE CORORH-DUP-PO-SW                         ROR08283
372240                  WHEN 'O'                                        ROR08283
372250                    CONTINUE                                      ROR08283
372260                  WHEN 'C'                                        ROR08283
372270                    MOVE '3'            TO  WS-LU6ORH-ERROR-SW    ROR08283
372280                    SET WS-ERROR-FOUND  TO  TRUE                  ROR08283
372290                    PERFORM S1000-SET-ERRORS THRU S1000-EXIT      ROR08283
372300                    PERFORM S7000-END-THE-ORDER                   ROR08283
372400                  WHEN 'E'                                        DXB16281
372500                    IF NOT CUB-CHECK-CUST-PO-IL-WARN OR           KXD19305
370800                       NOT  CORORH-FROM-POWER-APPL                KXD19305
372600                       MOVE '3'            TO  WS-LU6ORH-ERROR-SW DXB16281
372700                       SET WS-ERROR-FOUND  TO  TRUE               DXB16281
372800                       PERFORM S1000-SET-ERRORS THRU S1000-EXIT   DXB16281
372900                       PERFORM S7000-END-THE-ORDER                DXB16281
373000                    ELSE                                          DXB16281
373100                       MOVE 'A'             TO WS-R-WARN-FLAG     DXB16281
373200                       MOVE '2'             TO WS-R-WARN-TYPE     DXB16281
373300                       PERFORM S8000-SET-WARNINGS THRU S8000-EXIT DXB16281
373400                       MOVE '#'          TO WS-LU6ORH-WARNING-SW  DXB16281
373500                    END-IF                                        DXB16281
373600                  WHEN OTHER                                      ROR08283
373700                    MOVE 'A'             TO WS-R-WARN-FLAG        ROR06075
373800                    MOVE '2'             TO WS-R-WARN-TYPE        ROR06075
373900                    PERFORM S8000-SET-WARNINGS THRU S8000-EXIT    ROR06075
374000                    MOVE '#'             TO WS-LU6ORH-WARNING-SW  ROR06075
374100                END-EVALUATE                                      ROR08283
374101             ELSE                                                 ROR06075
374102                MOVE '3'            TO  WS-LU6ORH-ERROR-SW        ROR04064
374103                SET WS-ERROR-FOUND  TO  TRUE                      ROR04064
374104                PERFORM S1000-SET-ERRORS THRU S1000-EXIT          ROR04064
374105                PERFORM S7000-END-THE-ORDER                       ROR04064
374106             END-IF                                               ROR06075
374107     END-EVALUATE.                                                ROR04064
374108*                                                                 ROR04064
374109 S2500-EXIT.                                                      ROR04064
374110     EXIT.                                                        DXO99330
374111*                                                                 MCV95136
374112 S3400-PROCESS-SHIP-TO-SUFFIX.                                    ROR02128
374113*                                                                 ROR02128
374114     IF WS-READ-SHIP-TO                                           SXK96332
374115        NEXT SENTENCE                                             SXK96332
374116     ELSE                                                         SXK96332
374117         MOVE CORORH-BR-NBR           TO  WS-CUST-BR-NBR          SXK96332
374118                                          WS-CUSHED-BR            SXK96332
374119         MOVE CORORH-CUST-NBR         TO  WS-CUST-NUMBER          SXK96332
374120                                          WS-CUSHED-CUST          SXK96332
374121                                                                  MCV95136
374122         MOVE CORORH-SHIP-TO-SUFFIX   TO  CUA-SUFFIX              MCV95136
374123                                          WS-CUSADR-SUFFIX        MCV95136
374124                                          WS-CUST-SUFFIX          SXK96332
374125         IF CUA-SHIP-TO-SUF                                       MCV95136
374126            PERFORM 1002-GU-CUSADR                                MCV95136
374127            IF WS-CUSADR-NOTFND OR CUA-ADDR-DELETE                MCV95136
374128               MOVE 'S'               TO  WS-LU6ORH-ERROR-SW      MCV95136
374129            END-IF                                                MCV95136
374130         ELSE                                                     MCV95136
374131            MOVE 'S'                  TO  WS-LU6ORH-ERROR-SW.     MCV95136
374132                                                                  MCV95136
374133     IF WS-LU6ORH-ERROR-ALL-OK                                    MCV95136
374134        MOVE CORORH-SHIP-TO-SUFFIX    TO  ORH-SHIP-TO-SUFFIX      MCV95136
374135        IF ORH-COMPANY EQUAL 'UK'                                 TEH04076
374136           MOVE CUA-ZIP-L             TO ORH-POSTAL-CODES         TEH04076
374137        ELSE                                                      TEH04076
374138           MOVE CUA-POSTAL-CODES      TO ORH-POSTAL-CODES         MCV95136
374139        END-IF                                                    TEH04076
374140        IF CUA-TAX-CODE > SPACES                                  MCV95136
374141           MOVE CUA-STATE-CODE        TO  ORH-STATE-CODE          MCV95136
374142           MOVE CUA-COUNTY-CODE       TO  ORH-COUNTY-CODE         MCV95136
374200           MOVE CUA-CITY-CODE         TO  ORH-CITY-CODE           MCV95136
374300           MOVE CUA-TAX-CODE          TO  ORH-TAX-CODE            MCV95136
374400        END-IF.                                                   SXK96133
374500*                                                                 ROR00080
374600     IF WS-LU6ORH-ERROR-ALL-OK                                    TEH00275
374700        IF NOT ITS-SHIP-TO-EXPORT-ORDER                           TEH00275
374800           MOVE CUA-USPS-FIRM-CODE  TO WS-HOLD-USPS-SW            TEH00275
374900        END-IF                                                    TEH00275
375000     END-IF.                                                      TEH00275
375100*                                                                 ROR00080
375200 S3400-EXIT.    EXIT.                                             ROR02128
375300*------------------------------                                   ROR00080
375400*------------------------------                                   ROR00080
375500 S3500-CHECK-BASERATE.                                            ROR02128
375600*                                                                 ROR00080
375700     MOVE CORORH-CUSTOMER-KEY(3:8)         TO WS-CHECK-CUSTOMER.  ROR01088
375800*                                                                 ROR01088
375900     IF LINK-IN   AND                                             ROR00080
376000        (TB-CPO-BASE-RATE-ORDER-SW = 'T' OR 'Y')                  ROR00080
376100        EVALUATE CORORH-SYSTEM-ID                                 ROR00080
376200        WHEN 'IM'                                                 ROR00080
376300             EVALUATE WS-CHECK-CUSTOMER                           ROR00080
376400             WHEN '10121306'                                      ROR00080
376500             WHEN '10187856'                                      ROR00080
376600             WHEN '10291886'                                      ROR00080
376700             WHEN '10350786'                                      ROR00080
376800             WHEN '10653970'                                      ROR00080
377100             WHEN '10032734'                                      TEH00234
377200             WHEN '23032734'                                      TEH00234
377300             WHEN '10111720'                                      TEH00245
377400             WHEN '23111720'                                      TEH00245
377500             WHEN '41123611'                                      ROR02297
377600             WHEN '41123641'                                      ROR02297
377700             WHEN '41123681'                                      ROR02297
377800             WHEN '41123701'                                      ROR02297
377900             WHEN '41123721'                                      ROR02297
378000             WHEN '41123731'                                      ROR02297
378100             WHEN '41123741'                                      ROR02297
378200             WHEN '41127261'                                      ROR02297
378300             WHEN '41127271'                                      ROR02297
378400             WHEN '41165301'                                      ROR02297
378500             WHEN '41479946'                                      ROR02297
378600             WHEN '41385356'                                      TEH00259
378700             WHEN '41545546'                                      ROR03016
378800             WHEN '10190216'                                      ROR00080
378900             WHEN '11086930'                                      TEH02164
379000             WHEN '11035486'                                      TEH02164
379100             WHEN '15137030'                                      ROR00213
379200             WHEN '60937690'                                      ROR00213
379300             WHEN '60016437'                                      ROR00213
379400             WHEN '20222222'                                      ROR00080
379500             WHEN '20246226'                                      FVB00151
379600             WHEN '30012150'                                      ROR00080
379700             WHEN '30001374'                                      ROR00080
379800             WHEN '30162431'                                      ROR01129
379900             WHEN '30203680'                                      ROR00080
380000             WHEN '30240416'                                      ROR00080
380100             WHEN '30240426'                                      ROR00080
380200             WHEN '30240446'                                      ROR00080
380300             WHEN '30274346'                                      ROR01129
380400             WHEN '30308396'                                      ROR00215
380500             WHEN '30571296'                                      ROR01129
380600             WHEN '30581496'                                      ROR01129
380700             WHEN '30574436'                                      TEH02015
380800             WHEN '40041483'                                      ROR01088
380900             WHEN '40114680'                                      ROR00080
381000             WHEN '40317756'                                      TKC01268
381100             WHEN '50077506'                                      ROR01051
381200             WHEN '50201786'                                      ROR01051
381300             WHEN '50228806'                                      ROR00080
381400             WHEN '50228836'                                      ROR00080
381500             WHEN '50274426'                                      TEH02151
381600             WHEN '50323096'                                      ROR00080
381700             WHEN '50444746'                                      ROR00175
381800             WHEN '50752640'                                      ROR00080
381900             WHEN '60410810'                                      ROR00080
382000             WHEN '60122046'                                      ROR00080
382100             WHEN '60188220'                                      ROR00080
382200             WHEN '70008721'                                      ROR00140
382300             WHEN '70680640'                                      ROR00080
382400             WHEN '70350596'                                      ROR00080
382500             WHEN '70354656'                                      ROR00080
382600             WHEN '72110946'                                      ROR01129
382700             WHEN '72160701'                                      ROR01129
382800             WHEN '72160721'                                      ROR01129
382900             WHEN '72432126'                                      FVB00151
383000                  MOVE 'Y'         TO ORH-BASE-RATE-ORDER-SW      RYD18278
383100             END-EVALUATE                                         ROR00080
383200             IF WS-SARCOM                                         TEH05046
383400                 MOVE 'Y'          TO ORH-BASE-RATE-ORDER-SW      RYD18278
383500             END-IF                                               ROR00080
383600             IF CUB-END-USER-SW = 'A'                             TEH00325
383700                 MOVE 'Y'          TO ORH-BASE-RATE-ORDER-SW      RYD18278
383800             END-IF                                               TEH00325
383900        WHEN 'I '                                                 ROR00080
384000             IF CORORH-TERM-ID (1:3) = 'WEB'  OR                  FXS17203
                      CORORH-TERM-ID       = 'HERM' OR                  RP122238
                     (CORORH-TERM-ID       = 'XVFC' AND                 RP122238
                      CORORH-OPER-ID       = 'HERM')                    RP122238
384100                 MOVE 'Y'          TO ORH-BASE-RATE-ORDER-SW      RYD18278
384200             END-IF                                               ROR00080
384300        WHEN 'N '                                                 ROR00080
384400        WHEN 'AS'                                                 ROR00276
384500             MOVE 'Y'              TO ORH-BASE-RATE-ORDER-SW      RYD18278
384600        END-EVALUATE                                              ROR00080
384700        IF WS-HOLD-ON-ERROR                                       ROR05277
384800           IF WS-CARR-WAS-ENTERED OR                              ROR01316
384900              WS-HOLD-ON-ERROR-TYPE GREATER THAN SPACES           ROR05277
385000              MOVE 'N'        TO ORH-BASE-RATE-ORDER-SW           ROR01316
385100           ELSE                                                   ROR01316
385200              MOVE 'Y'        TO ORH-BASE-RATE-ORDER-SW           ROR01316
385300           END-IF                                                 ROR01316
385400        END-IF                                                    ROR01316
385500        IF ORSH-EXPORT-ORDER             OR                       ROR00080
385600           ORH-AGENCY-ORDER-HANDLE       OR                       TEH00259
385700           (CORORH-DIRECT-SHIP  = 'Y'                             PKV09260
385710           AND NOT TB-CPO5-DIRECT-FREIGHT-CALC2)                  PKV09260
385800           MOVE 'N'           TO ORH-BASE-RATE-ORDER-SW           ROR00080
385900        ELSE                                                      TKC02151
386000           IF (WS-AIRBORNE-GROUND OR WS-AIRBORNE-AIR)             TKC02151
386100           AND NOT WS-HOLD-ON-ERROR                               ROR05277
386200           AND NOT ORH-BASE-RATE-ORDER                            TKC02151
386300               MOVE 'Y'            TO ORH-BASE-RATE-ORDER-SW      RYD18278
386400               SET WS-WARN-BASERATE-ON   TO TRUE                  TKC02151
386500               MOVE 'W'                  TO WS-R-WARN-FLAG        ROR06075
386600               MOVE 'K'                  TO WS-R-WARN-TYPE        ROR06075
386601               PERFORM S8000-SET-WARNINGS THRU S8000-EXIT         ROR06075
386602           END-IF                                                 TKC02151
386603        END-IF                                                    ROR00080
386700     END-IF.                                                      ROR00080
386800                                                                  ROR00080
386900        IF NOT ORH-BASE-RATE-ORDER AND                            SXG03059
387000              (WS-NON-STD-FLAG = 'Y')                             SXG03059
387100           MOVE 'Y'                TO ORH-BASE-RATE-ORDER-SW      RYD18278
387200        END-IF.                                                   SXG03059
387300                                                                  SXG03059
387400        IF CORORH-SHIP-VIA-CARRIER-CODE   > SPACES AND            FVB00151
387500           CORORH-THIRD-PARTY-FRT-ACCOUNT > SPACES                FVB00151
387600             EVALUATE WS-CHECK-CUSTOMER                           FVB00151
387700             WHEN '20246226'                                      FVB00151
387800             WHEN '23023798'                                      ROR01051
387900             WHEN '40023798'                                      ROR01051
388000             WHEN '41126421'                                      ROR01088
388100             WHEN '50346906'                                      ROR01316
388200             WHEN '50370606'                                      ROR01316
388300**           WHEN '50309856'                                      FVB00151
388400             WHEN '72432126'                                      FVB00151
388500               MOVE 'N'       TO ORH-BASE-RATE-ORDER-SW           FVB00151
388600             END-EVALUATE                                         FVB00151
388700        END-IF.                                                   FVB00151
388800*                                                                 ROR00080
388900 S3500-EXIT.    EXIT.                                             ROR02128
389000*--------------------------                                       ROR00080
389100*------------------------------                                   ROR00080
389200 S3510-CHECK-BASERATE.                                            ROR02128
389300*                                                                 ROR00080
389400     MOVE CORORH-CUSTOMER-KEY(3:8) TO WS-CHECK-CUSTOMER.          ROR00347
389500     IF LINK-IN   AND                                             ROR00080
389600        (TB-CPO-BASE-RATE-ORDER-SW = 'T' OR 'Y')                  ROR00080
389700         MOVE 'Y'                  TO ORH-BASE-RATE-ORDER-SW      RYD18278
389800     END-IF.                                                      ROR00080
389900*                                                                 ROR00347
390000     IF TC-CANADA                                                 ROR00347
390100        EVALUATE WS-CHECK-CUSTOMER                                ROR00347
390200        WHEN '10577640'                                           ROR00347
390300        WHEN '40598500'                                           ROR00347
390400        WHEN '40024496'                                           ROR03016
390500        WHEN '40024506'                                           ROR03016
390600           MOVE 'N'           TO ORH-BASE-RATE-ORDER-SW           ROR00347
390700        END-EVALUATE                                              ROR00347
390800     END-IF.                                                      ROR00347
390900*                                                                 ROR00080
391000 S3510-EXIT.    EXIT.                                             ROR02128
391100*                                                                         
       S3515-READ-SYLTAX-FILE.                                          VYP20304
      *----------------------------------------------------------------*VYP20304
                                                                        VYP20304
           MOVE WS-SYTX-MAXLEN     TO WS-SYTX-REC-LENGTH.               VYP20304
                                                                        VYP20304
           EXEC CICS READ                                               VYP20304
                FILE   (WS-SYTX-FILE-NAME)                              VYP20304
                INTO   (SYTX-SYRTAX)                                    VYP20304
                LENGTH (WS-SYTX-REC-LENGTH)                             VYP20304
                RIDFLD (WS-SYTX-RECORD-KEY)                             VYP20304
                RESP   (WS-EIBRESP)                                     VYP20304
                END-EXEC.                                               VYP20304
                                                                        VYP20304
           IF WS-EIB-NORESP                                             VYP20304
              MOVE 'Y'                 TO  WS-SYTX-IO-SW                VYP20304
           ELSE                                                         VYP20304
              MOVE 'N'                 TO  WS-SYTX-IO-SW                VYP20304
           END-IF.                                                      VYP20304
                                                                        VYP20304
       S3515-EXIT.                                                      VYP20304
             EXIT.                                                      VYP20304
391200 S3000-UPDATE-ORDER-HEADER.                                       ROR04094
391300*                                                                 ROR04064
391400*   BELOW CODE USED TO BE OUTSIDE S0050-.                         ROR04064
391500*    MOVED IT IN HERE,SO ITS MORE STRUCTURED IN THE BEGINING.     ROR04064
391600*                                                                 ROR04064
391700*  ADDED THIS HERE AS WE WANT TO SET ORSH-CARRIER-SW CORRECTLY    ROR04216
391800*  TB-CUSXP-NORESP  -->  WE  FOUND ENTRY IN THE TABLE.            ROR04216
391900*   SO ,WE SHOULDNT SET CARRIER SW.                               ROR04216
392000*  WE READ TBXCUSXP TABLE ONLY FOR,                               ROR04216
392100*   SHIPTO EXPORT ORDERS PLACED IN U.S WITH NO CARRIER SPECIFIED. ROR04216
392200*  SO , THIS LOGIC WILL NOT AFFECT REGULAR ORDERS ,               ROR04216
392300*   AS TB-CUSXP-NORESP WILL ALWAYS BE FALSE FOR  REGULAR ORDERS.  ROR04216
392400*                                                                 ROR04216
392500*    IF CORORH-SHIP-VIA-CARRIER-CODE > SPACES                     ROR04216
392600     IF CORORH-SHIP-VIA-CARRIER-CODE > SPACES AND                 ROR04216
392700        (NOT TB-CUSXP-NORESP)                                     ROR04216
392800        IF (CORORH-SHIP-VIA-CARRIER-CODE NOT =                    ROR04064
392900             WS-DEFAULT-CARRIER)                                  ROR04064
393000            MOVE 'Y' TO ORSH-CARRIER-SW                           ROR04064
393100        ELSE                                                      ROR04064
393200            IF (WS-CARR-WAS-ENTERED AND                           ROR04064
393300                WS-USE-FRM)                                       ROR04064
393400                MOVE 'Y'     TO ORSH-CARRIER-SW                   ROR04064
393500            ELSE                                                  ROR04064
393600                IF WS-CO-DEFAULT-CARRIER = 'N' AND                ROR04064
393700                   WS-USE-FRM                                     ROR04064
393800                   MOVE 'D' TO ORSH-CARRIER-SW                    ROR04064
393900                END-IF                                            ROR04064
394000            END-IF                                                ROR04064
394100        END-IF                                                    ROR04064
394200     END-IF.                                                      ROR04064
394300*                                                                 ROR04064
394400* LU6A . LU6B , LU6C , LU6D , LU6E , LU6F , LU6G , LU6L , LU62    ROR02073
394500*  ARE BEING USED  TILL NOW FOR INSIDELINE TRANSACTIONS.          ROR02073
394510*  LU6G , LU6H - STORE FRONTS.ONLY THEY CAN USE THIS TERM-ID.     ROR05118
394520*  IF ANY ONE ELSE SENDS IN THIS ID , WE WILL CHANGE IT TO LU62.  ROR05083
394600*--------------------------------------------------------         ROR02073
394700     EVALUATE CORORH-SYSTEM-ID                                    ROR00199
394800     WHEN  'N '                                                   ROR00199
394900           MOVE  'CNFG'             TO ORH-TERM-ID                ROR00199
395000     WHEN  'I '                                                   ROR00199
395100     WHEN  'AV'                                                   ROR00326
395200           IF CORORH-TERM-ID GREATER THAN SPACES                  ROR00199
395300              MOVE CORORH-TERM-ID   TO ORH-TERM-ID                ROR00199
395400           ELSE                                                   ROR00199
395500              MOVE 'WEBO'           TO ORH-TERM-ID                ROR00199
395600           END-IF                                                 ROR00199
395700     WHEN  'AC'                                                   ROR00199
395800           IF CORORH-TERM-ID GREATER THAN SPACES                  ROR00199
395900              MOVE CORORH-TERM-ID   TO ORH-TERM-ID                ROR00199
396000           ELSE                                                   ROR00199
396100              MOVE 'WEBC'           TO ORH-TERM-ID                ROR00199
396200           END-IF                                                 ROR00199
396300     WHEN  'AS'                                                   ROR00199
396400           MOVE  'LU6A'             TO ORH-TERM-ID                ROR00199
396500     WHEN  OTHER                                                  ROR00199
396600* COMING FROM CRM OR STORE FRONTS--> LEAVE WHAT EVER THEY SEND IN.ROR06318
396700* COMING FROM SUBSTATION         --> LEAVE WHAT EVER THEY SEND IN.ROR08283
396800           IF (WS-TERM-ID-CHG-OK AND                              ROR08283
396900               WS-FROM-SUBSTATION)                                ROR10293
397000           OR CORORH-PASSTHRU-PROGRAM                             ROR10293
397100           OR ITS-A-SAP-ACCT                                      ROR10293
397200              MOVE CORORH-TERM-ID TO ORH-TERM-ID                  ROR06318
397300           ELSE                                                   ROR06318
397400* STOREFRONT TERM-ID'S COMING IN FROM NON-STORE FRONTS!           ROR06318
397500              IF CORORH-FROM-STOREFRONT                           ROR06318
397600                 MOVE 'LU62'      TO ORH-TERM-ID                  ROR06318
397700              ELSE                                                ROR06318
397800                 IF CORORH-TERM-ID (1:3) = 'LU6'                  ROR06318
397900                    MOVE CORORH-TERM-ID TO ORH-TERM-ID            ROR06318
398000                 ELSE                                             ROR06318
398100* TRANSACTIONS COMING IN WITH NON INSIDELINE TERM-ID FORMAT       ROR06318
398200                    MOVE 'LU62'   TO ORH-TERM-ID                  ROR06318
398300                 END-IF                                           ROR06318
398400              END-IF                                              ROR06318
398401           END-IF                                                 ROR06318
398402     END-EVALUATE.                                                ROR00199
398403*                                                                 ROR11194
398404*  EUCM SMALL ENHANCEMENT.                                        ROR11194
398405*  TO ALLOW THEM TO PASS IN DIFF VALUES FOR TERM-ID .             ROR11194
398406*                                                                 ROR11194
398407     IF WS-FROM-SUBSTATION AND                                    ROR11194
398408        (ORH-TERM-ID EQUAL 'EUCM') AND                            ROR11194
398409        (CORORH-ALT-TERM-ID GREATER THAN SPACES)                  ROR11194
398410         MOVE CORORH-ALT-TERM-ID TO ORH-TERM-ID                   ROR11194
398420         MOVE 'E'                TO ORH-AUCTION-BLOCK-FLAG        ROR11194
398430     END-IF.                                                      ROR11194
398440*                                                                 ROR11194
398441     MOVE CORORH-BUYER-ID             TO ORH-CAPS-BUYER.          ROR05307
398442     MOVE  1                          TO  ORH-LAST-DIST-NBR               
398443                                          ORH-LAST-SHIPMENT-NBR.  ROR09308
398444*                                                                 ROR09308
398445* ADDED THIS ABOVE MOVE TO PREVENT EDI MAPS FROM FAILING          ROR09308
398446*  BECAUSE OF FAILED READ IN EDP150 FOR ADOBE LICENSING ORDERS.   ROR09308
398447*  WE HAVE THIS EQUIVALENT MOVE IN EDI/TELESALES ORDER ENTRY.     ROR09308
398448*                                                                         
398449     IF CU-IM-ONLINE                                              RMF95226
398450        MOVE 'M'                      TO  ORH-ENTRY-METHOD        RMF95226
398451     ELSE                                                         RMF95226
398452        MOVE 'L'                      TO  ORH-ENTRY-METHOD.       RMF95226
398453*                                                                 RMF95226
398454     IF CU-WAIVE-MIN-ORD-SW = 'Y'                                         
398455     OR (CORORH-WAIVE-MINORD-FEE EQUAL 'Y')                       PKV09266
398500        MOVE 'W'                      TO  ORH-HANDLING-CHRG-SW.           
398600*                                                                         
398700* DBL PROJECT ##                                                  ROR09195
398800*    EVEN IF CUSTOMER IS FLAGGED IN SUCH A WAY THAT MIN ORD FEE   ROR09195
398900*      SHOULD BE WAIVED.....                                      ROR09195
399000*     IF ITS A DBL CUSTOMER FLAGGED COMING IN WITH DROPSHIP ADDR  ROR09195
399100*      THEN..  MIN ORDER FEE SHOULD NOT BE WAIVED.                ROR09195
399200*   DBL ACCOUNT #                                                 ROR09195
399300*     CU-SALES-OPS(21) = 'D' + CU-SALES-OPS(22) = 'B' +           ROR09195
399400*     CU-SALES-OPS(23) = 'L'                                      ROR09195
399500*                                                                 ROR09195
399600*                                                                 ROR09195
399700*  DBL WANT THIS SEPCIAL LOGIC TO BE REMOVED.                     ROR10307
399800*  NA OTC SE LB# 14078 DBL WEB AUTO MIN ORDER FEE LOGIC           ROR10307
399900*                                                                 ROR10307
400000*       IF  CU-SALES-OPS(21)     = 'D'                            ROR10307
400100*       AND CU-SALES-OPS(22)     = 'B'                            ROR10307
400200*       AND CU-SALES-OPS(23)     = 'L'                            ROR10307
400300*       AND (WS-DROPSHIP-MD-SW EQUAL 'Y')                         ROR10307
400400*           MOVE SPACE                 TO  ORH-HANDLING-CHRG-SW   ROR10307
400500*       END-IF.                                                   ROR10307
400501*                                                                 ROR09195
400502     MOVE 'Y'                         TO  ORH-IN-PROGRESS-SW.             
400503     MOVE 'Y'                         TO  ORH-PRICE-RECALC-SW.    ROR00215
400504     MOVE 'Y'                       TO  ORH-GWMD-IMAG-APPLY-FLAG. LLS95293
400505     MOVE 1.00                        TO  ORH-CURRENCY-RATE.              
400506     IF CORORH-SIMULATED-ORDER-SW = 'Y'                           TEH17279
400507        MOVE 'B'                      TO ORH-BID-QUOTE-FLAG       TEH17279
400508        MOVE +15001                   TO ORH-BID-EXPIRE-DATE      TEH17307
400509     END-IF.                                                      TEH17279
400510*    IF (ORH-TERM-ID    = 'WEBO' OR 'WEBA')                       PKV10174
           IF (ORH-TERM-ID   =  'WEBO' OR 'WEBA' OR 'WEB2' OR 'HERM' OR RP122238
                               (ORH-TERM-ID = 'XVFC' AND                RP122238
                                CORORH-OPER-ID = 'HERM'))               RP122238
400512       COMPUTE WS-CREDIT-BAL = (CU-CURR + CU-AGE-1 + CU-AGE-2 +   ROR99145
400513                         CU-AGE-3 + CU-AGE-4 + CU-AGE-5 +         ROR99145
400514                         CU-AGE-6)                                ROR99145
400515       COMPUTE CORORH-R-CREDIT-BAL = CU-CR-LIMIT - WS-CREDIT-BAL  ROR99145
400516     END-IF.                                                      ROR99145
400517*                                                                 ROR99145
400518     MOVE TC-COMPANY                  TO  ORH-COMPANY.                    
400519     MOVE WS-CUST-BR-NBR              TO  ORH-BR-NBR                      
400520                                          ORH-BILL-TO-NBR.                
400521*                                                                         
400522     MOVE CORORH-CUSTOMER-TO-INGRAM-PO TO ORH-CUST-ORDER-NBR.     PXP95004
400523     MOVE CORORH-CUST-TO-ELCOM-PO      TO  ORH-CUST-REF-NBR.      PXP95004
400524     MOVE CORORH-USER-NAME             TO  ORH-USER-NAME.         RMF95229
           MOVE CORORH-CUST-REF-NBR2         TO  ORH-CUST-REF-NBR2.     KXA24187
400530*                                                                 ROR00060
400600*  WE  REDEFINED ORH-END-CUST-ID AND  R USING  FOR DIFF PURPOSES  ROR00060
400700*  SO..IF ANY VALUE COMES IN THIS FIELD,WE DONT CARE FOR NON WEBP ROR00060
400800*  AS.,ORH-END-CUST-ID IS USED ONLY BY PRIME-ACCESS...            ROR00060
400900*                                                                 ROR00060
401000     IF CORORH-TERM-ID EQUAL 'WEBP'                               ROR00060
401100        MOVE CORORH-END-CUST-ID        TO  ORH-END-CUST-ID        ROR00060
401200        MOVE CORORH-END-CUST-NUM       TO  ORH-END-CUST-NUM       ROR00060
401300     END-IF.                                                      ROR00060
401400*                                                                 ROR00060
401401     IF ITS-A-SAP-ACCT                                            DAK11308
401402        MOVE CORORH-END-CUST-NUM       TO  ORH-END-CUST-NUM       DAK11308
401403     END-IF.                                                      DAK11308
401500*                                                                 ROR00326
401600     IF CORORH-BYPASS-AUTH-FLAG EQUAL 'Z'                         ROR00326
401700        SET ORH-BYPASS-AUTH-ORDER      TO  TRUE                   ROR00326
401800     END-IF.                                                      ROR00326
401900*                                                                 ROR00326
402000*                                                                         
402100     IF CORORH-GOVT-TYPES NOT = SPACES                            ROR99135
402200        AND  TC-USA                                               ROR00326
402300       PERFORM S3100-GOV-LOGIC THRU S3100-GOV-LOGIC-EXIT          ROR99015
402400     ELSE                                                         ROR99015
402500       NEXT SENTENCE                                              ROR99015
402600     END-IF.                                                      ROR99015
402700*                                                                 ROR99135
402800*                                                                         
402900         IF NOT WS-LU6ORH-ERROR-ALL-OK                            ROR99330
403000            GO TO S3000-EXIT                                      ROR99330
403100         END-IF                                                   ROR99330
403200*                                                                 ROR16303
403300* THIS INDICATOR WILL HELP GOVT INFO FROM BEING VIEWED BY         ROR16303
403400*  NON AUTHORIZED USERS.                                          ROR16303
403500* WE SET ORH-GOVT-GSA-IND TO NEW VALUE HERE ,                     ROR16303
403600*  ONLY IF ITS NOT ALREADY SET WITH A VALUE B4 IN GOVT LOGIC.     ROR16303
403700*                                                                 ROR16303
403800     IF TC-USA AND                                                ROR16303
403900        CUOF-GOV-CUSTOMER AND                                     ROR16303
404000        ORH-GOVT-GSA-IND NOT GREATER THAN SPACE                   ROR16303
404100        MOVE 'H' TO ORH-GOVT-GSA-IND                              ROR16303
404101     END-IF.                                                      ROR16303
404102*                                                                         
404103*                                                                 ROR00115
404104*===>  IF THE CUSTOMER HAS AN ACOP GROUP SET, ENSURE THAT IT      ROR00115
404105*===>  IS STILL VALID, AND THE THE COMPANY STILL ALLOWS THEM.     ROR00115
404106*===>  SET ORH-NON-GOVT-PROGRAM-TYPE   WHICH IS USED IN ORP673    ROR00115
404107*===>    BEFORE  GOING IN TO ACOP ROUTINES FOR NON-GOVT ORDERS !! ROR00115
404108*                                                                 ROR00115
404109     IF WS-LU6ORH-ERROR-ALL-OK                                    ROR00115
404110        IF CU-ACOP-GROUP > SPACES  AND                            ROR00115
404120           NOT ORH-GOVERNMENT-ORDER                               ROR00115
404200           PERFORM S1111-VALIDATE-ACOP-GROUP  THRU S1111-EXIT     ROR00115
404300           IF TB-ACOP-ALLOW-GROUPS                                ROR00115
404400              MOVE CU-ACOP-GROUP   TO  ORH-NON-GOVT-PROGRAM-TYPE. ROR00115
404500                                                                  ROR00115
404600*                                                                 MCV95335
404700     IF ORH-CONFIGURATION-ORDER                                   MCV94145
404800        SET ORH-DO-NOT-SPLIT                                      MCV94312
404900            ORH-SERIAL-NBR-REQ        TO  TRUE                    MCV94312
405000     ELSE                                                         MCV94145
405100        MOVE CORORH-SS-SPLIT-SHIP-FLAG                            PXP95004
405200                                      TO  ORH-SPLIT-SW.           MCV94145
405700                                                                  ROR99350
405800********* SET SPLIT SHIPMENT FLAG TO 'N' ON ORSHED            **  ROR99350
405900*****                    FOR CONSOLIDATED SHIPMENTS       *****   ROR99350
406000        IF CORORH-BCK-CONSOLIDATED-SHPMNT                         ROR99350
406100           SET  ORH-DO-NOT-SPLIT TO TRUE                          ROR99350
406200        END-IF.                                                   ROR99350
406300*                                                                         
406400     MOVE WS-CUST-NUMBER              TO  ORH-BILL-TO-CUST-NBR.           
406500     MOVE WS-CUST-SUFFIX              TO  ORH-BILL-TO-SUFFIX.             
406600     MOVE WS-CAPS-ID-CODE             TO  ORH-CAPS-ID-CODE.       ROR01116
406700     MOVE CUA-TAX-CODE                TO  ORH-TAX-CODE.                   
406800     MOVE CUB-ACK-CODE                TO  ORH-ACK-CODE.                   
406900     MOVE CUB-COPY-CODE               TO  ORH-COPY-CODE.                  
407000     MOVE CUA-STATE-CODE              TO  ORH-STATE-CODE.                 
407100     MOVE CUA-COUNTY-CODE             TO  ORH-COUNTY-CODE.                
407200     MOVE CUA-CITY-CODE               TO  ORH-CITY-CODE.                  
407300* CHECK WHETHER THE CUSTOMER IS BLOCKED FROM ORDERING DUE TO GST  NXC17174
407400* LOCK.                                                           NXC17174
407500     IF TB-CPO4-INDIA-GST-PROCESS                                 NXC17174
407600       IF TC-COMPANY = ('IA' OR 'LK' OR 'BI')                     NXC17174
407700          MOVE TC-COMPANY  TO TB-INT-COMPANY-CODE                 NXC17174
407800          MOVE WS-BT-STATE-CODE    TO TB-INT-STATE-CODE           NXC17174
407900          CALL 'SYU510'     USING TB-INT-TABLE-IA                 NXC17174
408000          IF TB-INT-NORESP             AND                        NXC17174
408100             TB-INT-GST-APPLY-SW = 'Y'                            NXC17174
408200             PERFORM S3200-CHECK-CUSTOMER-GST-LOCK                NXC17174
408300                                              THRU S3200-EXIT     NXC17174
408400          END-IF                                                  NXC17174
408500       END-IF                                                     NXC17174
408600     END-IF.                                                      NXC17174
408700*                                                                 NXC17174
408800     IF NOT WS-LU6ORH-ERROR-ALL-OK                                NXC17174
408900        GO TO S3000-EXIT                                          NXC17174
409000     END-IF                                                       NXC17174
409100*COPIED THE BELOW COMMENTED LOGIC TO S0050- PARA, AS WE  NEED     ROR05314
409200* DEFAULT TERMS BEFORE  DOING SECURITY/TERMS VALIDATION.          ROR05314
409201*                                                                 ROR05314
409202*                                                                         
409203     IF ORH-FLOOR-SUF                                             MCV94181
409204        MOVE WS-FLOOR-TERMS           TO  ORH-TERMS               MCV94181
409205     ELSE                                                         MCV94181
409206        MOVE CUB-TERMS                TO  ORH-TERMS.              MCV94181
409207*                                                                         
409208*********OPEN UP THE COD TERMS FLAG FOR EVERY ONE !!!         **  ROR00276
409209        IF VALID-TERMS-ENTERED                                    ROR00276
409210           MOVE CORORH-TERMS          TO  ORH-TERMS               ROR00276
409211        ELSE                                                      ROR00276
409212           IF CORORH-COD-TERM                                     ROR00276
409213              MOVE +000               TO  ORH-TERMS               ROR00276
409214           END-IF                                                 ROR00276
409215        END-IF.                                                   ROR00276
409216*                                                                 ROR00276
409700     IF LINK-IN                     AND                           ROR04064
409800        CORORH-FREIGHT-FORWARDER GREATER THAN SPACES              ROR04064
      *       IF (CORORH-INTERNET  AND                                  TZM22231
      *           CORORH-TERM-ID(1:3) = 'WEB' ) OR                      TZM22231
      *          (CORORH-TERM-ID      = 'HERM'  AND                     TZM22231
      *          (TC-USA AND CORORH-BR-NBR = '17')) OR                  TZM22231
      *           WS-FRT-FWD-CHG-OK             OR                      TZM22231
      *          (CORORH-PASSTHRU-PROGRAM AND                           TZM22231
      *           CORORH-FROM-STOREFRONT)                               TZM22231
              IF TB-IL-FRT-FWD-ALLOW OR                                 TZM22231
                ((CORORH-TERM-ID      = 'HERM'  OR                      RP122238
                 (CORORH-TERM-ID      = 'XVFC'  AND                     RP122238
                  CORORH-OPER-ID      = 'HERM')) AND                    RP122238
                 (TC-USA AND CORORH-BR-NBR = '17'))                     TZM22231
410104           MOVE TC-COMPANY               TO                       ROR05167
410105                       WS-FFRMST-KEY (1:2)                        ROR05167
410106           MOVE CORORH-FREIGHT-FORWARDER TO                       ROR05167
410107                       WS-FFRMST-KEY (3:3)                        ROR05167
410108           PERFORM P030-CHECK-FRT-FORWARDER THRU P030-EXIT        ROR05167
410109           IF WS-FFRMST-NORESP                                    ROR05167
410110              IF ACTIVE-FFR                                       ROR05167
410120                 MOVE CORORH-FREIGHT-FORWARDER TO                 ROR05167
410200                      ORH-FREIGHT-FORWARDER                       ROR05167
410300              ELSE                                                ROR05167
410400                 MOVE 'B'              TO  WS-LU6ORH-ERROR-SW     ROR05167
410500                 MOVE 'GB'             TO  WS-LU6ORH-ERROR-FLAG   ROR05167
410600                 SET CORORH-R-ERR-INACTIVE-FFWDR     TO TRUE      ROR05167
410700              END-IF                                              ROR05167
410800           ELSE                                                   ROR05167
410900              MOVE 'A'                 TO  WS-LU6ORH-ERROR-SW     ROR05167
411000              MOVE 'GA'                TO  WS-LU6ORH-ERROR-FLAG   ROR05167
411100              SET CORORH-R-ERR-INVALID-FFWDR      TO TRUE         ROR05167
411101           END-IF                                                 ROR05167
411102        END-IF                                                    ROR04064
411103     END-IF.                                                      ROR04064
411104*                                                                 ROR04064
411105     IF NOT WS-LU6ORH-ERROR-ALL-OK                                ROR05167
411106        GO TO S3000-EXIT                                          ROR05167
411107     END-IF.                                                      ROR05167
411108                                                                          
411109* CHANGE FOR  SELECT SOURCE********************                   ROR99145
411110* NOTE THAT AT THIS POINT, THE SELECT SOURCE END USER NUMBER      TEH00234
411200* IS IN THE CORORH-BR-NBR AND CORORH-CUST-NBR FIELDS WHILE THE    TEH00234
411300* RESELLER NUMBER IS IN THE CORORH-SS-RESELLER FIELD.             TEH00234
411400     MOVE CUB-END-USER-SW          TO  ORH-END-USER-ORDER-SW.     ROR99145
411500     IF CORORH-SS-RESELLER GREATER THAN SPACES                    TEH00234
411600        MOVE CORORH-SS-RESELLER    TO  ORH-RESELLER-NBR (1:8)     TEH00234
411700        MOVE CORORH-SS-RESELLER-SUF     TO ORH-RESELLER-NBR (9:3) TEH00234
411800     END-IF.                                                      ROR00217
411900     MOVE CUB-REPORT-SWITCHES         TO  ORH-REPORT-SWITCHES.            
412000*                                                                 ROR18278
412100*    OPEN UP THIS FEATURE OF IS SALES MAN OVERRIDE FOR IM360.     ROR18278
412200*        88  CORORH-ALLOW-UPD-IS-SALESMAN     VALUE 'WEBL'        ROR18278
412300*            'LU6G' 'LU6H' 'LACM' 'EUCM' 'ITRK' 'PRSM' 'GSSW'     ROR18278
      *            'G360' 'GRPA' 'IMC1'.                                PYN22112
412401*                                                                 ROR18278
412402*                                                                 ROR05167
      *    IF CORORH-ALLOW-UPD-IS-SALESMAN AND                          TZM22231
           IF TB-IL-ALLOW-UPD-IS-SALESMAN  AND                          TZM22231
412404        CORORH-CUST-INTERNAL-SALESMAN GREATER THAN SPACES         ROR00326
412405        MOVE CORORH-CUST-INTERNAL-SALESMAN                        ROR00326
412406                                      TO  ORH-IS-SALESMAN         ROR00326
412407     ELSE                                                         ROR00326
412500        IF CORORH-SYSTEM-ID = 'N' AND                             ROR00326
412600           CORORH-TERM-ID GREATER THAN SPACES                     ROR00326
412700           MOVE CORORH-TERM-ID        TO  ORH-IS-SALESMAN         ROR00326
412800        ELSE                                                      ROR00326
412900           MOVE CUB-IS-SALESMAN (1)   TO  ORH-IS-SALESMAN.        ROR00326
413000     MOVE CUB-OS-SALESMAN (1)         TO  ORH-OS-SALESMAN.                
413100* NO SECURITY NEEDED.                                             ROR05314
413200     IF CORORH-OS-SALESMAN  > SPACES                              ROR05314
413201        MOVE CORORH-OS-SALESMAN       TO  ORH-OS-SALESMAN.        ROR05314
413202     MOVE CU-SORT-CODE                TO  ORH-SHORT-CUST-NAME.            
413203     MOVE CU-BUSINESS-TYPE            TO  ORH-CU-BUSINESS-TYPE.   MXK94284
413300     MOVE CU-CUST-TYPE                TO  ORH-CUST-TYPE.                  
413400     MOVE CU-ALLIANCE-SW              TO  ORH-ALLIANCE-SW         MCV94235
413500     MOVE CUB-ORDER-MANAGEMENT-SW     TO  ORH-ORDER-MANAGEMENT-SW.CMI94341
413600     MOVE CU-EDI-CO                   TO  ORH-EDI-CO.                     
413700     MOVE CU-PRICE-CODE               TO  ORH-PRICE-CODE.                 
413800     MOVE CU-CURRENCY-CODE            TO  ORH-CURRENCY-CODE.              
413900**                                                                ROR10293
414000** PAN EURO PROJECT.                                              ROR10293
414100***** SHOULD ALWAYS MOVE CUSTOMERS CURRENCY CODE TO               ROR10293
414101*****   ORDERS CURRENCY CODE.                                     ROR10293
414102     IF TC-MEXICO OR TC-BRAZIL OR TC-ARGENTINA                    ROR02234
414103     OR TC-BRAZIL-SOLUTION                                        MXK04170
           OR TC-BRAZIL-LINK                                            PYN22203
414104     OR ITS-A-SAP-ACCT                                            ROR10293
414105        NEXT SENTENCE                                             ROR02234
414200     ELSE                                                         ROR02234
414300        IF TB-CPO2-FOREIGN-PRICE-ONLY                             ROR02234
414400           MOVE TB-CPO2-PRICING-CURR-CODE                         ROR02234
414500                                      TO  ORH-CURRENCY-CODE       ROR02234
414600        END-IF                                                    ROR02234
414700     END-IF.                                                      ROR02234
414800**                                                                ROR10293
414900** PAN EURO PROJECT.                                              ROR10293
415000***** SHOULD SKIP THE BELOW OVERRIDING OF CURRENCY RATE FOR       ROR10293
415100*****  ORDERS COMING FROM SAP.                                    ROR10293
415101*                                                                 ROR10293
415102*----- GETTING CURRENCY RATE FROM TBXCONR TABLE -----------       SXG03247
415103     IF ITS-A-SAP-ACCT                                            ROR10293
415104        NEXT SENTENCE                                             ROR10293
415105     ELSE                                                         ROR10293
415106        IF TC-EUROPE                                              SXG03247
415107         IF CU-CURRENCY-CODE NOT = TB-CPO-CURRENCY-CODE           SXG03247
415108           MOVE TC-COMPANY            TO  TB-CURR-CO              SXG03247
415200           MOVE CU-CURRENCY-CODE TO TB-CURR-FROM-CURR-CODE        SXG03247
415300           MOVE TB-CPO-CURRENCY-CODE TO TB-CURR-TO-CURR-CODE      SXG03247
415400           CALL 'SYU510' USING TB-CURR-TABLE-IA                   SXG03247
415500           IF TB-CURR-NORESP                                      SXG03247
415600              MOVE TB-CURR-SELL-RATE TO ORH-CURRENCY-RATE.        SXG03247
415700                                                                  SXG03247
415800     IF ORH-COMPANY EQUAL 'UK'                                    TEH04076
415900        MOVE CUA-ZIP-L                TO ORH-POSTAL-CODES         TEH04076
416000     ELSE                                                         TEH04076
416100        MOVE CUA-POSTAL-CODES            TO  ORH-POSTAL-CODES.            
416200     MOVE CUA-COUNTRY-CODE            TO  ORH-COUNTRY-CODE.       SXK98061
416300     MOVE CU-CUST-REQ-SN-SW           TO  ORH-SERIAL-NBR-REQ-SW.  ROK98117
416400* ALLOW ORDER REQ'S COMING FROM SUBSTATION TO UPDT SER NBR REQ SW PKV09266
      *    NOT APPLICABLE FOR MOBILE ORDERS , AS THEY SHOULD BEHAVE     ROR19067
      *    THE SAME WAY-WHEN THEY CAME THROUGH RPC/JGATE ROUTE,         ROR19067
      *    EVEN WHEN THEY COME THROUGH SUBSTATION ROUTE- ARMOR PROJECT  ROR19067
416500     IF (CORORH-SER-NBR-REQ-SW > SPACES)  AND                     PKV09266
      *       (WS-FROM-SUBSTATION                                       TZM22231
      *        AND NOT WS-TERM-ID-FROM-WEB-MOBILE)                      TZM22231
              (TB-IL-ALW-FROM-SUBSTATION                                TZM22231
               AND NOT TB-IL-MOBILE-APP)                                TZM22231
416700        IF CORORH-SER-NBR-REQ-SW = 'Y' OR 'F'                     PKV09266
416800           MOVE CORORH-SER-NBR-REQ-SW TO ORH-SERIAL-NBR-REQ-SW    PKV09266
416900        ELSE                                                      PKV09266
417000           MOVE 'U'              TO  WS-LU6ORH-ERROR-SW           PKV09266
417100           MOVE 'U8'             TO  WS-LU6ORH-ERROR-FLAG         PKV09266
417200           GO TO S3000-EXIT                                       PKV09266
417300        END-IF                                                    PKV09266
417400     END-IF.                                                      PKV09266
417401                                                                  PKV09266
417402     MOVE 'N'                         TO  ORH-BASE-RATE-ORDER-SW. ROK99135
417403     MOVE EIBDATE                     TO  ORH-ENTRY-DATE.         SXK98180
417404     MOVE EIBTIME                     TO  ORH-ENTRY-TIME          ROR01332
417405                                          CORORH-R-ENTRY-TIME.    ROR01332
417406     MOVE CU-LANGUAGE-CODE            TO                                  
417407                                      ORH-CUSTOMERS-LANGUAGE-CODE.        
417408     IF  WS-SHIP-TO-ADDRESS                                       GTH96221
417409        IF WS-ZIP-CODE NUMERIC                                    TEH00259
417410           MOVE WS-ZIP-CODE                 TO  ORH-ZIP-CODE      TEH00259
417411        ELSE                                                      TEH00259
417412           MOVE WS-ZIP-CODEX (1:6)          TO ORH-POSTAL-CODES   TEH00259
417500        END-IF                                                    TEH00259
417600        MOVE 'Y'                      TO  ORH-DROPSHIP-SW         ROR00060
417700     END-IF.                                                      ROK99160
417800     IF  WS-SHIP-TO-ADDRESS-SPCL = 'Y'                            TKC07194
417900         MOVE 'Y'                     TO  ORH-DROPSHIP-SW         TKC07194
417901     END-IF.                                                      TKC07194
417902*                                                                         
417903*            FULFILLMENT RULES                                    CCL95123
418000*                                                                 CCL95123
418100* CU-              FULFILLMENT      FEE                           CCL95123
418200* FULFILLMENT-SW   ORDER            CHARGED                       CCL95123
418300*                                                                 CCL95123
418400* N                NEVER            NEVER                         CCL95123
418500* Y                Y IF SHIP TO     Y IF SHIP TO                  CCL95123
418600* W                Y IF SHIP TO     NEVER                         CCL95123
418700* A                Y ALWAYS         Y ALWAYS                      CCL95123
418800* BLANK            Y IF SHIP TO     IN US, Y IF CU-FULFILLMENT-   CCL95123
418900*                                               CHARGE-FLAG = F/P CCL95123
419000*                                   OTHER COUNTRIES, Y IF SHIP TO CCL95123
419100*                                                                 CCL95123
419200     IF CU-FULFILLMENT-CHRG-ALL-ORDERS         OR                 MCV93293
419300      (  WS-SHIP-TO-ADDRESS       AND                             SXK98180
419400        NOT CU-FULFILLMENT-OVERRIDEN)                             CCL95123
419500     OR (WS-SHIP-TO-ADDRESS-SPCL = 'Y' AND                        TKC07194
419501        NOT CU-FULFILLMENT-OVERRIDEN)                             TKC07194
419502****  ( CU-FULFILLMENT OR NOT CU-FULFILLMENT-ORDER ) )            MCV93293
419600           MOVE 'Y'              TO  ORH-FULFILLMENT-SW           MCV93293
420000           IF CU-FULFILLMENT-WAIVE-CHARGE OR                      CCL95123
420100             (TB-CPO-NORTH-AM-CNTRY AND                           PJD96346
420200              (NOT CU-FULFILLMENT-CHRG-ALL-ORDERS ) AND           CCL95123
420300              (NOT CU-FULFILLMENT )                 AND           CCL95123
420400              (CU-FULFILLMENT-CHARGE-SW NOT GREATER THAN SPACES)) KMB94279
420500              MOVE 'Y'                TO                          MCV93293
420600                                    ORH-WAIVE-FULFILLMENT-CHRG-SW.MCV93293
420700*                                                                 MCV93293
      *CR2243: EXTENDED SO - FOLLOWING CHANGES HAVE BEEN MOVED TO       RYK20276
      *        A COPYBOOK EXTENDEDSO.                                   RYK20276
           MOVE ORH-TERMS         TO   OET-TERMS                        RYK20276
           PERFORM READ-EXTEND-SO THRU READ-EXTEND-EXIT.                RYK20276
                                                                        RYK20276
      *    IF IN FUTURE DECISION IS MADE TO REVIVE "FI" AS SEPERATE     RYK20276
      *        COMPANY THEN WE NEED TO REVISIT BELOW LOGIC PRESENT IN   RYK20276
      *        EXTENDSO COPYBOOOK.                                      RYK20276
      *                                                                         
420800*    IF ORH-FULFILLMENT-ORDER                                     RYK20276
420810*    OR (ORH-COMPANY = 'EH' OR 'YM')                              RYK20276
420900*       MOVE 'N'                      TO  ORH-EXT-SO-CODE         RYK20276
421000*    ELSE                                                         RYK20276
421100*      IF ORH-COD-ORDER OR ORH-TERMS > 899                        RYK20276
421200*         MOVE 'Y'                    TO  ORH-EXT-SO-CODE         RYK20276
421300*      ELSE                                                       RYK20276
421400*         MOVE CUB-EXT-SO-CODE        TO  ORH-EXT-SO-CODE.        RYK20276
421410*                                                                 TEH05069
      *----DPAS LOGIC - PRIORITIZE DPAS-PRIORITY-CODE----*              BYA21100
           IF CORORH-DPAS-CODE  > SPACES AND                            BYA21100
              TB-CPO7-DPAS-COMPANY-SW = 'Y'                             BYA21100
              CONTINUE                                                  BYA21100
           ELSE                                                         BYA21100
421420        IF WS-SCHEDULED-ORDER                                     TEH05069
421430           MOVE 'Y'         TO ORH-DUMMY-SKU-SW                   TEH05069
421440           MOVE '6'         TO ORH-PRIORITY-CODE                  TEH05069
              END-IF                                                    BYA21100
           END-IF.                                                      BYA21100
421500*                                                                 ROR00325
421600*  TO BE IN SYNC WITH ORP320...                                   ROR00325
421700*                                                                 ROR00325
           IF TC-ITALY OR TC-ITALY-GOV                                  NR122063
421900        IF CUB-SHIP-TO-SUF GREATER THAN 199                       ROR00325
422000           MOVE CUB-SHIP-TO-SUF       TO  WS-SHIP-TO              ROR00325
422100        END-IF                                                    ROR00325
422200        IF CORORH-SHIP-TO-SUFFIX GREATER THAN SPACES              ROR00325
422210        AND CORORH-SHIP-TO-SUFFIX NOT EQUAL '000'                 ROR05307
422300           MOVE CORORH-SHIP-TO-SUFFIX TO  WS-SHIP-TO              ROR00325
422400        END-IF                                                    ROR00325
422500        IF WS-SHIP-TO-ADDRESS    AND                              ROR00325
422600           WS-SHIP-TO NOT EQUAL 001                               ROR00325
422700           MOVE 'P'                   TO  ORH-COPY-CODE           ROR00325
422800        END-IF                                                    ROR00325
422900        IF WS-NO-SHIP-TO-ADDRESS AND                              ROR00325
423000           WS-SHIP-TO NUMERIC    AND                              ROR00325
423100           WS-SHIP-TO GREATER THAN 001                            ROR00325
423200           MOVE 'P'                   TO  ORH-COPY-CODE           ROR00325
423300        END-IF                                                    ROR00325
423400        IF ORH-END-USER-ORDER-SW = 'D'                            ROR00325
423500           MOVE 'P'                   TO  ORH-COPY-CODE           ROR00325
423600        END-IF                                                    ROR00325
423700     END-IF.                                                      ROR00325
423800*                                                                 ROR00325
423900*  WS-EXP-SHIPTO-CNTRY HAS "SHIP TO" COUNTRY CODE'S VALUE.        ROR04162
424000*  THIS CAN BE EITHER SHIP TO SUFFIX'S CNTRY CODE OR DROPSHIP'S.  ROR04162
424100*                                                                 ROR04162
424200     IF WS-EXP-SHIPTO-CNTRY GREATER THAN SPACES                   ROR04162
424300        MOVE WS-EXP-SHIPTO-CNTRY             TO ORH-COUNTRY-CODE  ROR04162
424400     ELSE                                                         ROR04162
424500        MOVE WS-EXP-BI-CNTRY-CODE            TO ORH-COUNTRY-CODE  ROR04162
424600     END-IF.                                                      ROR04162
424700*                                                                         
424800* APO-FPO-ORDERS WILL BYPASS NEXUS RTN                            SXK99015
424900       IF WS-APO-FPO-ORDER                                        SXK99015
425000          MOVE 'Y'              TO ORH-APO-FPO-FLAG               SXK99015
425100          IF  CORORH-SHIP-TO-STATE = 'AP' OR 'AE' OR 'AA'         ROR99350
425200              MOVE 'AP'         TO ORH-COUNTRY-CODE               ROR99350
425300                                   WS-EXP-ST-CNTRY-CODE           ROR99350
425400                                   WS-EXP-SHIPTO-CNTRY            ROR04162
425500          END-IF                                                  ROR99350
425600          SET ORSH-EXPORT-ORDER TO TRUE                           ROR00080
425700       END-IF.                                                    SXK99015
425800**                                                                ROR00080
425900***************************************************************   ROR00080
426000** ORH-EXP-BI-CNTRY > SPACES --->  SHIP-TO AS WELL AS BILL-TO     ROR00080
426100**  HAS  EXPORT COUNTRY CODES  AND  ORH-EXP-BI-CNTRY   HAS        ROR00080
426200**  BILL-TO'S EXP CNTRY CODE..USED IN ORP676 WHILE GIVING ERRORS. ROR00080
426300* ---- WE ARE UPDATING ORH-COUNTRY-CODE CORRECTLY ONLY FOR US,    SXG03305
426400* NOW WE NEED TO FOR ALL COUNTRIES, IF THE ORDER COMES VIA        SXG03305
426500* INSIDELINE.                                                     SXG03305
426600     IF TC-USA                                                    ROR00080
426700        IF  (WS-EXP-SHIPTO-CNTRY  GREATER THAN SPACES  AND        ROR04162
426800            WS-EXP-SHIPTO-CNTRY  NOT EQUAL 'US')                  ROR04162
427200            MOVE        'S'                  TO  ORH-EXPO-FLAG    ROR00080
427300        ELSE                                                      ROR00080
427400          IF  WS-EXP-BI-CNTRY-CODE GREATER THAN SPACES            ROR00080
427600              IF  WS-EXP-BI-CNTRY-CODE NOT EQUAL 'US'             ROR00080
                        MOVE  WS-EXP-BI-CNTRY-CODE TO  ORH-EXP-BI-CNTRY NXC21190
427700                  MOVE  'B'                  TO  ORH-EXPO-FLAG    ROR00080
427800              END-IF                                              ROR00080
427900          END-IF                                                  ROR00080
428000        END-IF                                                    ROR00080
428100        IF  (WS-EXP-BI-CNTRY-CODE GREATER THAN SPACES  AND        ROR00080
428200            WS-EXP-BI-CNTRY-CODE NOT EQUAL 'US')                  ROR00080
428300            IF  (WS-EXP-SHIPTO-CNTRY  GREATER THAN SPACES  AND    ROR04162
428400                WS-EXP-SHIPTO-CNTRY  NOT EQUAL 'US')              ROR04162
428700                MOVE  WS-EXP-BI-CNTRY-CODE   TO  ORH-EXP-BI-CNTRY ROR00080
428800                MOVE    'C'                  TO  ORH-EXPO-FLAG    ROR00080
428900            END-IF                                                ROR00080
429000        END-IF                                                    ROR00080
429100     ELSE                                                         SXG03305
429200      IF TB-CO-VAL-EXP-COMPL-OK                                   SXG03305
429300       IF CORORH-COMPANY-CODE NOT EQUAL TO 'MD'                   SXG03305
430100        IF WS-ST-NON-US-EXPORT                                    SXG03305
430200          IF WS-EXP-SHIPTO-CNTRY  GREATER THAN SPACES             ROR04162
430500            MOVE        'S'                  TO  ORH-EXPO-FLAG    SXG03305
430600          END-IF                                                  SXG03305
430700        ELSE                                                      SXG03305
430800         IF WS-BI-NON-US-EXPORT                                   SXG03305
430900            IF WS-EXP-BI-CNTRY-CODE GREATER THAN SPACES           SXG03305
431100              MOVE      'B'                  TO  ORH-EXPO-FLAG    SXG03305
431200            END-IF                                                SXG03305
431300         END-IF                                                   SXG03305
431400        END-IF                                                    SXG03305
431500        IF WS-BI-NON-US-EXPORT AND                                SXG03305
431600             (WS-EXP-BI-CNTRY-CODE GREATER THAN SPACES)           SXG03305
431700          IF WS-ST-NON-US-EXPORT AND                              SXG03305
431900              (WS-EXP-SHIPTO-CNTRY  GREATER THAN SPACES)          ROR04162
432000               MOVE   WS-EXP-BI-CNTRY-CODE   TO  ORH-EXP-BI-CNTRY SXG03305
432100               MOVE     'C'                  TO  ORH-EXPO-FLAG    SXG03305
432200          END-IF                                                  SXG03305
432300        END-IF                                                    SXG03305
432400       END-IF                                                     SXG03305
432500      END-IF                                                      SXG03305
432600     END-IF.                                                      SXG03305
432700**                                                                SXG03305
432800**                                                                ROR00080
432900     IF CORORH-COMPANY-CODE EQUAL 'NO'                            ROR99273
433000        IF CUB-EU-END-USER-PRICING                                ROR99273
433100           PERFORM S3010-SELSRC-VALIDATION THRU S3010-EXIT        ROR99273
433200        END-IF.                                                   ROR99273
433300     IF NOT WS-LU6ORH-ERROR-ALL-OK                                ROR99330
433400        GO TO S3000-EXIT                                          ROR99330
433500     END-IF                                                       ROR99330
433600******INSIGHT CUSTOMER SHOULD GO THRU NEXUS  ROUTINE..****        ROR99330
433700*                                                                 ROR99015
433800     IF ORH-APO-FPO-FLAG = 'Y' OR                                 ROK99029
433900        NOT TC-USA                                                ROR00326
434000       NEXT SENTENCE                                              ROK99029
434100     ELSE                                                         ROK99029
434200        IF (ORH-TAX-CODE EQUAL 'N' OR ' ')                        ROK99097
434300           PERFORM S3050-NEXUS-LOGIC THRU S3050-EXIT              ROK99097
434400        END-IF                                                    ROK99097
434500     END-IF.                                                      ROR99015
434600*                                                                 ROR99015
434700     IF WS-HOLD-USPS-SW > SPACE                                   TEH00275
434800        MOVE WS-HOLD-USPS-SW    TO ORH-RESIDENTIAL-SW             TEH00275
434900     ELSE                                                         TKC03271
435000        IF NOT ITS-SHIP-TO-EXPORT-ORDER                           TKC03271
435100           MOVE CUA-USPS-FIRM-CODE  TO ORH-RESIDENTIAL-SW         TKC03271
435200        END-IF                                                    TKC03271
435300     END-IF.                                                      TEH00275
435400* CHANGES RELATED TO ITRK PROJECT                                 ROR08283
435500* ORDERS SHOULD BE TREATED AS IF THEY ARE COMING FROM TELESALES,  ROR08283
435600*   WHEN GOING THRU CHOICE ADVANTAGE RULES.                       ROR08283
435700* SHOULD THIS BE OPENED FOR IM360.?                               ROR17307
435701*  MOST LIKELY YES , AS THIS APP WOULD BE USED BY INTERNAL SALES  ROR17307
435702*                                                                 ROR08283
      *    IF WS-FROM-SUBSTATION  AND                                   TZM22231
      *  (WS-TERM-ID-FROM-IMTELLITRACK OR                               TZM22231
      *     WS-TERM-ID-FROM-IM360        OR                             TZM22231
      *     WS-TERM-ID-FROM-IMCORE       OR                             TZM22231
      *     WS-TERM-ID-FROM-IMVND        OR                             TZM22231
      *     WS-TERM-ID-FROM-SAP-ROLLOUTS OR                             TZM22231
      *     WS-TERM-ID-SAP-BRIM-1        OR                             TZM22231
      *     WS-TERM-ID-FROM-GSS-WORKFLOW)                               TZM22231
           IF TB-IL-ALW-FROM-SUBSTATION AND                             TZM22231
              TB-IL-OVRD-ENTRY-METHOD                                   TZM22231
436100        MOVE 'I'                      TO  ORH-ENTRY-METHOD        ROR08283
436200        IF ORH-RESIDENTIAL-SW NOT GREATER THAN SPACES             ROR08283
436300           MOVE 'R' TO ORH-RESIDENTIAL-SW                         ROR08283
436400        END-IF                                                    ROR08283
436500     END-IF.                                                      ROR08283
436600                                                                  PKV09266
436700* ALLOW ORDER REQ'S COMING FROM SUBSTATION TO UPDT CAMPAIGN FIELD PKV09266
436800* HAVE TO REVISIT THIS WARNING !                                  PKV09266
      *    NOT APPLICABLE FOR MOBILE ORDERS , AS THEY SHOULD BEHAVE     ROR19067
      *    THE SAME WAY-WHEN THEY CAME THROUGH RPC/JGATE ROUTE,         ROR19067
      *    EVEN WHEN THEY COME THROUGH SUBSTATION ROUTE- ARMOR PROJECT  ROR19067
436900     IF (CORORH-CAMPAIGN > SPACES) AND                            PKV09266
      *       (WS-FROM-SUBSTATION                                       TZM22231
      *        AND NOT WS-TERM-ID-FROM-WEB-MOBILE)                      TZM22231
               (TB-IL-ALW-FROM-SUBSTATION                               TZM22231
                AND NOT TB-IL-MOBILE-APP)                               TZM22231
437100        IF (NOT CUOF-CHOICE-ADVTG)     AND                        PKV09266
437200           TB-CPO4-USE-CAMPAIGN-FIELD                             PKV09266
437300           MOVE CORORH-CAMPAIGN TO ORH-CAMPAIGN                   PKV09266
437400        ELSE                                                      PKV09266
437500           MOVE 'W'                      TO WS-R-WARN-FLAG        PKV09266
437600           MOVE '9'                      TO WS-R-WARN-TYPE        PKV09266
437700           PERFORM S8000-SET-WARNINGS THRU S8000-EXIT             PKV09266
437800           MOVE '#'                      TO WS-LU6ORH-WARNING-SW  PKV09266
437900        END-IF                                                    PKV09266
438000     END-IF.                                                      PKV09266
438100                                                                  PKV09266
438200     IF CORORH-VENDOR-CLAIM-NBR> SPACES                           PKV09266
438300        MOVE CORORH-VENDOR-CLAIM-NBR                              PKV09266
438400                            TO ORH-VENDOR-CLAIM-NBR               PKV09266
438401     END-IF.                                                      PKV09266
438402*                                                                 ROR99015
438403*                                                                 ROR04094
438404* PER NEW RULES OF UPSMI PROJECT, SHOULD ALWAYS SET THIS VALUE.   ROR04094
438405*                                                                 ROR04094
438406     MOVE '3'         TO ORH-OVERSIZE-METHOD-SW.                  ROR04094
438407                                                                  TKC02151
438408     IF CORORH-CONFIGURATION-ORDER                                PXP95004
438409        SET ORH-CONFIGURATION-ORDER   TO  TRUE.                   MCV93320
438410*                                                                 ROR04064
438411*                                                                 ROR04064
438412* EDIT THE THIRD PARTY FREIGHT ACCOUNT IF ENTERED.                ROR04064
438413*                                                                 ROR04064
438414     IF CORORH-THIRD-PARTY-FRT-ACCOUNT GREATER THAN SPACES        ROR04064
438415     AND WS-LU6ORH-ERROR-ALL-OK                                   TKC05031
438416        PERFORM S3300-EDIT-THIRD-PARTY-FRT THRU S3300-EXIT        ROR04064
438417        IF WS-HOLD-ON-ERROR AND                                   ROR05277
438418           NOT WS-LU6ORH-ERROR-ALL-OK                             ROR04064
438419           SET WS-HOLD-ON-3PTY-ERR TO TRUE                        ROR06075
438420           MOVE 'Y'                TO WS-HOLD-ON-ERROR-TYPE       ROR06075
438421           MOVE 'P'                        TO WS-BILL-PAY-SW      ROR04064
438422           SET WS-LU6ORH-ERROR-ALL-OK      TO TRUE                ROR04064
438423        END-IF                                                    ROR04064
438424     END-IF.                                                      ROR04064
438425*                                                                 ROR04064
438426     IF NOT WS-LU6ORH-ERROR-ALL-OK                                ROR04064
438427        GO TO S3000-EXIT                                          ROR04064
438428     END-IF                                                       ROR04064
438500*                                                                 ROR04064
438600     IF WS-NO-SHIP-TO-ADDRESS        AND                          ROR04064
438700        CORORH-SHIP-TO-SUFFIX > SPACES                            ROR04064
438800        IF CORORH-SHIP-TO-SUFFIX EQUAL '000'                      ROR05307
438900           MOVE SPACES TO ORH-SHIP-TO-SUFFIX                      ROR05307
438901        ELSE                                                      ROR05307
438902           PERFORM S3400-PROCESS-SHIP-TO-SUFFIX THRU S3400-EXIT   ROR04064
438903        END-IF                                                    ROR05307
438904     END-IF.                                                      ROR04064
439000*                                                                 ROR04064
439100     IF NOT WS-LU6ORH-ERROR-ALL-OK                                ROR04064
439200        GO TO S3000-EXIT                                          ROR04064
439300     END-IF                                                       ROR04064
439400*                                                                 ROR04064
439500     IF WS-USE-FRM                                                ROR04064
439600        MOVE 'Y'                   TO ORH-BASE-RATE-ORDER-SW      RYD18278
439700     ELSE                                                         ROR04064
439800        IF TC-USA                                                 ROR04064
439900           PERFORM S3500-CHECK-BASERATE THRU S3500-EXIT           ROR04064
440000        ELSE                                                      ROR04064
440100           PERFORM S3510-CHECK-BASERATE THRU S3510-EXIT           ROR04064
440200        END-IF                                                    ROR04064
440300     END-IF.                                                      ROR04064
440400*                                                                 ROR99015
      *SE8512 - ACCEPTING STATE CODE AND TAX CODE FROM POWER            VYP20304
      *APPLICATION AND VALIDATION                                       VYP20304
           IF CORORH-FROM-POWER-APPL                                    VYP20304
              IF CORORH-STATE-CODE > SPACES                             VYP20304
                MOVE CORORH-STATE-CODE  TO  WS-SYTX-STATE               VYP20304
                MOVE SPACES             TO  WS-SYTX-COUNTY              VYP20304
                                            WS-SYTX-CITY                VYP20304
                PERFORM S3515-READ-SYLTAX-FILE                          VYP20304
                                        THRU S3515-EXIT                 VYP20304
                IF WS-SYTX-NORESP                                       VYP20304
                   MOVE  CORORH-STATE-CODE  TO ORH-STATE-CODE           VYP20304
                ELSE                                                    VYP20304
                    MOVE 'X'  TO WS-LU6ORH-ERROR-SW                     VYP20304
                    MOVE 'PX' TO WS-LU6ORH-ERROR-FLAG                   VYP20304
                    GO TO S3000-EXIT                                    VYP20304
                END-IF                                                  VYP20304
              END-IF                                                    VYP20304
                                                                        VYP20304
              EVALUATE CORORH-TAX-CODE                                  VYP20304
                WHEN 'N'                                                VYP20304
                WHEN 'T'                                                VYP20304
                   MOVE CORORH-TAX-CODE        TO ORH-TAX-CODE          VYP20304
                WHEN 'S'                                                VYP20304
                    IF ORH-STATE-CODE > SPACES                          VYP20304
                       MOVE CORORH-TAX-CODE    TO ORH-TAX-CODE          VYP20304
                    ELSE                                                VYP20304
154900                MOVE 'S'  TO WS-LU6ORH-ERROR-SW                   VYP20304
155000                MOVE 'PS' TO WS-LU6ORH-ERROR-FLAG                 VYP20304
155100                GO TO S3000-EXIT                                  VYP20304
                    END-IF                                              VYP20304
                WHEN 'C'                                                VYP20304
                    IF ORH-COUNTY-CODE > SPACES                         VYP20304
                      MOVE CORORH-TAX-CODE    TO ORH-TAX-CODE           VYP20304
                    ELSE                                                VYP20304
154900                MOVE 'C'  TO WS-LU6ORH-ERROR-SW                   VYP20304
155000                MOVE 'PC' TO WS-LU6ORH-ERROR-FLAG                 VYP20304
155100                GO TO S3000-EXIT                                  VYP20304
                    END-IF                                              VYP20304
                WHEN 'K'                                                VYP20304
                    IF ORH-CITY-CODE > SPACES                           VYP20304
440400                MOVE CORORH-TAX-CODE    TO ORH-TAX-CODE           VYP20304
                    ELSE                                                VYP20304
154900                MOVE 'K'  TO WS-LU6ORH-ERROR-SW                   VYP20304
155000                MOVE 'PK' TO WS-LU6ORH-ERROR-FLAG                 VYP20304
155100                GO TO S3000-EXIT                                  VYP20304
                    END-IF                                              VYP20304
              END-EVALUATE                                              VYP20304
                                                                        VYP20304
           END-IF.                                                      VYP20304
                                                                        VYP20304
                                                                                
440500 S3000-EXIT.    EXIT.                                             ROR99015
440600*                                                                 ROR99015
440700*                                                                 ROR99273
440800 S3010-SELSRC-VALIDATION.                                         ROR99273
440900*                                                                 ROR99273
441000*                                                                 ROR99273
441100     IF (CORORH-CUST-INTERNAL-ACCTINFO > SPACES AND               ROR99273
441200        (CORORH-CUST-INTERNAL-SALESMAN = SPACES OR LOW-VALUES))   ROR99273
441300           MOVE '1'              TO WS-LU6ORH-ERROR-SW            ROR99273
441400           MOVE 'T1'             TO WS-LU6ORH-ERROR-FLAG          ROR99273
441500                                    CORORH-R-ERROR-TYPE-TELENOR   ROR99273
441600           GO TO S3010-EXIT                                       ROR99273
441700     END-IF                                                       ROR99273
441800*                                                                 ROR99273
441900     IF CORORH-CUST-INTERNAL-SALESMAN > SPACES                    ROR99273
442000        MOVE CORORH-COMPANY-CODE TO TB-TELIS-COMPANY-CODE         ROR99273
442100        MOVE CORORH-CUST-INTERNAL-SALESMAN TO TB-TELIS-IS-NUMBER  ROR99273
442200        CALL 'SYU510'         USING TB-TELIS-PROC-IA              ROR99273
442300        IF TB-TELIS-NORESP                                        ROR99273
442400           MOVE 'Y'                          TO WS-TELIS-IS-SW1   ROR99273
442500           MOVE TB-TELIS-TELENOR-ANSVAR-CODE TO WS-TELIS-CODE     ROR99273
442600        ELSE                                                      ROR99273
442700           MOVE '2'              TO WS-LU6ORH-ERROR-SW            ROR99273
442800           MOVE 'T2'             TO WS-LU6ORH-ERROR-FLAG          ROR99273
442900                                    CORORH-R-ERROR-TYPE-TELENOR   ROR99273
443000           GO TO S3010-EXIT                                       ROR99273
443100        END-IF                                                    ROR99273
443200     END-IF                                                       ROR99273
443300*                                                                 ROR99273
443400*                                                                 ROR99273
443500     IF CORORH-CUST-INTERNAL-ACCTINFO > SPACES                    ROR99273
443600        MOVE CORORH-COMPANY-CODE TO TB-ARRVS-COMPANY-CODE         ROR99273
443700        MOVE CORORH-CUST-INTERNAL-ACCTINFO                        ROR99273
443800                                 TO TB-ARRVS-TELENOR-ANSVAR-CODE  ROR99273
443900        CALL 'SYU510'         USING TB-ARRVS-PROC-IA              ROR99273
444000        IF TB-ARRVS-NORESP                                        ROR99273
444100           MOVE 'Y' TO WS-TELIS-IS-SW2                            ROR99273
444200        ELSE                                                      ROR99273
444300           MOVE '3'              TO WS-LU6ORH-ERROR-SW            ROR99273
444400           MOVE 'T3'             TO WS-LU6ORH-ERROR-FLAG          ROR99273
444500                                    CORORH-R-ERROR-TYPE-TELENOR   ROR99273
444600           GO TO S3010-EXIT                                       ROR99273
444700        END-IF                                                    ROR99273
444800     END-IF.                                                      ROR99273
444900*                                                                 ROR99273
445000*                                                                 ROR99273
445100 S3010-EXIT.   EXIT.                                              ROR99273
445200*                                                                 ROR99273
445300*                                                                 ROR99273
445400 S3050-NEXUS-LOGIC.                                               ROR99015
445500*                                                                 ROR99015
445600     MOVE TC-COMPANY TO TB-CPO2-COMPANY-CODE                      ROR99015
445700     CALL 'SYU510' USING TB-CPO2-PROC-IA                          ROR99015
445800     IF TB-CPO2-NORESP                                            ROR99015
445900        MOVE  TB-CPO2-NEXUS-ACTIVE-SW TO WS-NEXUS-ACTIVE-SW       ROR99015
446000     ELSE                                                         ROR99015
446100        MOVE ' ' TO WS-NEXUS-ACTIVE-SW                            ROR99015
446200     END-IF                                                       ROR99015
446300        MOVE ORH-GOVT-PUBLIC-PRIVATE-SW TO                        ROR99015
446400                 WS-NEXUS-GOVT-PUB-PRIV-SW                        ROR99015
446500        MOVE ORH-GOV-END-USER-TYPE       TO                       ROR99015
446600                 WS-NEXUS-GOVT-END-USER-TYPE-SW                   ROR99015
446700        IF ORH-GOVERNMENT-BID-FLAG = 'G'                          ROR99015
446800           MOVE 'Y'  TO WS-NEXUS-GOVT-ORDER-SW                    ROR99015
446900        ELSE                                                      ROR99015
447000           MOVE ' '  TO WS-NEXUS-GOVT-ORDER-SW                    ROR99015
447100        END-IF                                                    ROR99015
447200        MOVE 'Y'   TO           WS-NEXUS-ORDER-STATUS-SW          ROR99015
447300        MOVE ORH-COMPANY                TO WS-NEXUS-COMPANY       ROR99015
447400        MOVE CUA-TAX-CODE               TO WS-NEXUS-TAX-CODE      ROR99015
447500        MOVE ORH-SHIP-TO-STATE          TO                        ROR99015
447600             WS-NEXUS-SHIP-TO-STATE                               ROR99015
447700        MOVE ORH-BILL-TO-BR-NBR         TO                        ROR99015
447800             WS-NEXUS-BILL-TO-BR-NBR                              ROR99015
447900        MOVE ORH-BILL-TO-CUST-NBR       TO                        ROR99015
448000             WS-NEXUS-BILL-TO-CUST-NBR                            ROR99015
448100        MOVE ORH-BILL-TO-SUFFIX         TO                        ROR99015
448200             WS-NEXUS-BILL-TO-SUFFIX                              ROR99015
448300        MOVE ORH-ENTRY-DATE             TO WS-NEXUS-ENTRY-DATE    ROR99015
448400        MOVE CU-AGENCY-SHIP-FROM        TO                        ROR99015
448500             WS-NEXUS-CU-AGENCY-SHIP-FROM                         TEH01213
448600             WS-NEXUS-BR-NBR-SHIP-FROM                            ROR99015
448700        IF CORORH-SHIP-VIA-CARRIER-CODE > SPACES                  ROR99043
448800        MOVE CORORH-SHIP-VIA-CARRIER-CODE TO                      ROR99043
448900                             WS-NEXUS-CARRIER-CODE                ROR99043
449000        ELSE                                                      ROR99043
449100        MOVE CU-AGENCY-CARRIER          TO WS-NEXUS-CARRIER-CODE  ROR99015
449200        END-IF                                                    ROR99043
449300        MOVE CU-AGENCY-FLAG             TO                        ROR99015
449400             WS-NEXUS-CU-AGENCY-FLAG                              ROR99015
449500        IF ORH-SHIP-TO-SUFFIX = SPACES                            ROR99015
449600        MOVE ORH-FULFILLMENT-SW         TO                        ROR99015
449700             WS-NEXUS-FULFILLMENT-SW                              ROR99015
449800        ELSE                                                      ROR99015
449900        MOVE ' '                        TO                        ROR99015
450000             WS-NEXUS-FULFILLMENT-SW                              ROR99015
450100        END-IF                                                    ROR99015
450200        MOVE ' ='                       TO  WS-CUSMSC-SEARCH      ROR99356
450300        PERFORM A1000-NEXUS-TAX-ROUTINE THRU A1000-EXIT           ROR99015
450400        EVALUATE TRUE                                             ROR99015
450500           WHEN NEXUS-TAXABLE-ORDER                               ROR99015
450600                MOVE 'S'                TO ORH-TAX-CODE           ROR99015
450700                MOVE 'Y'                TO OET-NEXUS-STATUS-SW    ROR99015
450800                MOVE ' '                TO ORH-SPECIAL-HANDLE-SW  ROR99015
450900                MOVE CORORH-THIRD-PARTY-FRT-ACCOUNT               ROR99015
451000                                        TO WS-THIRD-PARTY-FLAG    ROR99015
451100                MOVE 'W'                TO WS-RESPONSE-FLAG       ROR06075
451200                                           WS-R-WARN-FLAG         ROR06075
451300                MOVE 'T'                TO WS-ERROR-FLAG          ROR99015
451400                                           WS-R-WARN-TYPE         ROR06075
451401                PERFORM S8000-SET-WARNINGS THRU S8000-EXIT        ROR06075
451402                MOVE 'Y'                TO WS-TAX-FLAG            ROR99015
451500           WHEN NEXUS-AGENCY-ORDER                                ROR99015
451600                MOVE 'A'                TO OET-NEXUS-STATUS-SW    ROR99015
451700                MOVE 'A'                TO ORH-SPECIAL-HANDLE-SW  ROR99015
451800                MOVE 'N'                TO ORH-TAX-CODE           ROR99015
451900                MOVE 'P'                TO WS-BILL-PAY-SW         ROK99123
452000                MOVE CORORH-THIRD-PARTY-FRT-ACCOUNT               ROR99015
452100                            TO WS-THIRD-PARTY-FLAG1               ROR99015
452200                MOVE CORORH-THIRD-PARTY-FRT-ACCOUNT               ROR99015
452300                            TO WS-THIRD-PARTY-FLAG                ROR99015
452400                IF CORORH-THIRD-PARTY-FRT-ACCOUNT = SPACES        ROR99015
452500                MOVE TB-MAFC2-3RD-PARTY-ACCT-NBR-1                ROR99015
452600                            TO CORORH-THIRD-PARTY-FRT-ACCOUNT     ROR99015
452700                               WS-THIRD-PARTY-FLAG                ROR99015
452800                END-IF                                            ROR99015
452900                MOVE WS-NEXUS-BR-NBR-SHIP-FROM                    ROR99015
453000                                        TO WS-SHIP-FROM           ROR01116
453100                MOVE 'A'                TO WS-TAX-FLAG            ROR99015
453200                MOVE 'W'                TO WS-RESPONSE-FLAG       ROR06075
453300                                           WS-R-WARN-FLAG         ROR06075
453400                MOVE 'A'                TO WS-ERROR-FLAG          ROR99015
453500                                           WS-R-WARN-TYPE         ROR06075
453501                PERFORM S8000-SET-WARNINGS THRU S8000-EXIT        ROR06075
453502               IF CORORH-AGENCY-OVERRIDE-FLAG = 'Y'               ROR99015
453600                MOVE 'S'                TO ORH-TAX-CODE           ROR99015
453700                MOVE ' '                TO ORH-SPECIAL-HANDLE-SW  ROR99015
453800                MOVE WS-THIRD-PARTY-FLAG1 TO                      ROR99015
453900                            CORORH-THIRD-PARTY-FRT-ACCOUNT        ROR99015
454000                MOVE CORORH-THIRD-PARTY-FRT-ACCOUNT               ROR99015
454100                                        TO WS-THIRD-PARTY-FLAG    ROR99015
454200                MOVE 'W'                TO WS-RESPONSE-FLAG       ROR06075
454300                                           WS-R-WARN-FLAG         ROR06075
454400                MOVE 'T'                TO WS-ERROR-FLAG          ROR99015
454500                                           WS-R-WARN-TYPE         ROR06075
454501                PERFORM S8000-SET-WARNINGS THRU S8000-EXIT        ROR06075
454502                MOVE 'Y'                TO WS-TAX-FLAG            ROR99015
454600               END-IF                                             ROR99015
454700           WHEN NEXUS-NOT-NEXUS-ORDER                             ROR99015
454800                MOVE 'N'                TO ORH-TAX-CODE           ROR99015
454900                MOVE CORORH-THIRD-PARTY-FRT-ACCOUNT               ROR99015
455000                                        TO WS-THIRD-PARTY-FLAG    ROR99015
455100                MOVE ' '                TO ORH-SPECIAL-HANDLE-SW  ROR99015
455200                MOVE 'N'                TO WS-TAX-FLAG            ROR99015
455300           WHEN NEXUS-ERROR-ORDER                                 ROR99015
455400                MOVE CORORH-THIRD-PARTY-FRT-ACCOUNT               ROR99015
455500                                        TO WS-THIRD-PARTY-FLAG    ROR99015
455600                MOVE 'N'                TO WS-LU6ORH-ERROR-SW     ROR99043
455700        END-EVALUATE.                                             ROR99015
455800*                                                                 ROR99015
455900 S3050-EXIT.   EXIT.                                              ROR99015
456000*                                                                 ROR99015
456100 S3100-GOV-LOGIC.                                                 ROR99015
456200*                                                                 ROR99015
456300     IF (CORORH-GOVT-PROGRAM-TYPE   =   SPACES) OR                ROR99015
456400         (CORORH-GOVT-END-USER-TYPE   =   SPACES) OR              ROR99015
456500          (CORORH-GOVT-SOLICITATION-NBR   =   SPACES) OR          ROR99015
456600           (CORORH-GOVT-END-USER-DATA   =   SPACES)  OR           ROR99015
456700            (CORORH-GOVT-END-USER-ZIP   =   SPACES)               ROR99015
456800        MOVE 'C' TO WS-LU6ORH-ERROR-SW                            ROR99015
456900        GO TO S3100-GOV-LOGIC-EXIT                                ROR99015
457000     END-IF.                                                      ROR99015
457100*                                                                 ROR99015
457200     IF CORORH-GOVT-PROGRAM-TYPE = 'ED'                           ROR99015
457300       IF CORORH-GOVT-END-USER-TYPE = 'K' OR 'H' OR 'E'           ROR99015
457400         IF CORORH-GOVT-PUBLIC-PRIVATE-SW = 'P'  OR 'R'           ROR99015
457500          CONTINUE                                                ROR99015
457600         ELSE                                                     ROR99015
457700          MOVE 'C' TO WS-LU6ORH-ERROR-SW                          ROR99015
457800          GO TO S3100-GOV-LOGIC-EXIT                              ROR99015
457900         END-IF.                                                  ROR99015
458000*                                                                 ROR99015
458100     IF CORORH-GOVT-PROGRAM-TYPE = 'PA'                           ROR99015
458200       IF CORORH-GOVT-END-USER-TYPE = 'F' OR 'S'                  ROR99015
458300         IF CORORH-GOVT-PUBLIC-PRIVATE-SW = ' '                   ROR99015
458400          CONTINUE                                                ROR99015
458500         ELSE                                                     ROR99015
458600          MOVE ' ' TO CORORH-GOVT-PUBLIC-PRIVATE-SW               ROR99015
458700     END-IF.                                                      ROR99015
458800*                                                                 ROR99015
458900*** DELETED THE TBXPRG READ AS WE ALREADY READ THE RECORD  ****   ROR99330
459000        MOVE LOW-VALUES TO CG-KEY                                 ROR99015
459100        EXEC CICS STARTBR                                         ROR99015
459200                  FILE    (WS-CULGEM-FILE-NAME)                   ROR99015
459300                  RIDFLD  (CG-KEY)                                ROR99015
459400                  RESP    (WS-EIBRESP)                            ROR99015
459500        END-EXEC.                                                 ROR99330
459600*                                                                 ROR99015
459700     IF NOT WS-EIB-NORESP                                         ROR99015
459800        MOVE 'C' TO WS-LU6ORH-ERROR-SW                            ROR99015
459900     ELSE                                                         ROR99015
460000        PERFORM S3110-GOV-LOGIC THRU S3110-GOV-LOGIC-EXIT         ROR99015
460100                 UNTIL (WS-CULGEM-ENDFILE OR WS-GOV-REC-FND)      ROR99015
460200     END-IF.                                                      ROR99015
460300*                                                                 ROR99015
460400        EXEC CICS ENDBR                                           ROR99015
460500                  FILE    (WS-CULGEM-FILE-NAME)                   ROR99015
460600        END-EXEC.                                                 ROR99015
460700*                                                                 ROR99015
460800 S3100-GOV-LOGIC-EXIT.  EXIT.                                     ROR99015
460900                                                                  ROR99015
461000 S3110-GOV-LOGIC.                                                 ROR99015
461100*                                                                 ROR99015
461200        MOVE WS-CULGEM-MAXLEN TO WS-CULGEM-REC-LENGTH             ROR99015
461300        EXEC CICS READNEXT                                        ROR99015
461400                  FILE    (WS-CULGEM-FILE-NAME)                   ROR99015
461500                  INTO    (CG-CURGEM)                             ROR99015
461600                  RIDFLD  (CG-KEY)                                ROR99015
461700                  LENGTH  (WS-CULGEM-REC-LENGTH)                  ROR99015
461800                  RESP    (WS-EIBRESP)                            ROR99015
461900        END-EXEC                                                  ROR99015
462000*                                                                 ROR99015
462100     IF NOT WS-EIB-NORESP                                         ROR99015
462200       MOVE 'E' TO WS-CULGEM-IO-SW                                ROR99015
462300       MOVE 'C' TO WS-LU6ORH-ERROR-SW                             ROR99015
462400       GO TO S3110-GOV-LOGIC-EXIT                                 ROR99015
462500     ELSE                                                         ROR99015
462600      IF (CORORH-GOVT-PROGRAM-TYPE   =   CG-PROGRAM-TYPE1)        ROR04064
462700       AND (CG-PRICE-AS-CUSTOMER   =   SPACES)                    ROR99015
462800         MOVE CG-CONTRACT                 TO                      ROR99015
462900                                  ORH-CONTRACT                    ROR99015
463000         IF CORORH-GOVT-END-USER-TYPE(2:1) GREATER THAN SPACES    ROR00304
463100         MOVE CORORH-GOVT-END-USER-TYPE    TO                     ROR00304
463200                                  ORH-GOVT-END-USER-TYPE-2        ROR00304
463300         ELSE                                                     ROR00304
463400         MOVE CORORH-GOVT-END-USER-TYPE    TO                     ROR00304
463500                                  ORH-GOV-END-USER-TYPE           ROR00304
463600         END-IF                                                   ROR00304
463700         MOVE CORORH-GOVT-SOLICITATION-NBR TO                     ROR99015
463800                                  ORH-GOVT-SOLICITATION-NBR       ROR99015
463900         MOVE CORORH-GOVT-END-USER-ZIP     TO                     ROR99015
464000                                  ORH-GOVT-END-USER-ZIP           ROR99015
464100         MOVE CORORH-GOVT-END-USER-DATA    TO                     ROR99015
464200                                  ORH-GOVT-END-USER-DATA          ROR99015
464300         MOVE CORORH-GOVT-PUBLIC-PRIVATE-SW TO                    ROR99015
464400                                  ORH-GOVT-PUBLIC-PRIVATE-SW      ROR99015
464500         MOVE       'G'                    TO                     ROR99015
464600                                  ORH-GOVERNMENT-BID-FLAG         ROR99015
464700         MOVE       'Y'                    TO                     ROR00140
464800                                  ORH-GOVT-GSA-IND                ROR00140
464900         MOVE        'Y'                TO                        ROR99015
465000                                  WS-GOV-REC-SW                   ROR99015
465100       END-IF                                                     ROR99015
465200     END-IF.                                                      ROR99015
465300*                                                                 ROR99015
465400 S3110-GOV-LOGIC-EXIT.  EXIT.                                     ROR99015
465500                                                                  DXO99330
465600*                                                                 NXC17174
465700 S3200-CHECK-CUSTOMER-GST-LOCK.                                   NXC17174
465800*                                                                 NXC17174
465900* FOR GST ORDERS , CHECK IF CUSTOMER LOCK IS ON.?                 NXC17174
466000*                                                                 NXC17174
466100     MOVE LOW-VALUES            TO WS-CUSMSC-KEY-VALUE.           NXC17174
466200     MOVE 'F'                   TO WS-CUM-SEG-TYPE.               NXC17174
466300     MOVE ORH-BILL-TO-SUFFIX TO WS-CUM-KEY.                       NXC17174
466400     PERFORM 1010-GU-CUSMSC.                                      NXC17174
466500     IF WS-CUSMSC-NORESP                                          NXC17174
466600        IF CUM-CUST-LCKFLAG-YES                                   NXC17174
466700           MOVE '1'              TO WS-LU6ORH-ERROR-SW            NXC17174
466800                                 WS-CUSTOMER-GST-ERROR-SW         NXC17174
466900           MOVE 'I1'             TO WS-LU6ORH-ERROR-FLAG          NXC17174
467000           GO TO S3200-EXIT                                       NXC17174
467100        END-IF                                                    NXC17174
467200     ELSE                                                         NXC17174
467300        MOVE '2'              TO WS-LU6ORH-ERROR-SW               NXC17174
467400                              WS-CUSTOMER-GST-ERROR-SW            NXC17174
467500        MOVE 'I2'             TO WS-LU6ORH-ERROR-FLAG             NXC17174
467600        GO TO S3200-EXIT                                          NXC17174
467700     END-IF.                                                      NXC17174
467800*                                                                 NXC17174
467900* FOR GST ORDERS , CHECK IF TAX NUMBER IS PRESENT ?               NXC17174
468000*                                                                 NXC17174
468100     MOVE SPACES                 TO WS-CUSMSC-KEY-VALUE.          NXC17174
468200     MOVE 'I'                    TO WS-CUM-SEG-TYPE.              NXC17174
468300     MOVE ORH-BILL-TO-SUFFIX     TO WS-CUM-KEY.                   NXC17174
468400     PERFORM 1010-GU-CUSMSC.                                      NXC17174
468500     IF WS-CUSMSC-NORESP                                          NXC17174
468600        IF CUM-GSTIN <= SPACES                                    NXC17174
468700           MOVE '3'              TO WS-LU6ORH-ERROR-SW            NXC17174
468800                                 WS-CUSTOMER-GST-ERROR-SW         NXC17174
468900           MOVE 'I3'             TO WS-LU6ORH-ERROR-FLAG          NXC17174
469000           GO TO S3200-EXIT                                       NXC17174
469100        END-IF                                                    NXC17174
469200     ELSE                                                         NXC17174
469300        IF WS-CUSMSC-NOTFND                                       NXC17174
469400           MOVE '4'              TO WS-LU6ORH-ERROR-SW            NXC17174
469500                                 WS-CUSTOMER-GST-ERROR-SW         NXC17174
469600           MOVE 'I4'             TO WS-LU6ORH-ERROR-FLAG          NXC17174
469700           GO TO S3200-EXIT                                       NXC17174
469800        END-IF                                                    NXC17174
469900     END-IF.                                                      NXC17174
470000*                                                                 NXC17174
470100 S3200-EXIT.   EXIT.                                              NXC17174
470101*                                                                 ROR05314
470102*                                                                         
470103 S3300-EDIT-THIRD-PARTY-FRT.                                      ROR02128
470104*                                                                 ROR02128
470105***************************************************************** ROR02128
470106**  THIS PARAGRAPH WILL VALIDATE THE THIRD PARTY FRT ACCOUNT   ** ROR02128
470107***************************************************************** ROR02128
470108*                                                                 ROR02128
470109     IF CORORH-THIRD-PARTY-FRT-ACCOUNT EQUAL ZEROES               ROR02128
470110        IF TB-CARR-LTL OR                                         ROR02128
470111           TB-CARR-AIR-HEAVYWEIGHT                                ROR02128
470112           GO TO S3300-EXIT                                       ROR02128
470113        ELSE                                                      ROR02128
470114           MOVE 'P'                TO WS-LU6ORH-ERROR-SW          ROR02128
470115           GO TO S3300-EXIT                                       ROR02128
470116        END-IF                                                    ROR02128
470117     END-IF.                                                      ROR02128
470118*                                                                 ROR02128
470119     IF WS-TERMS NUMERIC                                          ROR02128
470120        IF    WS-COD-ORDER                                        ROR02128
470121          MOVE 'P'                 TO WS-LU6ORH-ERROR-SW          ROR02128
470122          GO TO S3300-EXIT.                                       ROR02128
470123*                                                                 ROR02128
470123* FOR CISCO PARTNER NOW PORTAL DIRECTSHIP ORDER WITH THIRD PARTY  RP120124
470123* FREIGHT ACCT NUMBER IS PASSTHRU , IL VALIDATION NOT NEEDED.     RP120124
470123*                                                                 RP120124
      *    IF (WS-TERM-ID-FROM-IMVND                                    SK824062
      *    OR (CORORH-TERM-ID = 'XVFC' AND CORORH-OPER-ID = 'VENP')     SK824062
      *    OR CORORH-TERM-ID = 'XCTO'                                   SK824062
      *    OR CORORH-TERM-ID = 'TCTO')  AND                             SK824062
           IF TB-IL-SKIP-TPTY-FRTACT-DRCT AND                           SK824062
470123        CORORH-DIRECT-SHIP  = 'Y'                                 RP120124
470123        MOVE 'P'                        TO WS-BILL-PAY-SW         RP120124
470123        GO TO S3300-EXIT                                          RP120124
470123     END-IF.                                                      RP120124
470123*                                                                 RP120124
470124*  DONT NEED TO DO THIS CHECK ANY MORE, AS WE ARE NOT PERFORMING  ROR09217
470125*    TBXMAFC READ ABOVE.                                          ROR09217
470126*   MORE OVER EVEN IF WE ARE PERFORMING TBXMAFC READ , WE ARE NOT ROR09217
470127*    DOING IT WITH  PROPER SHIPPING BRANCH AS WE DONT HAVE ALL    ROR09217
470128*     THE PRODUCT INFO TO COME UP WITH PROPER SHIPPING BRANCH.    ROR09217
470129*                                                                 ROR09217
470130*    IF (CORORH-CUST-NBR = '493440'  AND                          ROR09217
470140*             TC-USA                 AND                          ROR09217
470150*             WS-TRUE-UPS) OR                                     ROR09217
470160*            TB-MAIF-THIRD-PARTY-ACCOUNT                          ROR09217
470170*      NEXT SENTENCE                                              ROR09217
470180*    ELSE                                                         ROR09217
470190*      MOVE 'P'                 TO WS-LU6ORH-ERROR-SW             ROR09217
470191*      GO TO S3300-EXIT.                                          ROR09217
470192*                                                                 ROR02128
470193     MOVE SPACES                         TO CUWTHIRD-ACCOUNT-NBR. ROR02128
470194     IF WS-FEDEX                                                  ROR02128
470195        MOVE CORORH-THIRD-PARTY-FRT-ACCOUNT (1:12)                ROR02128
470196                                         TO CUWTHIRD-ACCOUNT-NBR  ROR02128
470197     ELSE                                                         ROR02128
470198        IF WS-AIRBORNE                                            ROR02128
470199           MOVE CORORH-THIRD-PARTY-FRT-ACCOUNT (4:9)              ROR02128
470200                                         TO CUWTHIRD-ACCOUNT-NBR  ROR02128
470201        ELSE                                                      ROR02128
470202           MOVE CORORH-THIRD-PARTY-FRT-ACCOUNT                    ROR02128
470203                                         TO CUWTHIRD-ACCOUNT-NBR. ROR02128
470204*                                                                 ROR02128
470205     MOVE ORH-COMPANY      TO TB-CAR3-CO.                         SXG04030
470206     MOVE CORORH-SHIP-VIA-CARRIER-CODE TO TB-CAR3-CODE.           SXG04030
470207     CALL 'SYU510' USING TB-CARRIER3-TABLE-IA.                    SXG04030
470208*                                                                 SXG04030
470300     IF TB-CAR3-3RD-PARTY-CHECK-DIGIT                             SXG04030
470400        PERFORM CUSTHIRD-CALCULATE-CHECK-DIGIT                    ROR02128
470500        IF CUWTHIRD-VALID OR                                      ROR02128
470600           ORH-AGENCY-ORDER-HANDLE                                ROR02128
470700           MOVE CUWTHIRD-ACCOUNT-NBR  TO                          ROR02128
                                     CORORH-THIRD-PARTY-FRT-ACCOUNT     SS123265
              END-IF                                                    SS123265
           ELSE                                                         SS123265
      *FOR US                                                           SS123265
      *INCLUDE LEADING ZEROES IN THIRD PARTY ACCOUNT NUMBER IF          SS123265
      *THE CARRIER ID IS 'FED'.                                         SS123265
                                                                        SS123265
              IF TC-USA AND TB-CARRIER = 'FED' AND                      SS123265
                 CORORH-THIRD-PARTY-FRT-ACCOUNT > SPACES                SS123265
                 MOVE SPACES            TO CUWTHIRD-ERROR-REASON        SS123265
                 MOVE CORORH-THIRD-PARTY-FRT-ACCOUNT                    SS123265
                                                  TO WS-THPTY-ACCT-NBR  SS123265
                 PERFORM 755-INCLUDE-LEADING-ZEROES                     SS123265
                    THRU 755-EXIT                                       SS123265
              END-IF                                                    SS123265
           END-IF.                                                      SS123265
470900*                                                                 ROR02128
471000*--- VALIDATE 3RD PARTY ACCOUNT USING (SY_THPTY_CARR) --------*   ROR02128
471100*                                                                 ROR02128
471200     IF ORH-AGENCY-ORDER-HANDLE                                   ROR02128
471300        MOVE WS-NEXUS-COMPANY    TO TB-MAFC2-CO                   ROR02128
471400        MOVE WS-NEXUS-BR-NBR-SHIP-FROM                            ROR02128
471500                                 TO TB-MAFC2-SF                   ROR02128
471600        MOVE WS-NEXUS-BILL-TO-BR-NBR                              ROR02128
471700                                 TO TB-MAFC2-BILL-TO-BR           ROR02128
471800        MOVE WS-NEXUS-BILL-TO-CUST-NBR                            ROR02128
471900                                 TO TB-MAFC2-BILL-TO-NBR          ROR02128
472000        MOVE SPACES              TO TB-MAFC2-BILL-TO-SUFFIX       ROR02128
472100        MOVE CORORH-THIRD-PARTY-FRT-ACCOUNT                       ROR02128
472200                                 TO TB-MAFC2-3RD-PARTY-ACCT-NBR-1 ROR02128
472300        MOVE WS-NEXUS-CARRIER-CODE                                ROR02128
472400                                 TO TB-MAFC2-CARRIER-CODE         ROR02128
472500        CALL 'SYU510'            USING TB-MAFC2-TABLE-IA          ROR02128
472600        IF NOT TB-MAFC2-NORESP                                    ROR02128
472700           MOVE 'P'              TO WS-LU6ORH-ERROR-SW            ROR02128
472800           GO TO S3300-EXIT                                       ROR02128
472900        END-IF                                                    ROR02128
473000     ELSE                                                         ROR02128
473100        IF (NOT TB-CAR3-NORESP)  OR                               SXG04030
473200           TB-CAR3-3RD-PARTY-DB2 OR                               SXG04030
473300           (NOT CUWTHIRD-VALID)                                   SXG04030
473400           PERFORM 760-FETCH-WWT3ACT THRU 760-EXIT                TKC05031
473500           IF WS-ERROR-SW = 'Y'                                   ROR02128
473600              GO                 TO S3300-EXIT.                   ROR02128
473700*                                                                 ROR02128
473800     MOVE 'P'                    TO WS-BILL-PAY-SW.               ROR02128
473900*                                                                 ROR02128
474000 S3300-EXIT.  EXIT.                                               ROR02128
474100*                                                                 ROR02128
474200 COPY CUSTHIRD.                                                   SXG04030
474300*                                                                 ROR02128
474400*                                                                 ROR04094
474500 S4000-ZIP-WHSE-LOGIC.                                            ROR04094
474600*                                                                 ROR04094
474700     IF LINK-IN AND                                               ROR04094
474800        NOT ORSH-EXPORT-ORDER                                     ROR04094
474900        PERFORM S4100-VALIDATE-ZIP-WHSE THRU S4100-EXIT.          ROR04094
475000*                                                                 ROR04094
475100     IF NOT WS-LU6ORH-ERROR-ALL-OK                                ROR04094
475200        GO TO S4000-EXIT                                          ROR04094
475300     END-IF.                                                      ROR04094
475400*                                                                 ROR04094
475500     IF TC-CANADA              AND                                ROR04094
475600        CORORH-SHIP-TO-ZIP  GREATER  THAN SPACES                  ROR04094
475700        PERFORM S4200-CANADA-TAX     THRU S4200-EXIT              ROR04094
475800     END-IF.                                                      ROR04094
475900*                                                                 ROR04094
476000 S4000-EXIT.    EXIT.                                             ROR04094
476100*                                                                 ROR04094
476200*                                                                 ROR04094
476300 S4100-VALIDATE-ZIP-WHSE.                                         ROR04094
476400*                                                                 ROR04094
476500     MOVE 'O'                  TO WS-WHERE-SW.                    ROR04094
476600     MOVE ' '                  TO WS-ZONE-ERROR-SW.               ROR04094
476700     MOVE  ORH-BR-NBR          TO  ORSH-BR-NBR-SHIP-FROM.         ROR04094
476800     IF WS-BR-NBR-SHIP-FROM > SPACES                              ROR04094
476900        MOVE WS-BR-NBR-SHIP-FROM TO ORSH-BR-NBR-SHIP-FROM         ROR04094
477000     ELSE                                                         ROR04094
477100        PERFORM S5001-INITIALIZE-BR-SHIP-FROM THRU S5001-EXIT     ROR04094
477200     END-IF.                                                      ROR04094
477300     MOVE TC-COMPANY             TO  TB-CARR-CO.                  ROR04094
477400*                                                                 ROR04094
477500*   MAKE CHANEGS HERE FOR EUCM.                                   ROR08057
477600*    TO ALLOW THE TOPASS IN OT OR BO  FOR  DIRECT SHIP ORDERS     ROR08057
477700*                                                                 PKV09260
477800*   BELOW CHANGE IS MADE AS PART OF 'DIRECT SHIP FREIGHT RECOVERY PKV09260
477900*   2 PROJECT                                                     PKV09260
478000*   CHANGE MADE                                                   PKV09260
478100*   ------------                                                  PKV09260
478200*   INSTEAD OF ALWAYS OVERRIDING THE CARRIER ON THE ORDER WITH    PKV09260
478300*   "OT" / "BO" FOR DIRECT ORDERS, ALLOW OVERRIDE ONLY WHEN       PKV09260
478400*   TB-CPO5-DIRECT-FREIGHT-CALC-SW="2" IS NOT TRUE                PKV09260
478500*                                                                 PKV09260
478600*   IF NO CARRIER IS COMING IN , WHEN DSFR2 IS ON , THEN ASSIGN   ROR10013
478700*   'GR' AS CARRIER ON THE ORDER.                                 ROR10013
478800                                                                  PKV09260
478900     IF  (CORORH-DIRECT-SHIP = 'Y')                               ROR10013
479000     AND TB-CPO5-DIRECT-FREIGHT-CALC2                             ROR10013
479100     AND WS-CARR-NOT-ENTERED                                      ROR10013
479200         MOVE 'GR' TO CORORH-SHIP-VIA-CARRIER-CODE                ROR10013
479300     END-IF.                                                      ROR10013
479400*                                                                 ROR10013
      *    NOT APPLICABLE FOR MOBILE ORDERS , AS THEY SHOULD BEHAVE     ROR19067
      *    THE SAME WAY-WHEN THEY CAME THROUGH RPC/JGATE ROUTE,         ROR19067
      *    EVEN WHEN THEY COME THROUGH SUBSTATION ROUTE- ARMOR PROJECT  ROR19067
      *                                                                 ROR19067
479500     IF (CORORH-DIRECT-SHIP = 'Y')                                ROR10013
479501        AND NOT TB-CPO5-DIRECT-FREIGHT-CALC2                      PKV09260
479502        MOVE 'Y'                  TO ORSH-CARRIER-SW              ROR04094
              IF TB-IL-DS-OVRD-CARR-CD-TO-BO                            SS923251
                 MOVE 'BO'            TO TB-CARR-CODE                   SS923251
                                         ORSH-CARRIER-CODE              SS923251
                                         ORSH-OE-CARRIER-CODE           SS923251
              ELSE                                                      SS923251
                 IF TB-IL-DS-OVRD-CARR-CD-TO-ANY AND                    SS923251
                    CORORH-SHIP-VIA-CARRIER-CODE EQUAL ('BO' OR 'OT')   SS923251
                    MOVE CORORH-SHIP-VIA-CARRIER-CODE                   SS923251
                                      TO TB-CARR-CODE                   SS923251
                                         ORSH-CARRIER-CODE              SS923251
                                         ORSH-OE-CARRIER-CODE           SS923251
                 ELSE                                                   SS923251
                    MOVE 'OT'         TO TB-CARR-CODE                   SS923251
                                         ORSH-CARRIER-CODE              SS923251
                                         ORSH-OE-CARRIER-CODE           SS923251
                 END-IF                                                 SS923251
              END-IF                                                    SS923251
479597        GO TO S4100-EXIT                                          ROR04094
479598     END-IF.                                                      ROR04094
479599*                                                                 ROR04094
479600     MOVE CORORH-SHIP-VIA-CARRIER-CODE                            ROR04094
479601                               TO TB-CARR-CODE                    ROR04094
479602                                  ORSH-CARRIER-CODE               ROR04094
479603                                  ORSH-OE-CARRIER-CODE.           ROR04094
479604*                                                                 ROR04094
479605     IF WS-USE-FRM                                                ROR04094
479606        GO TO S4100-EXIT                                          ROR04094
479700     END-IF.                                                      ROR04094
479800*                                                                 ROR04094
479900*  IF WE GET AN ERROR FROM 4000-VERIFY-CC ROUTINE.....            ROR04094
480000*     IF ITS BASE RATE ORDER...IGNORE THE ERROR...!!!!            ROR04094
480100*      IF IT'S NOT BASE RATE ORDEER...ERROR  RIGHT AWAY... !!!!   ROR04094
480200*                                                                 ROR04094
480210     IF WS-HOLD-ON-ASSIGN-OT = SPACES                             ROR08057
480300        PERFORM F4000-VERIFY-CC-CODE THRU F4000-EXIT.             ROR04094
480400*                                                                 ROR04094
480500     IF WS-ERROR-SW = 'Y'                                         ROR04094
480600        IF ORH-BASE-RATE-ORDER                                    ROR04094
480700           MOVE 'N'               TO WS-ERROR-SW                  ROR04094
480800           IF TC-CANADA AND                                       ROR04094
480900              ORH-COD-ORDER                                       ROR04094
481000              MOVE SPACE          TO WS-ZONE-ERROR-SW             ROR04094
481100           END-IF                                                 ROR04094
481200        ELSE                                                      ROR04094
481300           IF WS-HOLD-ON-ERROR                                    ROR05277
481400              SET WS-HOLD-ON-CARR-ERR TO TRUE                     ROR06075
481500              MOVE 'Y'            TO WS-HOLD-ON-ERROR-TYPE        ROR06075
482000           ELSE                                                   ROR04094
482100              MOVE 'V'            TO WS-LU6ORH-ERROR-SW           ROR04094
482200           END-IF                                                 ROR04094
482300        END-IF                                                    ROR04094
482400     END-IF.                                                      ROR04094
482500*                                                                 ROR04094
482600 S4100-EXIT.    EXIT.                                             ROR04094
482700*                                                                 ROR04094
482800 S4200-CANADA-TAX.                                                ROR04094
482900*                                                                 ROR04094
483000     MOVE TC-COMPANY               TO  WS-CUSHED-CO.              ROR04094
483100     MOVE CORORH-BR-NBR            TO  WS-CUSHED-BR.              ROR04094
483200     MOVE CORORH-CUST-NBR          TO  WS-CUSHED-CUST.            ROR04094
483300     IF CORORH-SUFFIX GREATER THAN SPACES                         ROR04094
483400        MOVE CORORH-SUFFIX         TO  WS-CUSADR-SUFFIX           ROR04094
483500     ELSE                                                         ROR04094
483600        MOVE '000'                 TO  WS-CUSADR-SUFFIX           ROR04094
483700     END-IF.                                                      ROR04094
483800     PERFORM  1002-GU-CUSADR.                                     ROR04094
483900     IF WS-CUSADR-NORESP  AND                                     ROR04094
484000        CUA-TAX-CODE EQUAL ('T' OR 'S')                           ROR04094
484100        MOVE CORORH-SHIP-TO-ZIP    TO  WS-WORK-ZIP-CA             ROR04094
484200        MOVE WS-WORK-ZIP-CA        TO  WS-PSTL-PCODE              ROR04094
484210        MOVE CORORH-SHIP-TO-STATE  TO  WS-STATE-CODE1             WTL12131
484300        PERFORM SA311-CHECK-SHIP-TO-TAX THRU SA311-EXIT.          ROR04094
484400*                                                                 ROR04094
484500 S4200-EXIT.    EXIT.                                             ROR04094
484600*                                                                 ROR04094
484700*                                                                 ROR04094
484800*SA311-CHECK-SHIP-TO-TAX                                          ROR04094
484900 COPY SPS00001.                                                   ROR04094
485000*                                                                 ROR04094
485100*                                                                 ROR04094
485200 SA312-READ-POSTAL-FILE.                                          ROR04094
485300*                                                                 ROR04094
485400     EXEC CICS READ                                               ROR04094
485500          DATASET(WS-PSTL-FILE-NAME)                              ROR04094
485600          RIDFLD (WS-PSTL-RECORD-KEY)                             ROR04094
485700          KEYLENGTH (6)                                           ROR04094
485800          LENGTH(WS-PSTL-MAXLEN)                                  ROR04094
485900          RESP (WS-EIBRESP)                                       ROR04094
486000          INTO (SYPS-MASTER-DATA)                                 ROR04094
486100          END-EXEC.                                               ROR04094
486200*                                                                 ROR04094
486300     IF WS-EIB-NORESP                                             ROR04094
486400        MOVE 'Y'            TO WS-PSTL-FND-SW                     ROR04094
486500     ELSE                                                         ROR04094
486600        MOVE SPACE          TO WS-WORK-ZIP-NUM (WS-CNT)           ROR04094
486700        MOVE WS-WORK-ZIP-CA TO WS-PSTL-PCODE.                     ROR04094
486800*                                                                 ROR04094
486900 SA312-EXIT.                                                      ROR04094
487000     EXIT.                                                        ROR04094
487100*                                                                 ROR04094
487200*                                                                 ROR04094
487300 S5000-UPDATE-ORDER-SHIPMENT.                                     ROR04094
487400*                                                                         
487500*---  CREATE ORDER SHIPMENT HEADER (ORSSHH)                               
487600*                                                                         
487700     MOVE 1                           TO  ORSH-DIST-NBR                   
487800                                          ORSH-SHIP-NBR                   
487900                                          WS-ORSSHH-DIST          TEH02015
488000                                          WS-ORSSHH-SHIP          TEH02015
488100*                                                                         
488200*    IF CORORH-DIRECT-SHIP = 'Y'                                  ROR00199
488300*       MOVE 'D'                      TO  ORSH-ORDER-TYPE         DXO99200
488400*       MOVE 'Y'                      TO  ORSH-CARRIER-SW         SXG03300
488500*    ELSE                                                         DXO99200
488600*    IF ORH-FLOOR-SUF                                                     
488700*       MOVE 'S'                      TO  ORSH-ORDER-TYPE                 
488800*    ELSE                                                                 
488900*       IF ORH-COD-ORDER                                                  
489000*          MOVE 'C'                   TO  ORSH-ORDER-TYPE                 
489100*          MOVE 'Y'                   TO  ORSH-COD-FEE-SW                 
489200*       ELSE                                                              
489303**  THIS IS ENABLED AS PART OF IM360 DE IMPLEMENTATION            PXM20193
489303**  BUT OPENED FOR ALL METHODS                                    PXM20193
489303**  THIS IS TO SET ORDER TYPE AS 'F" FOR FUTURE ORDER             PXM20193
      *          IF  CORORH-ORDER-TYPE = 'F'                            PXM20193
      *          AND CORORH-PROMISE-DATE > SPACES                       PXM20193
      *              MOVE 'F'               TO  ORSH-ORDER-TYPE         PXM20193
      *              SET  ORSH-FUTURE-ORDER TO  TRUE                    PXM20193
      *          ELSE                                                   PXM20193
489300*              MOVE 'S'               TO  ORSH-ORDER-TYPE         PXM20193
      *          END-IF                                                 PXM20193
      *       END-IF                                                    PXM20193
489302*    END-IF.                                                      TEH17307
                                                                        NXC23153
      * MODIFIED IF CONDITION TO AN EVALUATE STATEMENT FOR BETTER       NXC23153
      * READABILITY                                                     NXC23153
      *                                                                 NXC23153
                                                                        NXC23153
           EVALUATE TRUE                                                NXC23153
               WHEN CORORH-DIRECT-ORDER                                 NXC23153
                    MOVE 'D'               TO  ORSH-ORDER-TYPE          NXC23153
                    MOVE 'Y'               TO  ORSH-CARRIER-SW          NXC23153
               WHEN ORH-FLOOR-SUF                                       NXC23153
                    MOVE 'S'               TO  ORSH-ORDER-TYPE          NXC23153
               WHEN ORH-COD-ORDER                                       NXC23153
                    MOVE 'C'               TO  ORSH-ORDER-TYPE          NXC23153
                    MOVE 'Y'               TO  ORSH-COD-FEE-SW          NXC23153
               WHEN CORORH-FUTURE-ORDER                                 NXC23153
                    IF CORORH-PROMISE-DATE > SPACES                     NXC23153
                       MOVE 'F'            TO  ORSH-ORDER-TYPE          NXC23153
                       SET  ORSH-FUTURE-ORDER TO  TRUE                  NXC23153
                    ELSE                                                NXC23153
                       MOVE 'S'            TO  ORSH-ORDER-TYPE          NXC23153
                    END-IF                                              NXC23153
               WHEN CORORH-SPECIAL-ORDER                                NXC23153
                    IF CORORH-FROM-IM360 AND TC-EUROPE                  NXC23153
                       MOVE 'P'            TO  ORSH-ORDER-TYPE          NXC23153
                       SET  ORSH-SPECIAL-ORDER TO  TRUE                 NXC23153
                    ELSE                                                NXC23153
                       MOVE 'S'            TO  ORSH-ORDER-TYPE          NXC23153
                    END-IF                                              NXC23153
               WHEN OTHER                                               NXC23153
                    MOVE 'S'               TO  ORSH-ORDER-TYPE          NXC23153
           END-EVALUATE.                                                NXC23153
                                                                        NXC23153
489303**  OVERLAY ORDER-TYPE FOR SIMULATED ORDERS                       TEH17307
489310     IF CORORH-SIMULATED-ORDER-SW = 'Y'                           TEH17307
489311       IF CORORH-DIRECT-SHIP = 'Y'                                DXB18124
489320        MOVE 'D'                      TO ORSH-ORDER-TYPE          DXB18124
489321       ELSE                                                       DXB18124
489322        MOVE 'Q'                      TO ORSH-ORDER-TYPE          TEH17307
489323       END-IF                                                     DXB18124
489330     END-IF.                                                      TEH17307
489400*                                                                         
489500     MOVE 'D'                         TO  ORSH-FOB-CODE.                  
489600     MOVE 'Y'                         TO  ORSH-NEW-ORD-FLAG.              
489700     IF WS-PROMISE-DATE  >  SPACES                                ROR99135
489800     MOVE WS-PROMISE-DATE1 TO ORSH-PROMISE-DATE                   ROR99135
489900     ELSE                                                         ROR99135
490000     MOVE EIBDATE                     TO  ORSH-PROMISE-DATE       ROR99135
490100     END-IF                                                       ROR99135
490110     IF WS-SCHEDULED-ORDER                                        TEH05069
490120        MOVE ORSH-PROMISE-DATE   TO ORSH-ORIGINAL-PROMISE-DATE    TEH05069
490130     END-IF.                                                      TEH05069
490200     IF TC-NORWAY                                                 ROR00071
490300        MOVE ZEROES                   TO  ORSH-PROMISE-DATE       ROR00071
490400     END-IF                                                       ROR00071
490500     MOVE CORORH-COMPANY              TO  TC-COUNTRY-CODE.        ROK98106
490600     MOVE EIBDATE                TO  SYU1-INPUT-JULIAN-DATE.      ROK98106
490700     PERFORM 9300-FORMAT-CCYYMMDD.                                ROK98106
490800     MOVE WS-CCYYMMDD            TO  ORSH-ENTRY-DATE-CCYYMMDD.    ROK98106
490900     MOVE TC-COMPANY                  TO  ORSH-REL-CO.                    
491000     MOVE WS-CUST-BR-NBR              TO  ORSH-REL-CUST-BR.               
491100     MOVE WS-CUST-NUMBER              TO  ORSH-REL-CUST-NBR.              
491200     MOVE WS-CUST-SUFFIX              TO  ORSH-REL-CUST-SUFF.             
491300*      EBS - EAI INITIATIVE!!                                     ROR11124
491500*   THAN THE DEFAULT SALESMAN ON THE CUSTOMER.                    ROR11124
491600*   IF ENTRY NOT FOUND , THEN USE DEFAULT VALUE FROM CUST DB.     ROR11124
491700*   IF ENTRY FOUND , USE VALUE FROM EMPLOYEE DATABASE..           ROR11124
491800*                                                                 ROR11124
491900     IF CUB-IS-SALESMAN (1) EQUAL ORH-IS-SALESMAN                 ROR11124
492000        MOVE CU-SLS-MGR-CODE          TO  ORSH-SLS-MGR-CODE       ROR11124
492100     ELSE                                                         ROR11124
492200        MOVE ORH-IS-SALESMAN          TO  WS-EMSHED-SLM           ROR11124
492300        MOVE 'I'                      TO  WS-EMSHED-SLM-TY        ROR11124
492400        PERFORM S5000A-EDIT-SALESMAN                              ROR11124
492500        IF (WS-EMSHED-NORESP AND (NOT EMH-DELETE))                ROR11124
492600           MOVE EMH-SLS-MGR-CODE      TO  ORSH-SLS-MGR-CODE       ROR11124
492700        ELSE                                                      ROR11124
492800           MOVE CU-SLS-MGR-CODE       TO  ORSH-SLS-MGR-CODE       ROR11124
492900        END-IF                                                    ROR11124
493000     END-IF.                                                      ROR11124
493001                                                                  ROR11124
493002*    MOVE CU-SLS-MGR-CODE             TO  ORSH-SLS-MGR-CODE.      ROR11124
493003     MOVE CU-INVENTORY-HOLD-SW        TO  ORSH-INVENTORY-HOLD-SW. ROK98173
493004*                                                                         
493005     IF ORH-CONFIGURATION-ORDER                                   MCV94145
493006        SET ORSH-SHIP-COMPLETE        TO  TRUE                    MCV94145
493007     ELSE                                                         MCV94145
493008        MOVE CORORH-BCK-BACKORDER-FLAG                            PXP95004
493009                                      TO  ORSH-BACKORDER-STATUS.  MCV94145
493010     MOVE CUB-PICK-GROUP              TO  ORSH-CUSTOMER-PICK-GROUPMCV94098
493011*                                                                         
493012     IF CU-AUTO-CREDIT-MEMO = 'Y'                                 MCV94098
493013        MOVE 'Y'                 TO  ORSH-CM-APP-FLAG.            MCV94098
493014*                                                                         
493015     MOVE  ORH-BR-NBR                 TO  ORSH-BR-NBR-SHIP-FROM.  VQV94264
493016     IF WS-BR-NBR-SHIP-FROM > SPACES                              SXK96332
493017        AND  NOT ORSH-DIRECT-ORDER                                DXO99314
493018        MOVE WS-BR-NBR-SHIP-FROM TO ORSH-BR-NBR-SHIP-FROM         SXK96332
493100     ELSE                                                         SXK96332
493200        PERFORM S5001-INITIALIZE-BR-SHIP-FROM THRU S5001-EXIT.    SXK96332
493300*                                                                 ROR99015
493400     IF WS-TAX-FLAG  =  'A'                                       ROR99015
493500     MOVE WS-NEXUS-BR-NBR-SHIP-FROM   TO  ORSH-BR-NBR-SHIP-FROM   ROR99015
493600     END-IF.                                                      ROR99015
493700*                                                                 ROR99223
493800     IF  ORH-ACOP-SHIP-FROM-BR > SPACES                           ROR99223
493900     MOVE ORH-ACOP-SHIP-FROM-BR       TO  ORSH-BR-NBR-SHIP-FROM   ROR99223
494000     END-IF.                                                      ROR99223
494100*                                                                 ROR99015
494200*   MAKE CHANGES FOR EUCM HERE.                                   ROR08057
      *    NOT APPLICABLE FOR MOBILE ORDERS , AS THEY SHOULD BEHAVE     ROR19067
      *    THE SAME WAY-WHEN THEY CAME THROUGH RPC/JGATE ROUTE,         ROR19067
      *    EVEN WHEN THEY COME THROUGH SUBSTATION ROUTE- ARMOR PROJECT  ROR19067
494201*    TO ALLOW THE TOPASS IN OT OR BO  FOR  DIRECT SHIP ORDERS     ROR08057
494202     MOVE TC-COMPANY                  TO  TB-CARR-CO.                     
494300     IF ORSH-DIRECT-ORDER                                         ROR01316
494400        AND NOT TB-CPO5-DIRECT-FREIGHT-CALC2                      PKV09260
              IF TB-IL-DS-OVRD-CARR-CD-TO-BO                            SS923251
                 MOVE 'BO'             TO TB-CARR-CODE                  SS923251
              ELSE                                                      SS923251
                 IF TB-IL-DS-OVRD-CARR-CD-TO-ANY AND                    SS923251
                    CORORH-SHIP-VIA-CARRIER-CODE EQUAL ('BO' OR 'OT')   SS923251
                    MOVE CORORH-SHIP-VIA-CARRIER-CODE                   SS923251
                                       TO TB-CARR-CODE                  SS923251
                 ELSE                                                   SS923251
                    MOVE 'OT'          TO TB-CARR-CODE                  SS923251
                 END-IF                                                 SS923251
              END-IF                                                    SS923251
495305     ELSE                                                         ROR01316
495306        MOVE CORORH-SHIP-VIA-CARRIER-CODE                         ROR01316
495307                                      TO  TB-CARR-CODE            ROR01316
495308     END-IF.                                                      ROR01316
495400     MOVE TB-CARR-CODE                TO  ORSH-CARRIER-CODE       ROR01316
495500                                          ORSH-OE-CARRIER-CODE.   ROR01316
495600*                                                                         
495700     CALL 'SYU510'                 USING  TB-CARRIER-TABLE-IA.            
495800*                                                                         
495900*  IF WE HAVE ANY CARRIER PROBLEMS WITH APPLE...                  ROR01316
496000*  DONT OVERLAY THE ORSH-SHIP-VIA..AS  ORIG CARR  IS STORED HERE. ROR01316
496100*  KEEP THE ORDER ON "SF" HOLD..AND SET "XC" AS  NEW CARRIER.     ROR01316
496200*                                                                 ROR01316
496300     IF WS-HOLD-ON-ERROR-TYPE GREATER THAN SPACES                 ROR05277
496310     OR WS-HOLD-ON-ASSIGN-OT  GREATER THAN SPACES                 ROR07030
496400        MOVE CORORH-SHIP-VIA-CARRIER-CODE                         ROR01316
496500                                      TO ORSH-SHIP-VIA            ROR01316
496600        MOVE 'XC'                     TO ORSH-CARRIER-CODE        ROR01316
496700                                         ORSH-OE-CARRIER-CODE     ROR01316
              INITIALIZE OR688-PARM-DATA                                CDL24062
              MOVE 'SF'                     TO OR688-NEW-REASON         CDL24062
              MOVE 'S'                      TO OR688-NEW-STATUS         CDL24062
              PERFORM P020-CHECK-HOLD-SEQUENCE  THRU P020-EXIT          CDL24062
497000     ELSE                                                         ROR01316
497100        MOVE TB-CARR-NAME             TO ORSH-SHIP-VIA            ROR01316
497200     END-IF.                                                      ROR01316
                                                                        PXM20284
           IF WS-OVERRIDE-CARR-DES                                      PXM20284
              MOVE CORORH-CARR-DESC TO  ORSH-SHIP-VIA                   PXM20284
           END-IF.                                                      PXM20284
497300*                                                                 ROR01316
497400     IF CUA-DEF-OUT-FRT-CODE > SPACES                             MCV93293
497500        MOVE CUA-DEF-OUT-FRT-CODE     TO  ORSH-FRT-OUT-CODE       MCV93293
497600        MOVE 'Y'                      TO  ORSH-FO-OVERRIDE-CODE   MCV93293
497700        IF CUA-DEF-OUT-FRT-CODE = 'S'                             MPB95179
497800            MOVE 'B'                  TO  ORSH-FRT-OUT-CODE.      MPB95179
497900*                                                                 ROR01068
498000***********************************************************       ROR01068
498100* FOR UPDATING  FRT-OUT-CODE ON ORDER D.B.... FOR UNITED KINGDOM  ROR01068
498200* SEQ IS ---> SHIP-TO --> BILL-TO .                               ROR01068
498300*   IF  NO  VALUES IN SHIP-TO OR BILL-TO...THEN  DEFAULT TO 'B'.  ROR01068
498400***********************************************************       ROR01068
498500*                                                                 ROR01068
498600     IF TC-UNITED-KINGDOM                                         ROR01068
498700        IF ORSH-FRT-OUT-CODE GREATER THAN SPACES                  ROR01068
498800           NEXT SENTENCE                                          ROR01068
498900        ELSE                                                      ROR01068
499000           IF WS-ST-FRT-OUT-CODE GREATER THAN SPACE               ROR01068
499100              MOVE WS-ST-FRT-OUT-CODE    TO ORSH-FRT-OUT-CODE     ROR01068
499200           ELSE                                                   ROR01068
499300              IF WS-BT-FRT-OUT-CODE GREATER THAN SPACE            ROR01068
499400                 MOVE WS-BT-FRT-OUT-CODE TO ORSH-FRT-OUT-CODE     ROR01068
499500              ELSE                                                ROR01068
499600                 MOVE 'B'                TO ORSH-FRT-OUT-CODE     ROR01068
499700              END-IF                                              ROR01068
499800           END-IF                                                 ROR01068
499900           MOVE 'Y'                      TO ORSH-FO-OVERRIDE-CODE ROR01068
500000           IF ORSH-FRT-OUT-CODE = 'S'                             ROR01068
500100              MOVE 'B'                   TO ORSH-FRT-OUT-CODE     ROR01068
500200           END-IF                                                 ROR01068
500300        END-IF                                                    ROR01068
500400     END-IF.                                                      ROR01068
500500*                                                                 ROR00326
500600*  IF CARR ENTERED IS DIFF THAN DEFAULT--> FRT-OUT-CODE = 'B'     ROR00326
500700*  FOR FULFILLMENT ORDERS ONLY, IF CARRIER IS DIFF THAN DEFAULT   TEH01317
500800*  AND EQ 'OT', RETAIN CUSTOMER DEFAULT SET ABOVE.                TEH01317
500900*                                                                 ROR00326
501000     IF TC-UNITED-KINGDOM                                         ROR00326
501100        IF CORORH-SHIP-VIA-CARRIER-CODE NOT EQUAL                 ROR00326
501200           (WS-ST-DEF-CAR     AND                                 ROR01068
501300            WS-ST-ALT-DEF-CAR AND                                 ROR01068
501400            WS-BT-DEF-CAR     AND                                 ROR01068
501500            WS-BT-ALT-DEF-CAR AND                                 ROR01068
501600            TB-CPO-DEFAULT-CARRIER)                               ROR01068
501700            IF (ORH-FULFILLMENT)                                  TEH01317
501800               IF CORORH-SHIP-VIA-CARRIER-CODE  = 'OT'            TEH01317
501900                  NEXT SENTENCE                                   TEH01317
502000               END-IF                                             TEH01317
502100            END-IF                                                TEH01317
502200            MOVE 'B'                  TO  ORSH-FRT-OUT-CODE       ROR00326
502300        END-IF                                                    ROR00326
502400     END-IF.                                                      ROR00326
502500                                                                  ROK99100
502600     IF CORORH-SYSTEM-ID = 'N' AND                                ROK99100
502700        (CORORH-FRT-OUT-CODE = 'B' OR 'P')                        ROK99100
502800        MOVE CORORH-FRT-OUT-CODE TO ORSH-FRT-OUT-CODE.            ROK99100
502900                                                                  JMW04076
503000*------------------------------------------------------------     DXO99145
503100     MOVE TC-COMPANY                  TO  WS-CARR-CODE(1:2).      JJD95137
503200     MOVE ORSH-CARRIER-CODE           TO  WS-CARR-CODE(3:2).      JJD95137
503300     MOVE 'O'                         TO  WS-WHERE-SW.            JJD95137
503400     MOVE ' '                         TO  WS-ZONE-ERROR-SW.       JJD95137
503500     IF (WS-APO-FPO-ORDER OR NOT ORSH-EXPORT-ORDER)               ROR00080
503600        IF NOT WS-USE-FRM                                         TKC03271
503610          IF WS-HOLD-ON-ASSIGN-OT = SPACES                        ROR08057
503700            PERFORM F4000-VERIFY-CC-CODE THRU F4000-EXIT.         JJD95137
503800     IF TC-CANADA AND                                             ROR02219
503900        ORH-COD-ORDER                                             ROR02219
504000        MOVE SPACE                    TO  WS-ZONE-ERROR-SW        ROR02219
504100     END-IF.                                                      ROR02219
504200     MOVE WS-ZONE-ERROR-SW            TO  ORSH-ZONE-ERROR-SW.     JJD95137
504300     PERFORM 581-FILL-RATE-LSB.                                   PWL96284
504400*                                                                 SXK98205
504500     IF TC-SPAIN OR TC-PORTUGAL                                   VXA19214
504600         MOVE TC-COMPANY         TO  TB-TERMS-CO                  SXK98205
504700         MOVE ORH-TERMS          TO  TB-TERMS-CODE                SXK98205
504800         CALL 'SYU510'        USING  TB-TERMS-TABLE-AI            SXK98205
504900         IF TB-TERMS-NORESP                                       SXK98205
505000             IF TB-TERMS-DISC-CHRG-PCT NUMERIC                    SXK98205
505100*              IF TB-TERMS-DISC-CHRG-PCT < 0                      ROR03210
505200                 MOVE TB-TERMS-DISC-CHRG-PCT                      SXK98205
505300                                 TO  ORSH-TERMS-DISC-CHRG-PCT.    SXK98205
505400                                                                  ROR00090
505900     IF CORORH-THIRD-PARTY-FRT-ACCOUNT  = SPACES                  SXK96332
506000        IF CORORH-SHIP-VIA-CARRIER-CODE > SPACES                  SXK96332
506100           MOVE SPACES       TO  ORSH-THIRD-PARTY-FRT-ACCOUNT.    SXK96332
506200                                                                  SXK96332
506300     IF CORORH-THIRD-PARTY-FRT-ACCOUNT > SPACES                   SXK96332
506400        PERFORM S5002-UPDATE-THIRD-PARTY-FRT THRU S5002-EXIT.     SXK96332
506500*                                                                 ROR05314
      *    IF WS-FRT-OUT-CHG-OK  AND                                    TZM22231
           IF TB-IL-ALLOW-FO-OVERRIDE AND                               TZM22231
506700        CORORH-FRT-OUT-CODE > SPACES                              ROR05314
506800        MOVE 'Y'                  TO ORSH-FO-OVERRIDE-CODE        ROR05314
506801        MOVE CORORH-FRT-OUT-CODE  TO ORSH-FRT-OUT-CODE.           ROR05314
506802*                                                                 ROR99273
506803     IF WS-TELIS-IS-SW1 = 'Y'                                     ROR99273
506804        MOVE  CORORH-CUST-INTERNAL-SALESMAN TO ORH-IS-SALESMAN    ROR99273
506805        MOVE  WS-TELIS-CODE                 TO ORH-TN-SPEC-CD     ROR99273
506900     END-IF.                                                      ROR99273
507000     IF WS-TELIS-IS-SW2 = 'Y'                                     ROR99273
507100        MOVE  CORORH-CUST-INTERNAL-ACCTINFO TO ORH-TN-SPEC-CD     ROR99273
507200     END-IF.                                                      ROR99273
507300**                                                                ROR00140
507400***** HARD CODE FOR 'DS' TYPE ORDERS TO SHIP FROM BR '27' ONLY**  ROR00140
507500        IF CORORH-SYSTEM-ID = 'DS'                                ROR00140
507600           MOVE '27'                   TO  ORSH-BR-NBR-SHIP-FROM  ROR00140
507700        END-IF.                                                   ROR00140
507800**                                                                ROR09195
507900** DBL PROJECT.                                                   ROR09195
508000***** WHEN EVER CARRIER ASSIGNED TO THE ORDER IS "WC",            ROR09195
508100***** FOR AN ORDER PLACED BY A DBL ACCOUNT,                       ROR09195
508200*****   ALWAYS ASSIGN "39" AS DEFAULT AHIPFROMBRANCH FOR ORDER    ROR09195
508300*                                                                 ROR09195
508400     IF  TC-USA                                                   ROR09195
508500     AND CU-SALES-OPS(21)     = 'D'                               ROR09195
508600     AND CU-SALES-OPS(22)     = 'B'                               ROR09195
508700     AND CU-SALES-OPS(23)     = 'L'                               ROR09195
508800     AND (ORSH-CARRIER-CODE = 'WC')                               ROR09195
508900         MOVE '39'                   TO  ORSH-BR-NBR-SHIP-FROM    ROR09195
508901     END-IF.                                                      ROR09195
508902**                                                                ROR00140
508903**                                                                ROR00080
508904***  IF ITS AN EXPORT ORDER..DEFAULT  SHIP-FROM BRANCH MUST HAVE* ROR00080
508905***    A VALUE  ************************************************* ROR00080
508906     IF TC-USA                                                    ROR00115
508907        IF ORSH-EXPORT-ORDER                                      ROR00115
508908        MOVE CORORH-SHIP-VIA-CARRIER-CODE TO ORSH-CARRIER-CODE    ROR00080
508909                                             ORSH-OE-CARRIER-CODE ROR00080
508910           IF CUA-SHIP-FROM > SPACES                              ROR00080
508911              MOVE CUA-SHIP-FROM       TO  ORSH-BR-NBR-SHIP-FROM  ROR00080
508912           END-IF                                                 ROR00080
508913        END-IF                                                    ROR00115
509000        IF ITS-BILL-TO-EXPORT-ORDER                               ROR00199
509100           SET  ORSH-EXPORT-ORDER      TO  TRUE                   ROR00115
509200        END-IF                                                    ROR00115
509300        IF ORSH-EXPORT-ORDER                                      ROR00199
509400* SET FRT-OUT-CODE TO "B" HERE , ONLY IF  ITS  NOT ALREADY "P".   ROR04224
509500           IF ORSH-FRT-OUT-CODE = 'P'                             ROR04224
509600              NEXT SENTENCE                                       ROR04224
509700           ELSE                                                   ROR04224
509800              MOVE 'B'                 TO  ORSH-FRT-OUT-CODE      ROR04224
509900           END-IF                                                 ROR04224
510000*          MOVE 'B'                    TO  ORSH-FRT-OUT-CODE      ROR04224
510100        END-IF                                                    ROR00199
510200     END-IF.                                                      ROR00080
510300                                                                  ROR00080
510400**                                                                ROR10293
510500** PAN EURO PROJECT.                                              ROR10293
510600***** WHEN EVER SHIP-FROM IS SENT IN FOR ORDERS COMING FROM SAP   ROR10293
510700*****  USE THAT VALUE TO OVERLAY THE EXISTING  ONE ..             ROR10293
510800*****     THAT IS DERIVED USING CURRENT LOGIC....                 ROR10293
510900*                                                                 ROR10293
511000     IF ITS-A-SAP-ACCT AND                                        ROR10293
511100        CORORH-SAP-SHIP-FROM GREATER THAN SPACES                  ROR10293
511200        MOVE CORORH-SAP-SHIP-FROM TO ORSH-BR-NBR-SHIP-FROM        ROR10293
511201     END-IF.                                                      ROR10293
511202*                                                                 ROR04094
511203     EVALUATE CORORH-UPS-AOD-SW                                   ROR04094
511204     WHEN 'Y'                                                     ROR10266
511205       MOVE 'Y'                      TO ORH-AOD-SW                ROR10266
511206     WHEN 'N'                                                     ROR04094
511207       IF CU-AOD-VARIABLE                                         ROR04094
511208          MOVE CORORH-UPS-AOD-SW     TO ORH-AOD-SW                ROR04094
511209       ELSE                                                       ROR04094
511210          MOVE CU-UPS-AOD-SW         TO ORH-AOD-SW                ROR04094
511211       END-IF                                                     ROR04094
511212     WHEN SPACE                                                   ROR04094
511300       IF CU-AOD-VARIABLE                                         ROR04094
511400          MOVE 'Y'                   TO ORH-AOD-SW                ROR04094
511500       ELSE                                                       ROR04094
511600          MOVE CU-UPS-AOD-SW         TO ORH-AOD-SW                ROR04094
511700       END-IF                                                     ROR04094
511800     END-EVALUATE.                                                ROR04094
511900*                                                                 ROR04094
512000     IF CORORH-CNFG-HDR-INFO-SW = 'Y'                             NXC17279
512100        MOVE  'Y' TO ORHOF-CNFG-HDR-INFO-SW                       NXC17279
512200     END-IF.                                                      NXC17279
512201                                                                  NXC17279
512202     IF ORH-EU-ORDERS-USE-END-USER AND                            ROR04094
512203        TB-CPO-EUROPEAN-CNTRY                                     ROR04094
512204        PERFORM S5600-LOOKUP-RES-PERCENT THRU S5600-EXIT          ROR04094
512300     END-IF.                                                      ROR04094
512400*                                                                 NXC17174
512500     IF TB-CPO4-INDIA-GST-PROCESS                                 NXC17174
512600        IF TC-COMPANY = ('IA' OR 'LK' OR 'BI')                    NXC17174
512700           PERFORM S5610-SET-GST-SWITCH THRU S5610-EXIT           NXC17174
512800        END-IF                                                    NXC17174
512801     END-IF.                                                      NXC17174
512802                                                                  SXW18152
512803*USMRI PROJECT : CHANGES TO INSERT SHIP-VIA-CODE IN ORSSHH SEGMENTSXW18152
512804*                OF ORDER DATABASE FOR USMRI ORDER.               SXW18152
512805     IF (ORSH-DIRECT-ORDER AND ORH-FROM-HERMES-ORDER AND          SXW18152
512806         CORORH-OPER-ID = 'USMR')                                 SXW18152
512807        MOVE CORORH-CUSTOMER-TO-INGRAM-PO   TO ORSH-SHIP-VIA      SXW18152
512808     END-IF.                                                      SXW18152
512809     IF WS-HOLD-ON-ERR-DEP                                        ABM18216
512810        INITIALIZE OR688-PARM-DATA                                ABM18216
512820        MOVE 'DP'              TO OR688-NEW-REASON                ABM18216
512830        MOVE 'S'               TO OR688-NEW-STATUS                ABM18216
512840        PERFORM P020-CHECK-HOLD-SEQUENCE  THRU P020-EXIT          ABM18216
512850     END-IF.                                                      ABM18216
512860*                                                                 ROR18278
512870*SUPPORT IM360 ORDERING.                                          ROR18278
512880*                                                                 ROR18278
512890*   SINCE WE ONLY NEED THIS VALUE TILL END ORDER  , WE ARE  OKAY  ROR18278
512900*   EVEN IF THIS VALUE GETS OVERLAYED BY OTHER PROCESSES THAT     ROR18278
513000*   WE TRIGGER LATER  LIKE ORP550/ORP560...                       ROR18278
513100*   WE DONT WANT TO DEFINE A NEW FIELD JUST FOR THIS PURPOSE OF   ROR18278
513200*    SAVING AND USING THIS OP ID FOR 1ST ENTRY OF CYCLE STATUS.   ROR18278
513300*                                                                 ROR18278
      *    IF (CORORH-FROM-IM360 OR CORORH-FROM-IMVND OR                RP123251
      *      CORORH-FROM-IMCORE OR CORORH-FROM-CEP OR CORORH-FROM-BRLK) RP123251
           IF TB-IL-USE-OPR-FOR-CYCLE-ENTRY                             RP123251
             AND  CORORH-OPER-ID GREATER THAN SPACES                    VYM23049
513600        MOVE CORORH-OPER-ID TO ORSH-OPER-ID                       ROR18278
513601     END-IF.                                                      ROR18278
513602*                                                                 ROR04094
           IF TC-UNITED-KINGDOM AND WS-TERM-ID-FROM-IM360               AXZ24292
              AND TB-BRN4-UK-COMMS-CARE-BR                              AXZ24292
               MOVE TB-CPO7-UK-COMMSCARE-SF-BR                          AXZ24292
                 TO ORSH-BR-NBR-SHIP-FROM                               AXZ24292
           END-IF.                                                      AXZ24292
      *                                                                 AXZ24292
513603 S5000-EXIT.    EXIT.                                             ROR00080
513604*                                                                         
513605*                                                                 NXC17174
513606 S5610-SET-GST-SWITCH.                                            NXC17174
513607*                                                                 NXC17174
513608     IF WS-SHIP-TO-ADDRESS                                        NXC17174
513609        MOVE SPACE                 TO WS-SHIP-TO-GST-STATE-SW     NXC17174
513610        MOVE CORORH-COMPANY-CODE   TO TB-INT-COMPANY-CODE         NXC17174
513611        MOVE CORORH-SHIP-TO-STATE  TO   TB-INT-STATE-CODE         NXC17174
513612        CALL 'SYU510' USING TB-INT-TABLE-IA                       NXC17174
513613        IF TB-INT-NORESP AND TB-INT-GST-APPLY-SW ='Y'             NXC17174
513614           MOVE 'Y' TO WS-SHIP-TO-GST-STATE-SW                    NXC17174
513615           MOVE TB-INT-STATE-CODE TO                              NXC17174
513616                            WS-ORHOF-INDIA-SHIP-TO-STATE          NXC17174
513617        END-IF                                                    NXC17174
513618     ELSE                                                         NXC17174
513619        IF CORORH-SHIP-TO-SUFFIX > SPACES   AND                   NXC17174
513620           CORORH-SHIP-TO-SUFFIX NOT EQUAL '000'                  NXC17174
513621             MOVE SPACE               TO WS-SHIP-TO-GST-STATE-SW  NXC17174
513622             MOVE CORORH-COMPANY-CODE TO TB-INT-COMPANY-CODE      NXC17174
513623             MOVE WS-ST-STATE-CODE    TO TB-INT-STATE-CODE        NXC17174
513624             CALL 'SYU510' USING TB-INT-TABLE-IA                  NXC17174
513625             IF TB-INT-NORESP AND TB-INT-GST-APPLY-SW ='Y'        NXC17174
513626                MOVE 'Y' TO WS-SHIP-TO-GST-STATE-SW               NXC17174
513700                MOVE TB-INT-STATE-CODE TO                         NXC17174
513800                             WS-ORHOF-INDIA-SHIP-TO-STATE         NXC17174
513900             END-IF                                               NXC17174
514000        ELSE                                                      NXC17174
                IF (CORORH-SUFFIX > SPACES)  OR WS-SUFFIX-000           NXC22077
514200                MOVE SPACE          TO    WS-BILL-TO-GST-STATE-SW NXC17174
514300                MOVE CORORH-COMPANY-CODE TO                       NXC17174
514400                                       TB-INT-COMPANY-CODE        NXC17174
514500                MOVE WS-BT-STATE-CODE TO TB-INT-STATE-CODE        NXC17174
514600                CALL 'SYU510' USING TB-INT-TABLE-IA               NXC17174
514700                IF TB-INT-NORESP            AND                   NXC17174
514800                                  TB-INT-GST-APPLY-SW ='Y'        NXC17174
514900                   MOVE 'Y' TO WS-BILL-TO-GST-STATE-SW            NXC17174
515000                   MOVE TB-INT-STATE-CODE TO                      NXC17174
515100                             WS-ORHOF-INDIA-SHIP-TO-STATE         NXC17174
515200                END-IF                                            NXC17174
515300          END-IF                                                  NXC17174
515400        END-IF                                                    NXC17174
515500     END-IF                                                       NXC17174
515600     IF WS-SHIP-TO-GST-STATE OR                                   NXC17174
515700        WS-BILL-TO-GST-STATE                                      NXC17174
515800        MOVE 'G' TO ORH-INDIA-GST-ORDER-IND                       NXC17174
515900     ELSE                                                         NXC17174
516000        MOVE 'V' TO ORH-INDIA-GST-ORDER-IND                       NXC17174
516100     END-IF.                                                      NXC17174
516200 S5610-EXIT.    EXIT.                                             NXC17174
      ******************************************************************AYB24152
      * S5620-STORE-NBR-RESOLVE - RESOLVES SHIP TO SUFFIX BASED ON THE  AYB24152
      * RESOLVED PARTNER ID AND STORE NUMBER PROVIDED IN THE INPUT.     AYB24152
      ******************************************************************AYB24152
      *                                                                 AYB24152
       S5620-STORE-NBR-RESOLVE.                                         AYB24152
      *                                                                 AYB24152
           PERFORM S5620A-GET-PARTNER-ID THRU S5620A-EXIT.              AYB24152
      *                                                                 AYB24152
           IF PARTNER-FOUND                                             AYB24152
              INITIALIZE EDV414-COMMUNICATIONS-AREA                     AYB24152
              MOVE CORORH-COMPANY        TO EDV414-CO-CD                AYB24152
              MOVE EDV072-PARTNER-ID(1)  TO EDV414-PARTNER-ID           AYB24152
              MOVE CORORH-GLOBAL-LOC-NBR TO EDV414-STOR-NBR             AYB24152
              MOVE CORORH-BR-NBR         TO EDV414-IN-CUST-BR           AYB24152
              MOVE CORORH-CUST-NBR       TO EDV414-IN-CUST-NBR          AYB24152
              MOVE CORORH-SUFFIX         TO EDV414-IN-BILL-TO-SFX       AYB24152
      *                                                                 AYB24152
              CALL 'EDV414' USING EDV414-COMMUNICATIONS-AREA            AYB24152
      *                                                                 AYB24152
              IF NOT EDV414-STATUS-OKAY                                 AYB24152
              THEN                                                      AYB24152
                 MOVE 'S5620-STORE-NBR-RESOLVE'                         AYB24152
                                    TO SYWDB2-EXTRA-MESSAGE-1           AYB24152
                 MOVE '  EDV414 - SELECT ERROR, SQLCODE: '              AYB24152
                                    TO SYWDB2-EXTRA-MESSAGE-2(1:34)     AYB24152
                 MOVE EDV072-SQLCODE                                    AYB24152
                                    TO WS-SQLCODE-MASK                  AYB24152
                 MOVE WS-SQLCODE-MASK                                   AYB24152
                                    TO SYWDB2-EXTRA-MESSAGE-2(35:10)    AYB24152
                 PERFORM 990-SQL-MESSAGE                                AYB24152
                 MOVE '3'              TO  WS-LU6ORH-ERROR-SW           AYB24152
                 MOVE 'G3'             TO  WS-LU6ORH-ERROR-FLAG         AYB24152
              ELSE                                                      AYB24152
                 IF (EDV414-OUT-SHIP-TO-SFX EQUAL TO '???') OR          AYB24152
                    (EDV414-OUT-SHIP-TO-SFX EQUAL TO SPACES)            AYB24152
                    PERFORM S5620C-CALL-EDV031 THRU S5620C-EXIT         AYB24152
                    IF EDV031-STATUS-OKAY                               AYB24152
                       IF (EDV031-ST-STORE-OVRRD-FLG(1) = 'Y')          AYB24152
                          IF CUB-SHIP-TO-SUF NUMERIC                    AYB24152
                             MOVE CUB-SHIP-TO-SUF                       AYB24152
                                               TO CORORH-SHIP-TO-SUFFIX AYB24152
                          ELSE                                          AYB24152
                             IF CUA-DEF-SHIP-TO                         AYB24152
                                MOVE CUA-DEF-SHIP-BILL-TO               AYB24152
                                               TO CORORH-SHIP-TO-SUFFIX AYB24152
                             END-IF                                     AYB24152
                          END-IF                                        AYB24152
                       ELSE                                             AYB24152
                           MOVE '4'            TO  WS-LU6ORH-ERROR-SW   AYB24152
                           MOVE 'G4'           TO  WS-LU6ORH-ERROR-FLAG AYB24152
                       END-IF                                           AYB24152
                    END-IF                                              AYB24152
                 ELSE                                                   AYB24152
                    MOVE EDV414-OUT-SHIP-TO-SFX                         AYB24152
                                               TO CORORH-SHIP-TO-SUFFIX AYB24152
                 END-IF                                                 AYB24152
              END-IF                                                    AYB24152
           END-IF.                                                      AYB24152
       S5620-EXIT.    EXIT.                                             AYB24152
      *                                                                 AYB24152
      ******************************************************************AYB24152
      * S5620A-GET-PARTNER-ID - RESOLVE PARTNER ID BY USING CUST NO.    AYB24152
      ******************************************************************AYB24152
       S5620A-GET-PARTNER-ID.                                           AYB24152
                                                                        AYB24152
           PERFORM S5620B-CALL-EDV072 THRU S5620B-EXIT.                 AYB24152
                                                                        AYB24152
           IF EDV072-STATUS-OKAY                                        AYB24152
             MOVE 'Y' TO WS-PARTNER-FOUND-SW                            AYB24152
           ELSE                                                         AYB24152
               MOVE 'S5620A-GET-PARTNER-ID'                             AYB24152
                 TO SYWDB2-EXTRA-MESSAGE-1                              AYB24152
               MOVE '  EDV072 - SELECT ERROR, SQLCODE: '                AYB24152
                 TO SYWDB2-EXTRA-MESSAGE-2(1:34)                        AYB24152
               MOVE EDV072-SQLCODE                                      AYB24152
                 TO WS-SQLCODE-MASK                                     AYB24152
               MOVE WS-SQLCODE-MASK                                     AYB24152
                 TO SYWDB2-EXTRA-MESSAGE-2(35:10)                       AYB24152
               PERFORM 990-SQL-MESSAGE                                  AYB24152
               MOVE '2'              TO  WS-LU6ORH-ERROR-SW             AYB24152
               MOVE 'G2'             TO  WS-LU6ORH-ERROR-FLAG           AYB24152
           END-IF.                                                      AYB24152
                                                                        AYB24152
       S5620A-EXIT.   EXIT.                                             AYB24152
                                                                        AYB24152
      ******************************************************************AYB24152
      * S5620B-CALL-EDV072 - CALL EDV072 FOR PARTNER ID RESOLUTION.     AYB24152
      ******************************************************************AYB24152
       S5620B-CALL-EDV072.                                              AYB24152
      *                                                                 AYB24152
           INITIALIZE EDV072-COMMUNICATIONS-AREA.                       AYB24152
                                                                        AYB24152
           EVALUATE CORORH-COMPANY                                      AYB24152
             WHEN 'MD'                                                  AYB24152
               MOVE 'US'           TO EDV072-KEY-CO-CD                  AYB24152
             WHEN 'FT'                                                  AYB24152
               MOVE 'CA'           TO EDV072-KEY-CO-CD                  AYB24152
             WHEN 'RS'                                                  AYB24152
               MOVE 'MS'           TO EDV072-KEY-CO-CD                  AYB24152
             WHEN OTHER                                                 AYB24152
               MOVE CORORH-COMPANY TO EDV072-KEY-CO-CD                  AYB24152
           END-EVALUATE.                                                AYB24152
                                                                        AYB24152
           MOVE 'IMPULS' TO EDV072-KEY-SRCE-SYS-ID.                     AYB24152
                                                                        AYB24152
           STRING CORORH-COMPANY, CORORH-BR-NBR, CORORH-CUST-NBR, '000' AYB24152
             DELIMITED BY SIZE INTO EDV072-KEY-SRCE-SYS-KEY-ID.         AYB24152
                                                                        AYB24152
           SET  EDV072-SELECT TO TRUE.                                  AYB24152
                                                                        AYB24152
      ** EDV072 IS CALLED TO GET PARTNER ID FROM THE DB2 TABLE          AYB24152
      ** IE_PID_SRC_SYS_XRF.                                            AYB24152
                                                                        AYB24152
           CALL 'EDV072' USING EDV072-COMMUNICATIONS-AREA.              AYB24152
      *                                                                 AYB24152
       S5620B-EXIT. EXIT.                                               AYB24152
      *                                                                 AYB24152
      ******************************************************************AYB24152
      * S5620C-CALL-EDV031 - CALL EDV031 FOR READ PO SWITCH.            AYB24152
      ******************************************************************AYB24152
       S5620C-CALL-EDV031.                                              AYB24152
      *                                                                 AYB24152
           INITIALIZE EDV031-COMMUNICATIONS-AREA.                       AYB24152
           MOVE EDV414-CO-CD      TO EDV031-KEY-CO-CD.                  AYB24152
           MOVE EDV414-PARTNER-ID TO EDV031-KEY-PARTNER-ID.             AYB24152
                                                                        AYB24152
           SET EDV031-SELECT TO TRUE.                                   AYB24152
           CALL 'EDV031' USING EDV031-COMMUNICATIONS-AREA.              AYB24152
           IF EDV031-STATUS-OKAY                                        AYB24152
              NEXT SENTENCE                                             AYB24152
           ELSE                                                         AYB24152
               MOVE 'S5620C-CALL-EDV031'                                AYB24152
                 TO SYWDB2-EXTRA-MESSAGE-1                              AYB24152
               MOVE '  EDV031 - SELECT ERROR, SQLCODE: '                AYB24152
                 TO SYWDB2-EXTRA-MESSAGE-2(1:34)                        AYB24152
               MOVE EDV031-SQLCODE                                      AYB24152
                 TO WS-SQLCODE-MASK                                     AYB24152
               MOVE WS-SQLCODE-MASK                                     AYB24152
                 TO SYWDB2-EXTRA-MESSAGE-2(35:10)                       AYB24152
               PERFORM 990-SQL-MESSAGE                                  AYB24152
               MOVE '2'              TO  WS-LU6ORH-ERROR-SW             AYB24152
               MOVE 'G2'             TO  WS-LU6ORH-ERROR-FLAG           AYB24152
           END-IF.                                                      AYB24152
      *                                                                 AYB24152
       S5620C-EXIT. EXIT.                                               AYB24152
516300*                                                                 ROR11124
516400 S5000A-EDIT-SALESMAN.                                            ROR11124
516500*                                                                 ROR11124
516600     IF NOT WS-DLI-SCHEDULED                                      ROR11124
516700         PERFORM 980-SCHEDULE-DLI.                                ROR11124
516800*                                                                 ROR11124
516900     MOVE TC-COMPANY             TO WS-EMSHED-SLM-CO.             ROR11124
517000*    MOVE TC-BR-NBR              TO WS-EMSHED-SLM-BR.             ROR11124
517100     MOVE WS-CUST-BR-NBR         TO WS-EMSHED-SLM-BR.             ROR11124
517200     IF WS-EMSHED-SLM EQUAL ZEROS                                 ROR11124
517300     OR WS-EMSHED-SLM EQUAL SPACES                                ROR11124
517400         MOVE 'N'                TO WS-EMSHED-SLM-IO-SW           ROR11124
517500     ELSE                                                         ROR11124
517600         PERFORM 1600-GU-EMSHED.                                  ROR11124
517700*                                                                 ROR11124
517701 S5000A-EXIT. EXIT.                                               ROR11124
517702*                                                                 SXK96332
517703 S5001-INITIALIZE-BR-SHIP-FROM.                                   SXK96332
517704     IF CUA-SHIP-FROM > ZEROES                                    VQV94264
517705        MOVE CUA-SHIP-FROM         TO  ORSH-BR-NBR-SHIP-FROM      VQV94264
517706     ELSE                                                         VQV94264
517707        MOVE WS-CUST-BR-NBR        TO  ORSH-BR-NBR-SHIP-FROM.     VQV94264
517708                                                                  VQV94264
517709     IF WS-SHIP-TO-ADDRESS                                        MCV95136
517710        AND NOT ORSH-EXPORT-ORDER                                 ROR00080
517711        PERFORM Z9000-ZIPBR THRU Z9000-EXIT                       PWL96284
517712        IF WS-BR-NBR-SHIP-FROM > SPACES                           SXK98180
517713        AND  NOT ORSH-DIRECT-ORDER                                DXO99314
517714           MOVE WS-BR-NBR-SHIP-FROM TO ORSH-BR-NBR-SHIP-FROM.     SXK98180
517715                                                                  VQV94264
517716     IF ORH-CONFIGURATION-ORDER                                   VQV94264
517717        MOVE '0'                    TO  WS-BP-REC-SEQ             VQV94264
517718        MOVE ORSH-BR-NBR-SHIP-FROM  TO  WS-BP-BR-NBR              VQV94264
517719        MOVE TC-COMPANY             TO  WS-BP-COMPANY             VQV94264
517720        PERFORM    S5500-READ-BPMAST THRU S5500-EXIT              ROR02344
517721        IF WS-BP-NORESP                                           VQV94264
517722           MOVE  BP-BR-NBR-CONFIG   TO ORSH-BR-NBR-SHIP-FROM      VQV94264
517723        ELSE                                                      VQV94264
517724           MOVE  '10'               TO WS-BP-BR-NBR               VQV94264
517725           PERFORM    S5500-READ-BPMAST THRU S5500-EXIT           ROR02344
517726           IF WS-BP-NORESP                                        VQV94264
517727             MOVE  BP-BR-NBR-CONFIG TO ORSH-BR-NBR-SHIP-FROM      VQV94264
517728           ELSE                                                   VQV94264
517729             MOVE  '10'             TO ORSH-BR-NBR-SHIP-FROM.     VQV94264
517730 S5001-EXIT.    EXIT.                                             SXK96332
517731*                                                                         
517732 S5002-UPDATE-THIRD-PARTY-FRT.                                    SXK96332
517733************************************************************      SXK96332
517734* CHG THIRD PARTY FREIGHT ACCOUNT FOR DELL                 *      SXK96332
517735************************************************************      SXK96332
517736                                                                  SXK96332
517737     IF CORORH-THIRD-PARTY-FRT-ACCOUNT EQUAL ZEROES               ROR00313
517738           MOVE SPACES       TO  ORSH-THIRD-PARTY-FRT-ACCOUNT     ROR00313
517739           MOVE CORORH-THIRD-PARTY-FRT-ACCOUNT                    ROR00313
517740                             TO  ORSH-THIRD-PARTY-FRT-ACCOUNT     ROR00313
517741           MOVE 'B'              TO  ORSH-FRT-OUT-CODE            ROR00313
517742           MOVE 'Y'              TO  ORSH-FO-OVERRIDE-CODE        ROR00313
517743     ELSE                                                         ROR00313
517744           MOVE SPACES       TO  ORSH-THIRD-PARTY-FRT-ACCOUNT     SXK96332
517745           MOVE CORORH-THIRD-PARTY-FRT-ACCOUNT                    SXK96332
517746                             TO  ORSH-THIRD-PARTY-FRT-ACCOUNT     SXK96332
517747           MOVE WS-BILL-PAY-SW   TO  ORSH-FRT-IN-CODE             SXK96332
517748                                     ORSH-FRT-OUT-CODE            SXK96332
517749           MOVE 'Y'              TO  ORSH-FO-OVERRIDE-CODE.       SXK96332
517750                                                                  SXK96332
517751     IF BP-EXPORT-BR                                              SXK96332
517752        IF CORORH-SHIP-VIA-CARRIER-CODE > SPACES                  SXK96332
517800           IF TB-CARR-FFRD-Y                                      SXK96332
517900              MOVE 'Y'         TO ORSH-FREIGHT-FWRD-IND           SXK96332
518000           ELSE                                                   SXK96332
518100              MOVE 'N'         TO ORSH-FREIGHT-FWRD-IND.          SXK96332
518200                                                                  SXK96332
518300 S5002-EXIT.     EXIT.                                            SXK96332
518400*                                                                         
518500 S5500-READ-BPMAST.                                               VQV94264
518600*                                                                 VQV94264
518700     MOVE 'Y'                         TO  WS-BP-IO-SW.            VQV94264
518800     MOVE WS-BP-MAXLEN                TO  WS-BP-REC-LENGTH.       VQV94264
518900*                                                                 VQV94264
519000     EXEC CICS READ                                               VQV94264
519100         FILE   (WS-BP-FILE-NAME)                                 VQV94264
519200         INTO   (BP-BPRMST)                                       VQV94264
519300         RIDFLD (WS-BP-KEY)                                       VQV94264
519400         LENGTH (WS-BP-REC-LENGTH)                                VQV94264
519500         RESP   (WS-EIBRESP)                                      VQV94264
519600         END-EXEC                                                 VQV94264
519700*                                                                 VQV94264
519800     IF WS-EIB-NORESP                                             VQV94264
519900        MOVE 'Y'                 TO  WS-BP-IO-SW                  VQV94264
520000     ELSE                                                         VQV94264
520100        IF WS-EIB-NOTFND                                          VQV94264
520200           MOVE 'N'              TO  WS-BP-IO-SW.                 VQV94264
520300                                                                          
520400*                                                                         
520500 S5500-EXIT. EXIT.                                                ROR02344
520600*------------------                                               ROR02344
520700*------------------                                               ROR02344
520800 S5600-LOOKUP-RES-PERCENT.                                        ROR02344
520900*                                                                 ROR02344
521000* WE PERFORM THE BELOW LOGIC ONLY FOR EUROPEAN SELECT SOURCE      ROR02344
521100*      PER KEN CARLSON 11/27/02.                                  ROR02344
521200*                                                                 ROR02344
521300* GET THE RESELLER PERCENT FROM THE RESELLER CUSTOMER RECORD.     ROR02344
521400*                                                                 ROR02344
521500     MOVE ZEROES                    TO ORH-RESELLER-SPLIT-PCT     ROR04094
521600*                                                                 ROR04094
521700     MOVE TC-COMPANY                TO  WS-CUSHED-CO.             ROR02344
521800     MOVE ORH-RESELLER-NBR          TO  WS-CUSHED-BR-CUST.        ROR02344
521900     PERFORM 1000-GU-CUSHED.                                      ROR02344
522000     IF WS-CUSHED-NORESP                                          ROR02344
522100        MOVE ORH-RESELLER-NBR(1:2)  TO  WS-CUSBRN-BR              ROR02344
522200        PERFORM 1004-GU-CUSBRN                                    ROR02344
522300        IF WS-CUSBRN-NORESP                                       ROR02344
522400           IF CUB-RESELLER-SPLIT-PCT NUMERIC                      ROR02344
522500              MOVE CUB-RESELLER-SPLIT-PCT                         ROR02344
522600                                    TO  ORH-RESELLER-SPLIT-PCT    ROR02344
522700           END-IF                                                 ROR02344
522800        END-IF                                                    ROR02344
522900     END-IF.                                                      ROR02344
523000*                                                                 ROR02344
523100* GET THE END USER PRECENT FROM ENDUSER CUSTOMER RECORD.          ROR02344
523200*  ENDUSER PERCENT,IF GREATER THAN ZERO WILL OVERRIDE             ROR02344
523300*      RESELLER PERCENT.                                          ROR02344
523400*                                                                 ROR02344
523500     MOVE CORORH-BR-NBR             TO  WS-CUSHED-BR.             ROR02344
523600     MOVE CORORH-CUST-NBR           TO  WS-CUSHED-CUST.           ROR02344
523700     PERFORM 1000-GU-CUSHED.                                      ROR02344
523800     IF WS-CUSHED-NORESP                                          ROR02344
523900        MOVE CORORH-BR-NBR          TO  WS-CUSBRN-BR              ROR02344
524000        PERFORM 1004-GU-CUSBRN                                    ROR02344
524100        IF WS-CUSBRN-NORESP                                       ROR02344
524200           IF CUB-RESELLER-SPLIT-PCT NUMERIC                      ROR02344
524300              IF CUB-RESELLER-SPLIT-PCT > 0                       ROR02344
524400                 MOVE CUB-RESELLER-SPLIT-PCT                      ROR02344
524500                                    TO  ORH-RESELLER-SPLIT-PCT    ROR02344
524600              END-IF                                              ROR02344
524700           END-IF                                                 ROR02344
524800        END-IF                                                    ROR02344
524900     END-IF.                                                      ROR02344
525000*                                                                 ROR02344
525100 S5600-EXIT.    EXIT.                                             ROR02344
525200***                                                               ROR04094
525300***                                                               ROR04094
525400 S5650-INSERT-ORDER-SEGMENTS.                                     ROR04094
525500*                                                                 ROR04094
525600     PERFORM S5700-INSERT-ORSHED THRU S5700-EXIT.                 ROR04094
525700*                                                                 ROR04094
525800     PERFORM S5750-INSERT-ORSSHH THRU S5750-EXIT.                 ROR04094
525900*                                                                 ROR04094
526000     PERFORM S5780-INSERT-ORSSTO THRU S5780-EXIT.                 ROR04094
526100*                                                                 ROR17111
526101     PERFORM S5950-WRITE-TO-AUDIT-LOG THRU S5950-EXIT.            ROR17111
526102*                                                                 ROR04094
526200 S5650-EXIT.                                                      ROR04094
526300***                                                               ROR04094
526400***                                                               ROR04094
526500 S5700-INSERT-ORSHED.                                             ROR04094
526600*                                                                 ROR04094
526700     MOVE 'ORSHED   '              TO  WS-UNQUAL-SSA.             ROR04094
526800     MOVE SPACES                   TO  WS-ORSHED-IO-SW.           ROR04094
526900     MOVE TC-COMPANY               TO  WS-ORSHED-CO.              ROR04094
527000     MOVE WS-CUST-BR-NBR           TO  WS-ORSHED-BR.              ROR04094
527100     PERFORM S5710-INSERT-ORSHED   THRU  S5710-EXIT               ROR04094
527200             UNTIL WS-ORSHED-NORESP.                              ROR04094
527300*                                                                 ROR04094
527400     PERFORM S5720-INSERT-ORSHEDOF THRU  S5720-EXIT.              ROR04094
527500*                                                                 ROR04094
527600 S5700-EXIT.                                                      ROR04094
527700***                                                               ROR04094
527800***                                                               ROR04094
527900 S5710-INSERT-ORSHED.                                             ROR04094
528000*                                                                 ROR04094
528100     INITIALIZE SY601-PARM-DATA.                                  ROR04094
528200     MOVE CU-USE-ALPHA-ORD-SW                                     ROR04094
528300                             TO SY601-CU-ALPHA-ORD-SW.            ROR04094
528400     MOVE TC-COMPANY         TO SY601-COMPANY.                    ROR04094
528500     MOVE WS-CUST-BR-NBR     TO SY601-BR-NBR.                     ROR04094
528600     MOVE 'U'                TO SY601-ORDER-PROCESS-MODE.         ROR04094
528700     MOVE LENGTH OF SY601-PARM-DATA                               ROR04094
528800                             TO SY601-AREA-LENGTH.                ROR04094
528900     EXEC CICS LINK                                               ROR04094
529000         PROGRAM (SY601-CNV-PROGRAM)                              ROR04094
529100         COMMAREA (SY601-PARM-DATA)                               ROR04094
529200         LENGTH (SY601-AREA-LENGTH)                               ROR04094
529300         RESP(WS-EIBRESP)                                         ROR04094
529400         END-EXEC                                                 ROR04094
529500         IF  WS-EIB-NORESP AND                                    ROR04094
529600             SY601-NORESP                                         ROR04094
529700             MOVE SY601-ORDER-NBR TO ORH-ORDER-NBR                ROR04094
529800                                     WS-ORSHED-NBR                ROR04094
529900             MOVE CORORH-BCK-BACKORDER-FLAG                       ROR04094
530000                                  TO  ORH-BACKORDER-STATUS        ROR04094
530100             MOVE 'Y'             TO  ORH-IN-PROGRESS-SW          ROR04094
530200             PERFORM 1332-ISRT-ORSHED                             ROR04094
530300         ELSE                                                     ROR04094
530400             MOVE '5710'         TO WS-ABCODE                     ROR04094
530500             MOVE EIBRCODE       TO WS-STATUS                     ROR04094
530600             PERFORM 999-ABEND.                                   ROR04094
530700*                                                                 ROR04094
530800 S5710-EXIT.                                                      ROR04094
530900***                                                               ROR04094
531000***                                                               ROR04094
531100 S5720-INSERT-ORSHEDOF.                                           ROR04094
531200*                                                                 ROR04094
531300     INITIALIZE ORHOF-ORSHEDOF-0.                                 ROR04094
531400     MOVE ZERO                TO ORHOF-ORSHEDOF-KEY-0.            ROR04094
531500     MOVE WS-GRP1-PO-BOX-IND  TO ORHOF-PO-BOX-IND.                ROR04094
531600     MOVE CUOF-WAIVE-FRT-REC-CHRG-SW                              ROR08241
531601                              TO ORHOF-WAIVE-FRT-REC-CHRG-SW.     ROR08241
531602*                                                                 ROR04116
531603     IF (WS-DROPSHIP-MD-SW = 'Y'  OR                              ROR17111
531604         WS-DROPSHIP-FT-SW = 'Y') AND                             ROR17111
531605         TB-COD1-NORESP                                           ROR17111
531606         MOVE WS-ORHOF-C1-GENERAL-ADDR-RC TO                      ROR17111
531607              ORHOF-C1-GENERAL-ADDR-RC                            ROR17111
531608         MOVE WS-ORHOF-C1-SUFFIX-MATCH-RC TO                      ROR17111
531609              ORHOF-C1-SUFFIX-MATCH-RC                            ROR17111
531610         MOVE WS-ORHOF-C1-CORRECTNESS-IND TO                      ROR17111
531620              ORHOF-C1-CORRECTNESS-IND                            ROR17111
531630         MOVE WS-ORHOF-C1-DIRECT-MATCH-RC TO                      ROR17111
531640              ORHOF-C1-DIRECT-MATCH-RC                            ROR17111
531650         MOVE WS-ORHOF-C1-APTMNT-MTCH-RC TO                       ROR17111
531660              ORHOF-C1-APTMNT-MTCH-RC                             ROR17111
531670     END-IF.                                                      ROR17111
531700*   WE WILL BE HAVING CUSTOMER SENT VALUE IN THIS FIELD.          ROR04116
531800*    WILL HAVE  VALUE OF 'N' IF CUSTOMER DIDNT SEND ANYTHING.     ROR04116
531900*                                                                 ROR04116
532000     IF CORORH-DV-FLAG > SPACE                                    ROR04116
532100        MOVE CORORH-DV-FLAG   TO ORHOF-DV-SW                      ROR04116
532200     ELSE                                                         ROR04116
532300        MOVE 'N'              TO ORHOF-DV-SW                      ROR04116
532400     END-IF.                                                      ROR04116
532500*                                                                 ROR04116
532600     IF CORORH-CSN > SPACES                                       PKV09266
532700        MOVE CORORH-CSN TO ORHOF-HP-CSN                           PKV09266
532800     END-IF.                                                      PKV09266
532900*                                                                 ROR10266
533000* FOR AIR CARR ORDERS COMING IN WITH SUN LOGIC TO BE TURNED ON    ROR10266
533100*  AT ORDER LEVEL , SAVE THE IND ON ORSHEDOF SEGMENT.             ROR10266
533200*  THIS ORHOF- FIELD WILL BE USED IN ORP673.                      ROR10266
533300*                                                                 ROR10266
533400     MOVE ORSH-CARRIER-CODE   TO WS-CARR-CODE(3:2).               ROR10266
533500     IF WS-CARR-AIR AND                                           ROR10266
533600        CORORH-USE-OPEN-WHSE-SEQ                                  ROR10266
533700        SET ORHOF-USE-OPEN-WHSE-SEQ TO TRUE                       ROR10266
533800     END-IF.                                                      ROR10266
533900                                                                  PKV09266
534000* FOR INDIA GST PROJECT                                           NXC17174
534100     IF TB-CPO4-INDIA-GST-PROCESS                                 NXC17174
534200        MOVE WS-ORHOF-INDIA-SHIP-TO-STATE  TO                     NXC17174
534300                                       ORHOF-INDIA-SHIP-TO-STATE  NXC17174
534400     END-IF.                                                      NXC17174
534500     IF  CORORH-OMP-ORDER-NUMBER  > SPACES                        FXS17217
534501         MOVE CORORH-OMP-ORDER-NUMBER                             FXS17217
534502                              TO ORHOF-OMP-ORDER-NUMBER           FXS17217
534503     END-IF.                                                      FXS17217
534504     IF CORORH-EU-DEP-ID > SPACES                                 ABM18097
534505        MOVE CORORH-EU-DEP-ID TO ORHOF-EU-DEP-ID                  ABM18097
534506     END-IF.                                                      ABM18097
534507     IF CORORH-DEP-ORDER-NBR  > SPACES                            ABM18097
534508        MOVE CORORH-DEP-ORDER-NBR TO ORHOF-DEP-ORDER-NBR          ABM18097
534509     END-IF.                                                      ABM18097
           IF CORORH-EMAIL-ADDRESS > SPACES                             FYT19263
              SET ORHOF-RSLR-EMAIL-EXIST-Y TO TRUE                      FYT19263
           END-IF.                                                      FYT19263
      *CODE CHANGES SPECIFIC TO IM360 TO UPDATE QUOTE ID IN ORSHEDOF    AZN20094
      *   WE NEED THIS FOR RENEWVUE, ORM470 SCREEN VERIFIED             RP120241
      *   CAPTURING QUOTE ID FOR QUOTE MANAGER ORDERING TOO             RP121100
      *    IF (WS-TERM-ID-FROM-IM360 OR WS-TERM-ID-FROM-IMRNV OR        TZM22231
      *        WS-TERM-ID-FROM-HERMES OR WS-TERM-ID-FROM-IMVND OR       TZM22231
      *        WS-TERM-ID-FROM-IMCORE OR WS-TERM-ID-FROM-API-SIMPLI)    TZM22231
           IF TB-IL-UPDT-QUOTE-NBR                                      TZM22231
             IF CORORH-QUOTE-ID > SPACES                                AZN20094
                MOVE CORORH-QUOTE-ID TO ORHOF-IM360-QUOTE-NBR           AZN20094
             END-IF                                                     AZN20094
           END-IF.                                                      AZN20094
153937*** CHANGES FOR CISCO NER PRICING ******                          MS220220
           IF WS-NP-ORDER-IND                                           MS221281
153940        MOVE CORORH-NP-ORDER-IND  TO ORHOF-NP-ORDER-IND           MS220220
155301     END-IF.                                                      MS221009
      *-----DPAS LOGIC - CAPTURE DPAS-CODE----*                         BYA21100
           IF CORORH-DPAS-CODE > SPACES AND                             BYA21100
              TB-CPO7-DPAS-COMPANY-SW = 'Y'                             BYA21100
              MOVE CORORH-DPAS-CODE     TO ORHOF-DPAS-ORDER-IND         BYA21100
              MOVE CORORH-DPAS-PGM-ID   TO ORHOF-DPAS-PGM-ID            BYA21127
           END-IF.                                                      BYA21100
                                                                        BYA21100
      *-----HPE-CTO LOGIC-CAPTURE PO-CONFIRM-FLAG-----*                 JZP21169
           IF CORORH-PO-CONFIRM-FLAG > SPACES AND                       JZP21169
              ORHOF-IM360-QUOTE-NBR  > SPACES AND                       JZP21169
      *       (WS-TERM-ID-FROM-IM360 OR WS-TERM-ID-FROM-BRLK OR         SK824062
      *        WS-TERM-ID-FROM-IMCORE OR WS-TERM-ID-FROM-X4A) AND       SK824062
              TB-IL-PO-CONFIRM-FLAG-DRCT AND                            SK824062
              ORSH-DIRECT-ORDER                                         JZP21169
              MOVE CORORH-PO-CONFIRM-FLAG TO ORHOF-PO-CONFIRM-FLAG      JZP21169
           END-IF.                                                      JZP21169
                                                                        JZP21169
      ***---CISCO WARRANTY PROJECT---                                   BYA23153
      ***FLAG = P: POST-SALE WARRANTY BEING LINKED TO OPEN HW ORDER     BYA23153
      ***FLAG = R: STANDALONE WARR-ORDER(FROM CCWR I.E. RENEWAL ORDER)  BYA23153
           IF CORORH-POSTSALE-HWLINK-IND > SPACES                       BYA23153
              MOVE CORORH-POSTSALE-HWLINK-IND                           BYA23153
                                       TO ORHOF-POSTSALE-HWLINK-IND     BYA23153
           END-IF.                                                      BYA23153
                                                                        BYA23153
      ***---CISCO CCW-R PROJECT------                                   KXS25010
      ***FLAG = 'R' ORDERS WITH CISCO CCW-R SKUS                        KXS25010
      ***FLAG = 'C' ORDERS WITH CISCO CCW   SKUS                        KXS25010
      ***FLAG = 'B' ORDERS WITH BOTH  CCW AND CCW-R SKUS                KXS25010
           MOVE CORORH-CISCO-ORD-SW TO ORHOF-CISCO-ORD-SW.              KXS25010
534510     MOVE ORHOF-ORSHEDOF-0    TO ORHOF-ORSHEDOF.                  ROR04094
534511     MOVE 'ORSHEDOF '         TO WS-UNQUAL-SSA.                   ROR04094
534512     PERFORM 1333-ISRT-ORSHEDOF.                                  ROR04094
534513*                                                                 ROR04094
534514 S5720-EXIT.                                                      ROR04094
534515     EXIT.                                                        ROR04094
534516***                                                               ROR04094
534517***                                                               ROR04094
534518 S5750-INSERT-ORSSHH.                                             ROR04094
534519*                                                                 ROR04094
534520     MOVE 'ORSSHH   '              TO  WS-UNQUAL-SSA              ROR04094
534521     PERFORM 1334-ISRT-ORSSHH                                     ROR04094
534522*                                                                 ROR04094
534523     INITIALIZE ORSHOF-ORSSHHOF-0.                                ROR04094
534524     MOVE ZERO                     TO ORSHOF-ORSSHHOF-KEY-0.      ROR04094
534525     INITIALIZE                       ORSHOF-SIZE                 ROR04094
534526                                      ORSHOF-SIZE-SHP-CMP.        ROR04094
534527                                                                  PKV09266
534528* ALLOW ORDER REQ'S COMING FROM SUBSTATION TO UPDT ECOD AMT       PKV09266
      *    NOT APPLICABLE FOR MOBILE ORDERS , AS THEY SHOULD BEHAVE     ROR19067
      *    THE SAME WAY-WHEN THEY CAME THROUGH RPC/JGATE ROUTE,         ROR19067
      *    EVEN WHEN THEY COME THROUGH SUBSTATION ROUTE- ARMOR PROJECT  ROR19067
534530     IF (CORORH-ECOD-AMT IS NUMERIC) AND                          PKV09266
534540        (CORORH-ECOD-AMT > ZEROS)    AND                          PKV09266
              (TB-IL-ALW-FROM-SUBSTATION                                TZM22231
               AND NOT TB-IL-MOBILE-APP)                                TZM22231
      *       (WS-FROM-SUBSTATION                                       TZM22231
      *        AND NOT WS-TERM-ID-FROM-WEB-MOBILE)                      TZM22231
534560        MOVE CORORH-ECOD-AMT          TO ORSHOF-ECOD-AMT          PKV09266
534570     END-IF.                                                      PKV09266
534571                                                                  PKV09266
      *-----DPAS LOGIC - CAPTURE DELIVERY-DATE-----*                    BYA21100
           IF CORORH-DPAS-CODE > SPACES AND                             BYA21100
              TB-CPO7-DPAS-COMPANY-SW = 'Y'                             BYA21100
              MOVE WS-ORSHOF-EDD-CCYYDDD TO ORSHOF-EDD                  BYA21100
           END-IF.                                                      BYA21100
                                                                        BYA21100
      *    XVS LITE - FULFILLMENT DATE FOR HUNGARY.                     NXC23153
      *    SET THE CONTRACT TYPE FLAG FOR FULFILLMENT DATE CALCUALTION  NXC23153
           IF CORORH-CONTRACT-TYPE > SPACES AND                         NXC23153
              ORH-FROM-XVS-LITE AND                                     NXC23153
              TB-CP07-FULFILLMENT-DATE-Y                                NXC23153
              MOVE CORORH-CONTRACT-TYPE  TO ORSHOF-CONTRACT-TYPE        NXC23153
           END-IF.                                                      NXC23153
                                                                        NXC23153
      * SET CREDIT CHECK EXPECTED TO TRUE WHEN CUSTOMER AND CORPORATE   JYP26198
      * LEVEL IS ENABLED FOR CREDIT ENGINE                              JYP26198
           IF TB-CPO7-CRDT-CHK-API AND                                  JYP26198
              WS-CUSHEDOF-NORESP   AND                                  JYP26198
              CUOF-CRED-CHK-API                                         JYP26198
              SET ORSHOF-CRE-API-EXPECTED TO TRUE                       JYP26198
           END-IF                                                       JYP26198
534572*    SET THIS SWITCH TO NOTIFY THE DEP ORDER IS KEPT ON HOLD.     ABM18216
534573     IF WS-HOLD-ON-ERR-DEP                                        ABM18216
534574        MOVE 'Y'           TO ORSHOF-APPLE-DEP-HOLD-SW            ABM18216
534575     END-IF.                                                      ABM18216
534576     MOVE ORSHOF-ORSSHHOF-0        TO ORSHOF-ORSSHHOF.            ROR04094
534577     MOVE 'ORSSHHOF '              TO WS-UNQUAL-SSA.              ROR04094
534578     PERFORM 1335-ISRT-ORSSHHOF.                                  ROR04094
534600*                                                                 ROR04094
534700 S5750-EXIT.                                                      ROR04094
534800     EXIT.                                                        ROR04094
534900***                                                               ROR04094
535000***                                                               ROR04094
535100 S5780-INSERT-ORSSTO.                                             ROR04094
535200*                                                                 ROR04094
535300     IF WS-SHIP-TO-ADDRESS-SPCL  = 'Y'                            TKC07345
535400     OR WS-SHIP-TO-ATTNAME-SPCL  = 'Y'                            TKC07345
535500        PERFORM S5900-INSERT-ADDR-ORSSTO THRU S5900-EXIT          TKC07345
535501     ELSE                                                         TKC07345
535502        IF (WS-SHIP-TO-ADDRESS) OR (CORORH-SHIP-TO-ATTN > SPACES) TEH04135
535503           PERFORM S5800-INSERT-ADDR-ORSSTO THRU S5800-EXIT       ROR04094
535504        END-IF                                                    TKC07345
535505     END-IF.                                                      ROR04094
535600*                                                                 ROR04094
535700***  ADD EMAIL ADDRESS IN ORSSTO I2 SEGMENT FOR NON DIRECT ORDER  ROR04094
535800*                                                                 ROR04094
535900* FOR TRANSACTIONS COMING FROM SUBSTATION ,                       ROR08057
536000*  ALWAYS UPDATE EMAIL ADDRESS ON ORDER , IF THEY SEND ONE.       ROR08057
536100*  UPDATING ONLY FOR NON-DIRECTSHIP ,WAS  CODED BASED ON          ROR08057
536200*    REQUIREMENT FROM WEB.                                        ROR08057
      *    NOT APPLICABLE FOR MOBILE ORDERS , AS THEY SHOULD BEHAVE     ROR19067
      *    THE SAME WAY-WHEN THEY CAME THROUGH RPC/JGATE ROUTE,         ROR19067
      *    EVEN WHEN THEY COME THROUGH SUBSTATION ROUTE- ARMOR PROJECT  ROR19067
536201*                                                                 ROR08057
536202     IF CORORH-EMAIL-ADDRESS > SPACES                             TKC08093
536203        MOVE 'ORSSTO   '       TO WS-UNQUAL-SSA                   ROR04094
536204        MOVE SPACES            TO ORSA-ORSSTO                     ROR04094
536300        MOVE 'I'               TO ORSA-SEGMENT-TYPE               ROR04094
      *REVAMPING THE BELOW CODE, TO BE IN SYNC AFTER PROJECT ARMOR      FYT19263
              IF (CORORH-TERM-ID(1:3) = 'WEB')                          FYT19263
                 IF CORORH-DIRECT-SHIP   = 'Y'                          FYT19263
                    MOVE 1           TO ORSA-LINE-OF-ADDR               FYT19263
                 ELSE                                                   FYT19263
                    MOVE 2           TO ORSA-LINE-OF-ADDR               FYT19263
                 END-IF                                                 FYT19263
              ELSE                                                      FYT19263
                    MOVE 1           TO ORSA-LINE-OF-ADDR               FYT19263
              END-IF                                                    FYT19263
536400*       IF CORORH-DIRECT-SHIP   = 'Y'                             FYT19263
      *       OR (WS-FROM-SUBSTATION                                    FYT19263
      *           AND NOT WS-TERM-ID-FROM-WEB-MOBILE)                   FYT19263
536600*           MOVE 1             TO ORSA-LINE-OF-ADDR               FYT19263
536601*       ELSE                                                      FYT19263
536602*           MOVE 2             TO ORSA-LINE-OF-ADDR               FYT19263
536603*       END-IF                                                    FYT19263
              MOVE SPACES            TO WS-FRMT-EMAIL-ADDR              NXC21050
536604        IF CORORH-EMAIL-ADDRESS-EXTN > SPACES                     NXC17041
536605            MOVE CORORH-EMAIL-ADDRESS                             NXC17041
                                     TO WS-FRMT-EMAIL-ADDR(1:50)        NXC21050
536607            MOVE CORORH-EMAIL-ADDRESS-EXTN                        NXC17041
                                     TO WS-FRMT-EMAIL-ADDR(51:28)       NXC21050
536609        ELSE                                                      NXC17041
                  MOVE CORORH-EMAIL-ADDRESS TO WS-FRMT-EMAIL-ADDR       NXC21050
536611        END-IF                                                    NXC17041
      *                                                                 NXC21050
              PERFORM 322A-EMAIL-PERFORM-INSPECT                        NXC21050
                 THRU 322A-EMAIL-EXIT                                   NXC21050
              MOVE WS-FRMT-EMAIL-ADDR TO ORSA-CUSTOMER-EMAIL            NXC21050
      *                                                                 NXC21050
536612        PERFORM 1348-ISRT-ORSSTO                                  ROR04094
536700     END-IF.                                                      ROR04094
536800*                                                                 ROR04094
536900* IMMOBILITY - UK PROJECT.                                        ROR14038
537000*  AS LONG AS DELIVERY NOTIFICATION EMAIL FIELD IS COMING IN      ROR14038
537100*  WITH A VALUE , UPDATE 'W1' ORSSTO SEGMENT WITH IT.             ROR14038
537200*                                                                 ROR14038
537300     IF CORORH-DELI-NOTIF-EMAIL > SPACES                          ROR14038
537400        MOVE 'ORSSTO   '       TO WS-UNQUAL-SSA                   ROR14038
537500        MOVE SPACES            TO ORSA-ORSSTO                     ROR14038
537600        MOVE 'W'               TO ORSA-SEGMENT-TYPE               ROR14038
537700        MOVE 1                 TO ORSA-LINE-OF-ADDR               ROR14038
              MOVE SPACES            TO WS-FRMT-EMAIL-ADDR              NXC21050
              MOVE CORORH-DELI-NOTIF-EMAIL TO WS-FRMT-EMAIL-ADDR        NXC21050
              PERFORM 322A-EMAIL-PERFORM-INSPECT                        NXC21050
                 THRU 322A-EMAIL-EXIT                                   NXC21050
              MOVE WS-FRMT-EMAIL-ADDR TO ORSA-WEB2-CUST-EMAIL           NXC21050
537900        PERFORM 1348-ISRT-ORSSTO                                  ROR14038
538000     END-IF.                                                      ROR14038
538100*                                                                 ROR15009
538200* SUPPORT SE23445 ##                                              ROR15009
538300*  AS LONG AS SMS NUMBER FIELD IS COMING IN WITH A VALUE,         ROR15009
538400*  UPDATE "Z1" ORSSTO SEGMENT WITH IT.                            ROR15009
538500*                                                                 ROR15009
538600     IF CORORH-SMS-NUMBER > SPACES                                ROR15009
538700        MOVE 'ORSSTO   '       TO WS-UNQUAL-SSA                   ROR15009
538800        MOVE SPACES            TO ORSA-ORSSTO                     ROR15009
538900        MOVE 'Z'               TO ORSA-SEGMENT-TYPE               ROR15009
539000*  HAVE TO REVISIT THIS , TO GET PROPER FIELD NAME.               ROR15009
539100        MOVE 1                 TO ORSA-LINE-OF-ADDR               ROR15009
539200        MOVE CORORH-SMS-NUMBER TO ORSA-ADDRESS                    ROR15009
539300        PERFORM 1348-ISRT-ORSSTO                                  ROR15009
539400     END-IF.                                                      ROR15009
539401*                                                                 ROR14038
539402 S5780-EXIT.                                                      ROR04094
539403     EXIT.                                                        ROR04094
539404***                                                               ROR04094
539405***                                                               ROR04094
539406 S5800-INSERT-ADDR-ORSSTO.                                        ROR04094
539407*                                                                 ROR04094
539408     MOVE 'ORSSTO   '                   TO  WS-UNQUAL-SSA.        ROR02344
539409*---------------------                                            ROR02344
539410***--- ATTENTION LINE.                                            ROR02344
539411*---------------------                                            ROR02344
539412     IF CORORH-SHIP-TO-ATTN GREATER THAN SPACES                   ROR02344
539413        MOVE SPACES                     TO  ORSA-ORSSTO           ROR02344
539414        MOVE '0'                        TO  ORSA-SEGMENT-TYPE     ROR02344
539415        MOVE 1                          TO  ORSA-LINE-OF-ADDR     ROR02344
539416        MOVE CORORH-SHIP-TO-ATTN        TO  ORSA-ADDRESS          ROR02344
539417                                            CORORH-R-SHIP-TO-ATTN PKV09301
539418        PERFORM 1348-ISRT-ORSSTO.                                 ROR02344
539419     IF WS-NO-SHIP-TO-ADDRESS                                     TEH04135
539420        GO TO S5800-EXIT.                                         TEH04135
539421*------------------------------                                   ROR02344
539422***--- ADDRESS LINES 1 , 2 , 3.                                   ROR02344
539423*------------------------------                                   ROR02344
539424*                                                                 ROR02344
539425*  WE ARE ADDING THIS LOGIC TO HANDLE FIRM-NAME FOR SARCOM ONLY.  ROR02344
539426*   IF SARCOM SENDS IN FIRMNAME ,                                 ROR02344
539427*    WE  MOVE FIRMNAME THAT THEY SEND TO ORSSTO '11'              ROR02344
539428*        MOVE ADDRESS-LINE1 THAT THEY SEND TO ORSSTO '12'         ROR02344
539500*        MOVE ADDRESS-LINE2 THAT THEY SEND TO ORSSTO '13'         ROR02344
539600*        WE IGNORE  WHAT THEY SEND IN ADDRESS-LINE3   &           ROR02344
539700*          SARCOM IS OKAY WITH ABOVE CHANGE.                      ROR02344
539800*  HAVE TO MODIFY THE LOGIC AND COPYBOOK  WHEN WE  GO FOR VER 4.  ROR02344
539900*                                                                 ROR02344
540000     IF WS-SARCOM AND                                             ROR02344
540100        CORORH-FIRM-NAME GREATER THAN SPACES                      ROR02344
540200        PERFORM S5810-INSERT-ADDRESS-SEGMENTS THRU S5810-EXIT     ROR02344
540300     ELSE                                                         ROR02344
540400        PERFORM S5820-INSERT-ADDRESS-SEGMENTS THRU S5820-EXIT     ROR02344
540500     END-IF.                                                      ROR02344
540600*------------------------------                                   ROR02344
540700***--- ADDRESS 4   CITY / STATE / ZIP  /GEOCODE / CNTRY CODE      ROR02344
540800*------------------------------                                   ROR02344
540900     MOVE SPACES                        TO  ORSA-ORSSTO.          ROR02344
541000     MOVE '1'                           TO  ORSA-SEGMENT-TYPE.    ROR02344
541100     MOVE 4                             TO  ORSA-LINE-OF-ADDR.    ROR02344
541200*                                                                 ROR02344
541300     INSPECT CORORH-SHIP-TO-CITY REPLACING ALL '_' BY ' '         ROR02344
541400     MOVE CORORH-SHIP-TO-CITY           TO ORSA-CITY.             ROR02344
541500*                                                                 ROR02344
541600     IF CORORH-SHIP-TO-STATE GREATER THAN SPACES                  ROR02344
541700        MOVE CORORH-SHIP-TO-STATE       TO ORSA-STATE             ROR02344
541800        IF CORORH-SHIP-TO-STATE = 'XX'                            ROR02344
541900           IF CORORH-SHIP-TO-CNTRY-CODE = 'CA'                    ROR02344
542000              MOVE CORORH-SHIP-TO-ZIP   TO ORSA-ZIP               ROR02344
542100           ELSE                                                   ROR02344
542200              MOVE '000000001'          TO ORSA-ZIP               ROR02344
542300           END-IF                                                 ROR02344
542400        END-IF                                                    ROR02344
542500     END-IF.                                                      ROR02344
542600*                                                                 ROR02344
542700     IF TC-EUROPE                                                 ROR03156
542800        PERFORM S5830-UPDATE-EUROPE-ZIP THRU S5830-EXIT           ROR03156
542900     ELSE                                                         ROR03156
543000        IF TC-CANADA                                              ROR03156
543100           MOVE SPACES                 TO ORSA-ZIP                ROR03156
543200           MOVE WS-ZIP-CODEX           TO ORSA-ZIP                ROR03156
543300        ELSE                                                      ROR03156
543400           MOVE WS-ZIP-CODE            TO ORSA-ZIP                ROR03156
543500        END-IF                                                    ROR03156
543600     END-IF.                                                      ROR03156
543700                                                                  ROR03156
545300*                                                                 ROR04162
545400*  CORORH-SHIP-TO-CNTRY-CODE WILL NEVER BE SPACES FOR US , FT     ROR04162
545500*   AS WE  UPDATE THIS FIELD WITH TB-CO-VAL-CNTRY-CODE,           ROR04162
545600*    IF NO VALUE IS COMMING IN.                                   ROR04162
545700*                                                                 ROR02344
545800     IF CORORH-SHIP-TO-CNTRY-CODE GREATER THAN SPACES             ROR02344
545900        MOVE CORORH-SHIP-TO-CNTRY-CODE  TO ORSA-COUNTRY-CODE      ROR02344
546000        IF TC-USA                                                 ROR02344
546100           MOVE WS-EXP-ST-CNTRY-CODE    TO ORSA-COUNTRY-CODE      ROR02344
546200        END-IF                                                    ROR02344
546300     ELSE                                                         ROR02344
546400        MOVE CORORH-COMPANY-CODE        TO ORSA-COUNTRY-CODE      ROR02344
547200     END-IF.                                                      ROR02344
547300*                                                                 ROR02344
547400     PERFORM 1348-ISRT-ORSSTO.                                    ROR02344
547500*                                                                 ROR02344
547600 S5800-EXIT. EXIT.                                                ROR02344
547700***                                                               ROR02344
547800***                                                               ROR02344
547900 S5810-INSERT-ADDRESS-SEGMENTS.                                   ROR02344
548000*-- WE COME HERE ONLY FOR SARCOM ORDERS  THAT  HAVE FIRM NAME.    ROR02344
548100*---------------                                                  ROR02344
548200***--- FIRMNAME                                                   ROR02344
548300*---------------                                                  ROR02344
548400     MOVE SPACES                      TO  ORSA-ORSSTO.            ROR02344
548500     MOVE '1'                         TO  ORSA-SEGMENT-TYPE.      ROR02344
548600     MOVE 1                           TO  ORSA-LINE-OF-ADDR.      ROR02344
548700     MOVE CORORH-FIRM-NAME            TO  ORSA-ADDRESS.           ROR02344
548800     PERFORM 1348-ISRT-ORSSTO.                                    ROR02344
548900*---------------                                                  ROR02344
549000***--- ADDRESS 1                                                  ROR02344
549100*---------------                                                  ROR02344
549200     MOVE SPACES                      TO  ORSA-ORSSTO.            ROR02344
549300     MOVE '1'                         TO  ORSA-SEGMENT-TYPE.      ROR02344
549400     MOVE 2                           TO  ORSA-LINE-OF-ADDR.      ROR02344
549500     MOVE CORORH-SHIP-TO-ADDRESS-1    TO  ORSA-ADDRESS.           ROR02344
549600     PERFORM 1348-ISRT-ORSSTO.                                    ROR02344
549700*---------------                                                  ROR02344
549800***--- ADDRESS 2                                                  ROR02344
549900*---------------                                                  ROR02344
550000     MOVE SPACES                      TO  ORSA-ORSSTO.            ROR02344
550100     MOVE '1'                         TO  ORSA-SEGMENT-TYPE.      ROR02344
550200     MOVE 3                           TO  ORSA-LINE-OF-ADDR.      ROR02344
550300     MOVE CORORH-SHIP-TO-ADDRESS-2    TO  ORSA-ADDRESS.           ROR02344
550400     PERFORM 1348-ISRT-ORSSTO.                                    ROR02344
550500*                                                                 ROR02344
550600 S5810-EXIT. EXIT.                                                ROR02344
550700***                                                               ROR02344
550800***                                                               ROR02344
550900 S5820-INSERT-ADDRESS-SEGMENTS.                                   ROR02344
551000*                                                                 ROR02344
551100*---------------                                                  ROR02344
551200***--- ADDRESS 1 AND FIRM NAME                                    TKC07345
551300*---------------                                                  ROR02344
551400     MOVE SPACES                      TO  ORSA-ORSSTO.            ROR02344
551500     MOVE '1'                         TO  ORSA-SEGMENT-TYPE.      ROR02344
551600     MOVE 0                           TO  ORSA-LINE-OF-ADDR.      TKC07345
551700                                                                  TKC07345
551800     IF WS-FIRM-NAME-IN > SPACES                                  TKC07345
551900        ADD  1                         TO ORSA-LINE-OF-ADDR       TKC07345
552000        MOVE CORORH-FIRM-NAME          TO ORSA-ADDRESS            TKC07345
552100        PERFORM 1348-ISRT-ORSSTO.                                 TKC07345
552200                                                                  TKC07345
552300     IF CORORH-SHIP-TO-ADDRESS-1 > SPACES                         TKC07345
552301        ADD 1                          TO ORSA-LINE-OF-ADDR       TKC07345
552302        MOVE CORORH-SHIP-TO-ADDRESS-1  TO ORSA-ADDRESS            TKC07345
552303        PERFORM 1348-ISRT-ORSSTO.                                 ROR02344
552304*---------------                                                  ROR02344
552305***--- ADDRESS 2                                                  ROR02344
552306*---------------                                                  ROR02344
552307     IF CORORH-SHIP-TO-ADDRESS-2 > SPACES                         TKC07345
552308        ADD 1                          TO ORSA-LINE-OF-ADDR       TKC07345
552500        MOVE CORORH-SHIP-TO-ADDRESS-2  TO ORSA-ADDRESS            TKC07345
552600        PERFORM 1348-ISRT-ORSSTO.                                 ROR02344
552700*---------------                                                  ROR02344
552800***--- ADDRESS 3                                                  ROR02344
552900*---------------                                                  ROR02344
552910     IF CORORH-SHIP-TO-ADDRESS-3 > SPACES                         TKC07345
553000        IF ORSA-LINE-OF-ADDR < 3                                  TKC07345
553100           MOVE 3                        TO ORSA-LINE-OF-ADDR     TKC07345
553110        ELSE                                                      TKC07345
553200           MOVE 5                        TO ORSA-LINE-OF-ADDR     TKC07345
553210        END-IF                                                    TKC07345
553300        MOVE CORORH-SHIP-TO-ADDRESS-3    TO ORSA-ADDRESS          TKC07345
553400        PERFORM 1348-ISRT-ORSSTO.                                 ROR02344
553500*                                                                 ROR02344
553600 S5820-EXIT. EXIT.                                                ROR02344
553700***                                                               ROR02344
553800***                                                               ROR02344
553900 S5830-UPDATE-EUROPE-ZIP.                                         ROR03156
554000*                                                                 ROR03156
554200     IF WS-TO-COUNTRY-CODE = 'UK' OR 'IE' OR 'GB'                 TKC04099
554300        MOVE SPACES                     TO ORSA-ZIP               ROR03156
554400        MOVE WS-ZIP-CODEX               TO ORSA-ZIP               ROR03156
554500     ELSE                                                         TKC04099
554600        MOVE SPACES                     TO ORSA-ZIP               ROR06194
554601        MOVE WS-EUR-POSTAL              TO ORSA-ZIP               ROR06194
554602     END-IF.                                                      ROR03156
554700*                                                                 ROR03156
554800* COMMENTED THIS BELOW CODE AS WE ARE NOT HAVING SPECIAL LOGIC    ROR06194
554900*   FOR NETHERLANDS ANYMORE.                                      ROR06194
554901*                                                                 ROR06194
554902*    IF TC-NETHERLANDS                                            ROR06194
554903*       EVALUATE CORORH-SHIP-TO-CNTRY-CODE                        ROR06194
555000*       WHEN 'UK'                                                 ROR06194
555100*           MOVE SPACES                 TO ORSA-ZIP               ROR06194
555200*           MOVE WS-ZIP-CODEX           TO ORSA-ZIP               ROR06194
555300*       WHEN OTHER                                                ROR06194
555400*           MOVE SPACES                 TO ORSA-ZIP               ROR06194
555500*           MOVE WS-EUR-POSTAL          TO ORSA-ZIP               ROR06194
555600*       END-EVALUATE                                              ROR06194
555700*    ELSE                                                         ROR06194
555800*       MOVE SPACES                     TO ORSA-ZIP               ROR06194
555900*       MOVE WS-EUR-POSTAL              TO ORSA-ZIP               ROR06194
556000*    END-IF.                                                      ROR06194
556100*                                                                 ROR03156
556200 S5830-EXIT. EXIT.                                                ROR03156
556300***                                                               ROR03156
556400 S5900-INSERT-ADDR-ORSSTO.                                        TKC07194
556500                                                                  TKC07194
556600     MOVE 'ORSSTO  '                  TO WS-UNQUAL-SSA            TKC07194
556700     MOVE SPACES                      TO ORSA-ORSSTO              TKC07194
556800     MOVE 'G'                         TO ORSA-SEGMENT-TYPE.       TKC07194
556900                                                                  TKC07194
557000     IF CORORH-SHIP-TO-ATTN-2BY NOT = SPACES                      TKC07194
557100        MOVE 5                        TO ORSA-LINE-OF-ADDR        TKC07194
557200        MOVE 1                        TO ORSA-CODEPAGE            TKC07194
557300        MOVE CORORH-SHIP-TO-ATTN-2BY  TO ORSA-INT-ADDR            TKC07194
557400                                         CORORH-R-SHIP-TO-ATTN    PKV09301
557500        PERFORM 1348-ISRT-ORSSTO.                                 TKC07194
557600                                                                  TKC07194
557700     IF CORORH-SHIP-TO-NAME-2BY NOT = SPACES                      TKC07194
557800        MOVE 0                        TO ORSA-LINE-OF-ADDR        TKC07194
557900        MOVE 1                        TO ORSA-CODEPAGE            TKC07194
558000        MOVE CORORH-SHIP-TO-NAME-2BY  TO ORSA-INT-ADDR            TKC07194
558100        PERFORM 1348-ISRT-ORSSTO.                                 TKC07194
558200                                                                  TKC07194
558300     IF CORORH-SHIP-TO-ADDRESS-1-2BY NOT = SPACES                 TKC07194
      *       MOVE 1                             TO ORSA-LINE-OF-ADDR   VXA21261
              MOVE 3                             TO ORSA-LINE-OF-ADDR   VXA21261
558500        MOVE 1                             TO ORSA-CODEPAGE       TKC07194
558600        MOVE CORORH-SHIP-TO-ADDRESS-1-2BY  TO ORSA-INT-ADDR       TKC07194
558700                                           CORORH-R-ADDRESS-LINE1 TKC07194
558800        PERFORM 1348-ISRT-ORSSTO.                                 TKC07194
558900                                                                  TKC07194
559000     IF CORORH-SHIP-TO-ADDRESS-2-2BY NOT = SPACES                 TKC07194
      *       MOVE 2                             TO ORSA-LINE-OF-ADDR   VXA21261
              MOVE 4                             TO ORSA-LINE-OF-ADDR   VXA21261
559200        MOVE 1                             TO ORSA-CODEPAGE       TKC07194
559300        MOVE CORORH-SHIP-TO-ADDRESS-2-2BY  TO ORSA-INT-ADDR       TKC07194
559400                                           CORORH-R-ADDRESS-LINE2 TKC07194
559500        PERFORM 1348-ISRT-ORSSTO.                                 TKC07194
559600                                                                  TKC07194
      *    IF CORORH-SHIP-TO-ADDRESS-3-2BY NOT = SPACES                 VXA21261
      *       MOVE 3                             TO ORSA-LINE-OF-ADDR   VXA21261
      *       MOVE 1                             TO ORSA-CODEPAGE       VXA21261
      *       MOVE CORORH-SHIP-TO-ADDRESS-3-2BY  TO ORSA-INT-ADDR       VXA21261
      *                                          CORORH-R-ADDRESS-LINE3 VXA21261
      *       PERFORM 1348-ISRT-ORSSTO.                                 VXA21261
      *                                                                 VXA21261
      *    IF CORORH-SHIP-TO-ADDRESS-4-2BY NOT = SPACES                 VXA21261
      *       MOVE 4                             TO ORSA-LINE-OF-ADDR   VXA21261
      *       MOVE 1                             TO ORSA-CODEPAGE       VXA21261
      *       MOVE CORORH-SHIP-TO-ADDRESS-4-2BY  TO ORSA-INT-ADDR       VXA21261
      *                                          CORORH-R-ADDRESS-LINE4 VXA21261
      *       PERFORM 1348-ISRT-ORSSTO.                                 VXA21261
                                                                        VXA21261
           IF CORORH-SHIP-TO-CITY-NAME-2BY NOT = SPACES                 VXA21261
              MOVE 2                             TO ORSA-LINE-OF-ADDR   VXA21261
              MOVE 1                             TO ORSA-CODEPAGE       VXA21261
              MOVE CORORH-SHIP-TO-CITY-NAME-2BY  TO ORSA-INT-ADDR       VXA21261
      *                                          CORORH-R-ADDRESS-LINE3 VXA21261
              PERFORM 1348-ISRT-ORSSTO.                                 VXA21261
                                                                        VXA21261
           IF CORORH-SHIP-TO-PROVINCE-2BY NOT = SPACES                  VXA21261
              MOVE 1                             TO ORSA-LINE-OF-ADDR   VXA21261
              MOVE 1                             TO ORSA-CODEPAGE       VXA21261
              MOVE CORORH-SHIP-TO-PROVINCE-2BY   TO ORSA-INT-ADDR       VXA21261
      *                                          CORORH-R-ADDRESS-LINE4 VXA21261
              PERFORM 1348-ISRT-ORSSTO.                                 VXA21261
                                                                        VXA21261
561100     IF CORORH-SHIP-TO-ADDRESS-5-2BY NOT = SPACES                 TKC07194
561200        MOVE 6                             TO ORSA-LINE-OF-ADDR   TKC07194
561300        MOVE 1                             TO ORSA-CODEPAGE       TKC07194
561400        MOVE SPACES                        TO ORSA-INT-ADDR       TKC07194
561500        IF CORORH-SHIP-TO-PHONE-2BY  NOT = SPACES                 TKC07194
561600           MOVE CORORH-SHIP-TO-PHONE-2BY   TO ORSA-I-PHONE        TKC07194
561700                                              CORORH-R-PHONE-SPL  TKC07194
561800        END-IF                                                    TKC07194
561900        IF CORORH-SHIP-TO-FAX-2BY    NOT = SPACES                 TKC07194
562000           MOVE CORORH-SHIP-TO-FAX-2BY     TO ORSA-I-FAX          TKC07194
562100                                              CORORH-R-FAX-SPL    TKC07194
562200        END-IF                                                    TKC07194
562300        IF CORORH-SHIP-TO-MOBILE-2BY NOT = SPACES                 TKC07194
562400           MOVE CORORH-SHIP-TO-MOBILE-2BY  TO ORSA-I-MOBILE       TKC07194
562500                                              CORORH-R-MOBILE-SPL TKC07194
562600        END-IF                                                    TKC07194
562700        IF CORORH-SHIP-TO-ZIP-2BY    NOT = SPACES                 TKC07194
562800           MOVE CORORH-SHIP-TO-ZIP-2BY     TO ORSA-I-ZIP          TKC07194
562900                                              CORORH-R-ZIP-SPL    TKC07194
563000        END-IF                                                    TKC07194
563100        IF CORORH-SHIP-TO-CNTRY-2BY  NOT = SPACES                 TKC07194
563200           MOVE CORORH-SHIP-TO-CNTRY-2BY   TO ORSA-I-CNTRY        TKC07194
563300                                              CORORH-R-CNTRY-SPL  TKC07194
563400        END-IF                                                    TKC07194
563500        PERFORM 1348-ISRT-ORSSTO.                                 TKC07194
563600                                                                  TKC07194
563700     IF CORORH-SHIP-TO-ZIP-2BY       NOT = SPACES                 TKC07194
563800        MOVE SPACES                        TO ORSA-ADDRESS        TKC07194
563900        MOVE CORORH-SHIP-TO-ZIP-2BY        TO ORSA-ZIP            TKC07194
564000        MOVE '1'                           TO ORSA-SEGMENT-TYPE   TKC07194
564100        MOVE  4                            TO ORSA-LINE-OF-ADDR   TKC07194
564200        PERFORM 1348-ISRT-ORSSTO.                                 TKC07194
564300                                                                  TKC07194
564301 S5900-EXIT.  EXIT.                                               TKC07194
564302***                                                               ROR03156
564303 S5950-WRITE-TO-AUDIT-LOG.                                        ROR17111
564304*                                                                 ROR17111
564305******************************************************************ROR17111
564306* AUDIT FILE LOGGING IF CODE1 IS CALLED.                          ROR17111
564307******************************************************************ROR17111
564308*                                                                 ROR17111
564309     IF TB-CPO2-GRP1-CODE1-ENABLED                                ROR17111
564310        IF TB-COD1-NORESP                                         ROR17111
564320           IF TB-COD1-AUDIT-ENABLED                               ROR17111
564330              IF WS-AUDIT-CODE1-SW = 'Y'                          ROR17111
564340                 PERFORM S5951-INIT-CODE1-AUDIT THRU              ROR17111
564350                         S5951-INIT-CODE1-AUDIT-EXIT              ROR17111
564360              END-IF                                              ROR17111
564370           END-IF                                                 ROR17111
564380        END-IF                                                    ROR17111
564390     END-IF.                                                      ROR17111
564400*                                                                 ROR17111
564500 S5950-EXIT.  EXIT.                                               ROR17111
564600*                                                                 ROR17111
564700******************************************************************ROR17111
564800*AAUDIT FILE LOGGING FOR CODE1 ADDRESS.                           ROR17111
564900******************************************************************ROR17111
565000 S5951-INIT-CODE1-AUDIT.                                          ROR17111
565100                                                                  ROR17111
565200     INITIALIZE  ADR-CUST-600-RECORD.                             ROR17111
565300     MOVE WS-CUST-BR-NBR         TO  TC-BR-NBR                    ROR17111
565400     MOVE WS-CUST-NUMBER         TO  TC-CUST-NBR                  ROR17111
565500     MOVE WS-CUST-SUFFIX         TO  TC-CUST-SUFFIX               ROR17111
565600     MOVE ORH-ORDER-NBR          TO  TC-ORDER-NBR                 ROR17111
565700     MOVE '1'                    TO  TC-DIST-NBR.                 ROR17111
565800     MOVE '1'                    TO  TC-SHIP-NBR.                 ROR17111
565900     MOVE TC-COMPANY             TO  ADR-COMPANY.                 ROR17111
566000     MOVE TC-BR-NBR              TO  ADR-CUS-BR-NBR,              ROR17111
566100                                     ADR-ORD-BR-NBR.              ROR17111
566200     MOVE WS-ADR-SEGMENT-NAME    TO  ADR-SEGMENT-NAME.            ROR17111
566300     MOVE EIBTRMID               TO  ADR-TERMINAL                 ROR17111
566400     MOVE EIBDATE                TO  ADR-DATE.                    ROR17111
566500     MOVE EIBTIME                TO  ADR-TIME.                    ROR17111
566600     MOVE TC-OPER-ID             TO  ADR-OPERATOR-ID.             ROR17111
566700     MOVE TC-CUST-NBR            TO  ADR-CUS-NBR.                 ROR17111
566800     MOVE TC-CUST-SUFFIX         TO  ADR-CUS-SUF.                 ROR17111
566900     MOVE TC-DIST-NBR            TO  ADR-ORD-DIST-NBR.            ROR17111
567000     MOVE TC-SHIP-NBR            TO  ADR-ORD-SHIP-NBR.            ROR17111
567100     MOVE TC-ORDER-NBR           TO  ADR-ORD-NBR.                 ROR17111
           MOVE 'ORP971'               TO  ADR-PROGRAM.                 TXT21050
567200     IF NOT WS-BYPASS-CODE1-SW = 'Y'                              ROR17111
567300        PERFORM S5952-MOVE-ADDRESS THRU                           ROR17111
567400                S5952-MOVE-ADDRESS-EXIT                           ROR17111
      *       BELOW CODING IS FOR FUTURE                                TXT21050
      *       IF CUOF-ECOM-RT-BYPASS-GROUP1                             TXT21050
      *          MOVE WS-CD1-BYP-MESSAGE  TO  ADR-BYPS-R-MESSAGE        TXT21050
      *       END-IF                                                    TXT21050
567500     ELSE                                                         ROR17111
567600        MOVE WS-CD1-BYP-MESSAGE  TO ADR-CUS-RECOMM-ADDRESS(1)     ROR17111
567700        IF CORORH-SHIP-TO-ADDRESS-1 > SPACES                      ROR17111
567800           MOVE CORORH-SHIP-TO-ADDRESS-1  TO                      ROR17111
567900                                   ADR-CUS-ENTER-ADDRESS(1)       ROR17111
568000        END-IF                                                    ROR17111
568100        IF CORORH-SHIP-TO-ADDRESS-2 > SPACES                      ROR17111
568200           MOVE CORORH-SHIP-TO-ADDRESS-2  TO                      ROR17111
568300                                   ADR-CUS-ENTER-ADDRESS(2)       ROR17111
568400        END-IF                                                    ROR17111
568500        IF CORORH-SHIP-TO-ADDRESS-3 > SPACES                      ROR17111
568600           MOVE CORORH-SHIP-TO-ADDRESS-3  TO                      ROR17111
568700                                   ADR-CUS-ENTER-ADDRESS(3)       ROR17111
568800        END-IF                                                    ROR17111
568900        IF CORORH-SHIP-TO-CITY  > SPACES                          ROR17111
569000           STRING CORORH-SHIP-TO-CITY  DELIMITED BY '  '          ROR17111
569100           ' '          DELIMITED BY SIZE                         ROR17111
569200           CORORH-SHIP-TO-STATE  DELIMITED BY SIZE                ROR17111
569300           ' '          DELIMITED BY SIZE                         ROR17111
569400           CORORH-SHIP-TO-ZIP   DELIMITED BY SIZE                 ROR17111
569500                      INTO  ADR-CUS-ENTER-ADDRESS(4)              ROR17111
569600        END-IF                                                    ROR17111
569700     END-IF                                                       ROR17111
569800     PERFORM S5953-READ-CODE1-AUDIT  THRU                         ROR17111
569900             S5953-READ-CODE1-AUDIT-EXIT.                         ROR17111
570000                                                                  ROR17111
570100 S5951-INIT-CODE1-AUDIT-EXIT.                                     ROR17111
570200     EXIT.                                                        ROR17111
570300                                                                  ROR17111
570400 S5952-MOVE-ADDRESS.                                              ROR17111
570500                                                                  ROR17111
570600      MOVE CUWG1ERR-GRP1-USPS-CODE TO  ADR-RDI.                   ROR17111
570700      MOVE SPACES                  TO  ADR-NEW-RDI.               ROR17111
570800      IF TC-CANADA                                                ROR17111
570900         MOVE MOA-CAN-O-GENERAL-RC TO  ADR-GEN-RC                 ROR17111
571000         MOVE MOA-CAN-O-DIRECTION-RC                              ROR17111
571100                                   TO  ADR-DIR-RC                 ROR17111
571200         MOVE MOA-CAN-O-APT-RC     TO  ADR-APT-RC                 ROR17111
571300         MOVE MOA-CAN-O-STREET-TYPE-RC                            ROR17111
571400                                   TO  ADR-SUF-RC                 ROR17111
571500         MOVE MOA-CAN-O-OVRLL-PRB-COR-SCR                         ROR17111
571600                                   TO  ADR-PRB-RC                 ROR17111
571700      ELSE                                                        ROR17111
571800         IF TC-USA                                                ROR17111
571900            MOVE P9OGRC            TO  ADR-GEN-RC                 ROR17111
572000            MOVE P9ODRC            TO  ADR-DIR-RC                 ROR17111
572100            MOVE P9OARC            TO  ADR-APT-RC                 ROR17111
572200            MOVE P9OSRC            TO  ADR-SUF-RC                 ROR17111
572300            MOVE P9OPRB            TO  ADR-PRB-RC                 ROR17111
572400         END-IF                                                   ROR17111
572500      END-IF.                                                     ROR17111
572600      MOVE CUWG1ERR-ADDR1          TO  ADR-CUS-RECOMM-ADDRESS(1). ROR17111
572700      IF CUWG1ERR-ADDR2 > SPACES                                  ROR17111
572800         MOVE CUWG1ERR-ADDR2       TO  ADR-CUS-RECOMM-ADDRESS(2)  ROR17111
572900      END-IF.                                                     ROR17111
573000      STRING CUWG1ERR-CITY  DELIMITED BY '  '                     ROR17111
573100      ' '          DELIMITED BY SIZE                              ROR17111
573200      CUWG1ERR-STATE DELIMITED BY SIZE                            ROR17111
573300      ' '          DELIMITED BY SIZE                              ROR17111
573400      CUWG1ERR-ZIP DELIMITED BY SIZE                              ROR17111
573500                        INTO  ADR-CUS-RECOMM-ADDRESS(4).          ROR17111
573600*                                                                 ROR17111
573700      IF WS-ENTER-SHIP-TO-ADDRESS1 > SPACES                       ROR17111
573800         MOVE WS-ENTER-SHIP-TO-ADDRESS1 TO                        ROR17111
573900                                 ADR-CUS-ENTER-ADDRESS(1)         ROR17111
574000      END-IF.                                                     ROR17111
574100      IF WS-ENTER-SHIP-TO-ADDRESS2> SPACES                        ROR17111
574200         MOVE WS-ENTER-SHIP-TO-ADDRESS2 TO                        ROR17111
574300                                 ADR-CUS-ENTER-ADDRESS(2)         ROR17111
574400      END-IF.                                                     ROR17111
574500      IF WS-ENTER-SHIP-TO-ADDRESS3> SPACES                        ROR17111
574600         MOVE WS-ENTER-SHIP-TO-ADDRESS3   TO                      ROR17111
574700                                 ADR-CUS-ENTER-ADDRESS(3)         ROR17111
574800      END-IF.                                                     ROR17111
574900      STRING WS-ENTER-SHIP-TO-CITY  DELIMITED BY '  '             ROR17111
575000      ' '               DELIMITED BY SIZE                         ROR17111
575100      WS-ENTER-SHIP-TO-STATE  DELIMITED BY SIZE                   ROR17111
575200      ' '               DELIMITED BY SIZE                         ROR17111
575300      WS-ENTER-SHIP-TO-ZIP   DELIMITED BY SIZE                    ROR17111
575400                 INTO       ADR-CUS-ENTER-ADDRESS(4).             ROR17111
575500*                                                                 ROR17111
575600 S5952-MOVE-ADDRESS-EXIT.                                         ROR17111
575700     EXIT.                                                        ROR17111
575800                                                                  ROR17111
575900 S5953-READ-CODE1-AUDIT.                                          ROR17111
576000                                                                  ROR17111
576100     INITIALIZE WS-ADR-RBA.                                       ROR17111
576200     MOVE TC-COMPANY          TO WS-ADR-COMPANY.                  ROR17111
576300     MOVE TC-BR-NBR           TO WS-ADR-CUST-BR,WS-ADR-ORDER-BR.  ROR17111
576400     MOVE TC-CUST-NBR         TO WS-ADR-CUST-NBR.                 ROR17111
576500     MOVE TC-CUST-SUFFIX      TO WS-ADR-CUST-SUF.                 ROR17111
576600     MOVE TC-ORDER-NBR        TO WS-ADR-ORDER-NBR.                ROR17111
576700     MOVE TC-DIST-NBR         TO WS-ADR-ORDER-DIST.               ROR17111
576800     MOVE TC-SHIP-NBR         TO WS-ADR-ORDER-SHIP.               ROR17111
576900     MOVE LENGTH OF ADR-ORSSTO-AUDIT                              ROR17111
577000                              TO WS-ADRADT-LENGTH.                ROR17111
577100                                                                  ROR17111
577200     EXEC CICS READ                                               ROR17111
577300          DATASET  (WS-ADRADT)                                    ROR17111
577400          LENGTH   (WS-ADRADT-LENGTH)                             ROR17111
577500          INTO     (ADR-ORSSTO-AUDIT)                             ROR17111
577600          RIDFLD   (WS-ADR-RBA)                                   ROR17111
577700          RESP     (WS-EIBRESP)                                   ROR17111
577800          UPDATE                                                  ROR17111
577900     END-EXEC.                                                    ROR17111
578000                                                                  ROR17111
578100     IF  WS-EIB-NORESP                                            ROR17111
578200         PERFORM S5955-REWRITE-CODE1-AUDIT                        ROR17111
578300            THRU S5955-REWRITE-CODE1-AUDIT-EXIT                   ROR17111
578400     ELSE                                                         ROR17111
578500         IF  WS-EIB-NOTFND  OR                                    ROR17111
578600             WS-EIB-ENDFILE                                       ROR17111
578700             PERFORM S5954-WRITE-CODE1-AUDIT                      ROR17111
578800                THRU S5954-WRITE-CODE1-AUDIT-EXIT                 ROR17111
578900         ELSE                                                     ROR17111
579000             GO TO S5953-READ-CODE1-AUDIT-EXIT                    ROR17111
579100         END-IF                                                   ROR17111
579200     END-IF.                                                      ROR17111
579300                                                                  ROR17111
579400 S5953-READ-CODE1-AUDIT-EXIT.                                     ROR17111
579500     EXIT.                                                        ROR17111
579600                                                                  ROR17111
579700 S5954-WRITE-CODE1-AUDIT.                                         ROR17111
579800                                                                  ROR17111
579900     EXEC CICS WRITE                                              ROR17111
580000               DATASET (WS-ADRADT)                                ROR17111
580100               FROM    (ADR-ORSSTO-AUDIT)                         ROR17111
580200               RIDFLD  (WS-ADR-RBA)                               ROR17111
580300               LENGTH  (WS-ADRADT-LENGTH)                         ROR17111
580400               RESP    (WS-EIBRESP)                               ROR17111
580500     END-EXEC.                                                    ROR17111
580600                                                                  ROR17111
580700     IF  NOT WS-EIB-NORESP                                        ROR17111
580800         GO TO S5954-WRITE-CODE1-AUDIT-EXIT                       ROR17111
580900     END-IF.                                                      ROR17111
581000                                                                  ROR17111
581100*  IF HAVING ISSUES  WRITING TO AUDIT FILE--DONT DO ANYTHING.     ROR17111
581200*     JUST  LIKE IN ORP320 !!!                                    ROR17111
581300                                                                  ROR17111
581400 S5954-WRITE-CODE1-AUDIT-EXIT.                                    ROR17111
581500     EXIT.                                                        ROR17111
581600                                                                  ROR17111
581700 S5955-REWRITE-CODE1-AUDIT.                                       ROR17111
581800                                                                  ROR17111
581900     INITIALIZE ADR-ORSSTO-AUDIT.                                 ROR17111
582000     MOVE WS-ADR-RBA             TO ADR-ORSSTO-AUDIT.             ROR17111
582100     PERFORM S5951-INIT-CODE1-AUDIT                               ROR17111
582200        THRU S5951-INIT-CODE1-AUDIT-EXIT.                         ROR17111
582300                                                                  ROR17111
582400     EXEC CICS REWRITE                                            ROR17111
582500               DATASET (WS-ADRADT)                                ROR17111
582600               FROM    (ADR-ORSSTO-AUDIT)                         ROR17111
582700               LENGTH  (WS-ADRADT-LENGTH)                         ROR17111
582800               RESP    (WS-EIBRESP)                               ROR17111
582900     END-EXEC.                                                    ROR17111
583000                                                                  ROR17111
583100*  IF HAVING ISSUES  WRITING TO AUDIT FILE--DONT DO ANYTHING.     ROR17111
583200*     JUST  LIKE IN ORP320 !!!                                    ROR17111
583300                                                                  ROR17111
583400     IF  NOT WS-EIB-NORESP                                        ROR17111
583500         GO TO S5955-REWRITE-CODE1-AUDIT-EXIT                     ROR17111
583600     END-IF.                                                      ROR17111
583700                                                                  ROR17111
583800 S5955-REWRITE-CODE1-AUDIT-EXIT.                                  ROR17111
583900     EXIT.                                                        ROR17111
583901*                                                                 ROR17111
      *----------------------------------------------------------------*NXC21050
       322A-EMAIL-PERFORM-INSPECT.                                      NXC21050
      *----------------------------------------------------------------*NXC21050
                                                                        NXC21050
           IF CORORH-COMPANY-CODE = 'DE' OR 'CH' OR 'AT' OR 'IT' OR 'DC'NXC21050
                                         OR 'Z3'                        NR122063
              PERFORM VARYING SUB4 FROM 1 BY 1 UNTIL SUB4 > 255         NXC21050
                 IF WS-FRMT-EMAIL-ADDR(SUB4:1) = X'B5'                  NXC21050
                   MOVE X'7C'          TO  WS-FRMT-EMAIL-ADDR(SUB4:1)   NXC21050
                 END-IF                                                 NXC21050
               END-PERFORM                                              NXC21050
           END-IF.                                                      NXC21050
                                                                        NXC21050
           IF CORORH-COMPANY-CODE = 'SE'                                NXC21050
           OR 'DK' OR 'FI'                                              FYT21169
               PERFORM VARYING SUB4 FROM 1 BY 1 UNTIL SUB4 > 255        NXC21050
                 IF WS-FRMT-EMAIL-ADDR(SUB4:1) = X'EC'                  NXC21050
                   MOVE X'7C'           TO WS-FRMT-EMAIL-ADDR(SUB4:1)   NXC21050
                 END-IF                                                 NXC21050
               END-PERFORM                                              NXC21050
           END-IF.                                                      NXC21050
                                                                        NXC21050
           IF CORORH-COMPANY-CODE = 'FR'                                NXC21050
               PERFORM VARYING SUB4 FROM 1 BY 1 UNTIL SUB4 > 255        NXC21050
                 IF WS-FRMT-EMAIL-ADDR(SUB4:1) = X'44'                  NXC21050
                   MOVE X'7C'           TO WS-FRMT-EMAIL-ADDR(SUB4:1)   NXC21050
                 END-IF                                                 NXC21050
               END-PERFORM                                              NXC21050
           END-IF.                                                      NXC21050
                                                                        NXC21050
       322A-EMAIL-EXIT.                                                 NXC21050
           EXIT.                                                        NXC21050
                                                                        NXC21050
583902 S6000-WRITE-HEADER-RESPONSE.                                     MCV95220
583903*                                                                 MCV95220
583904*---  WRITE LUOT TDQ (ORDER HEADER RESPONSE BACK TO ELCOM)                
583905******************************************************************ROR99015
583906                                                                  ROR99015
583907*  VALUE OF "#" IN WS-LU6ORH-WARNING-SW :                         ROR06075
583908*    FOR ALL NEW WARNINGS ISSUED IN THIS PROGRAM AFTER 2006       ROR06075
583909*     "#" WILL BE SENT BACK IN CORORH-R-ERROR-TYPE ALONG WITH     ROR06075
583910*     "W" IN CORORH-R-RECORD-RESPONSE-FLAG , IF NO ERRORS.        ROR06075
583920*    THIS INDICATES CUSTOMER TO LOOK IN CORORH-R-WARNING-AREA     ROR06075
583930*      FOR ALL LIST OF WARNINGS ISSUED IN THIS PROGRAM.           ROR06075
583940*    FOR EXISTING WARNINGS , THEY WILL BE SENT AS SENT TODAY,     ROR06075
583941*     ALONG WITH LIST OF ALL WARNINGS IN CORORH-R-WARNING-AREA.   ROR06075
583942*                                                                         
583943     MOVE CORORH-FIRM-NAME         TO CORORH-R-FIRM-NAME          ROR02344
583944     IF WS-SPCL-ADDRESS-SW  NOT = 'Y'                             TKC07194
583945        MOVE CORORH-SHIP-TO-ADDRESS-1 TO CORORH-R-ADDRESS-LINE1   ROR99015
583946        MOVE CORORH-SHIP-TO-ADDRESS-2 TO CORORH-R-ADDRESS-LINE2   ROR99015
583947        MOVE CORORH-SHIP-TO-ADDRESS-3 TO CORORH-R-ADDRESS-LINE3   ROR06110
583948        MOVE CORORH-SHIP-TO-CITY  TO CORORH-R-CITY                ROR99015
583949        MOVE CORORH-SHIP-TO-STATE TO CORORH-R-STATE               ROR99015
583950        MOVE CORORH-SHIP-TO-ZIP   TO CORORH-R-ZIP.                ROR00060
583951     MOVE ORSH-CARRIER-CODE    TO CORORH-R-CARRIER                FVB00038
583952     MOVE ORSH-SHIP-VIA        TO CORORH-R-SHIP-VIA               FVB00038
583953     MOVE WS-PRESENT-DATE      TO CORORH-R-ENTRY-DATE.            ROR01332
583954     IF WS-LU6ORH-ERROR-ALL-OK                                    ROR00060
583955        EVALUATE WS-LU6ORH-WARNING-SW                             ROR00060
583956        WHEN ' '                                                  ROR00060
583957           MOVE WS-ERROR-FLAG   TO  WS-LU6ORH-ERROR-SW            ROR00060
583958           MOVE WS-RESPONSE-FLAG                                  ROR00060
583959                                TO  CORORH-R-RECORD-RESPONSE-FLAG ROR00060
583960        WHEN '#'                                                  ROR00060
583970           MOVE WS-LU6ORH-WARNING-SW                              ROR00060
583980                                TO  WS-LU6ORH-ERROR-SW            ROR00060
583981           MOVE 'W'             TO  CORORH-R-RECORD-RESPONSE-FLAG ROR00060
583982        WHEN OTHER                                                ROR00060
583983           EVALUATE WS-ERROR-FLAG                                 ROR00060
583984           WHEN 'T'                                               ROR00060
583985                MOVE 'W' TO CORORH-R-RECORD-RESPONSE-FLAG         ROR06075
583986                IF WS-LU6ORH-WARNING-SW = 'Y'                     ROR06075
583987                   MOVE '5'    TO WS-LU6ORH-ERROR-SW              ROR06075
583988                ELSE                                              ROR06075
583989                   IF WS-LU6ORH-WARNING-SW = 'L'                  ROR06075
583990                      MOVE '8' TO WS-LU6ORH-ERROR-SW              ROR06075
584000                   END-IF                                         ROR06075
584001                END-IF                                            ROR06075
584002           WHEN 'A'                                               ROR00060
584003                MOVE 'W' TO CORORH-R-RECORD-RESPONSE-FLAG         ROR06075
584004                MOVE 'A'       TO WS-LU6ORH-ERROR-SW              ROR06075
584005           WHEN ' '                                               ROR06076
584006                MOVE 'W' TO CORORH-R-RECORD-RESPONSE-FLAG         ROR06076
584007                MOVE WS-LU6ORH-WARNING-SW                         ROR06076
584008                               TO WS-LU6ORH-ERROR-SW              ROR06076
584009           END-EVALUATE                                           ROR00060
584010        END-EVALUATE                                              ROR00060
584020        MOVE WS-LU6ORH-ERROR-SW       TO  CORORH-R-ERROR-TYPE     ROR00060
584030        IF WS-HOLD-ON-ERROR-TYPE GREATER THAN SPACES              ROR06075
584040           PERFORM S6100-HANDLE-HOLD-ON-ERROR THRU S6100-EXIT     ROR06075
584041        END-IF                                                    ROR06075
584042     ELSE                                                         ROR00060
584043        IF WS-LU6ORH-ERROR-FLAG > SPACES                          ROR00060
584044           MOVE  WS-LU6ORH-ERROR-FLAG TO  CORORH-R-RECORD-RESPONSEROR00060
584045        ELSE                                                      ROR00060
584046           MOVE 'E'   TO  CORORH-R-RECORD-RESPONSE-FLAG           ROR00060
584047           MOVE WS-LU6ORH-ERROR-SW    TO  CORORH-R-ERROR-TYPE     ROR00060
584048        END-IF                                                    ROR00060
584049     END-IF.                                                      ROR00060
584050     MOVE WS-ADDR-ERR-TYPE            TO  CORORH-R-ADDR-ERR-TYPE  ROR99214
584051     MOVE WS-TAX-FLAG                 TO  CORORH-R-TAX-FLAG       ROR99015
584052     MOVE WS-THIRD-PARTY-FLAG                                     ROR99015
584053                             TO CORORH-R-THIRD-PARTY-FRT-ACCT.    ROR99015
584054     MOVE ORH-BR-NBR                  TO  CORORH-R-ORDER-BRANCH.  PXP95004
584055     MOVE ORH-ORDER-NBR               TO  CORORH-R-ORDER-NBR.     PXP95004
584056     IF WS-TAX-FLAG  =  'A'                                       ROR99015
584057     MOVE WS-NEXUS-BR-NBR-SHIP-FROM   TO  ORSH-BR-NBR-SHIP-FROM   ROR99015
584058     END-IF.                                                      ROR99015
584059     MOVE ORSH-BR-NBR-SHIP-FROM                                   SXK97090
584060                                TO  CORORH-R-BR-NBR-SHIP-FROM.    SXK97090
584061*                                                                 ROR99015
584062     MOVE LENGTH OF CORORH-TCH-AREA   TO  CORORH-HEADER-LENGTH.   PXP95004
584063     MOVE LENGTH OF CORORH-DATA-AREA  TO  CORORH-DATA-LENGTH.     PXP95004
584064     PERFORM S1500-WRITE-LUOT-QUEUE.                                      
584065*                                                                 ROR00060
584066 S6000-EXIT. EXIT.                                                ROR00060
584067*---------------------------                                      ROR00060
584068*---------------------------                                      ROR00060
584069 S6100-HANDLE-HOLD-ON-ERROR.                                      ROR06075
584070*                                                                 ROR06075
584080     IF WS-HOLD-ON-3PTY-ERR                                       ROR06075
584090        MOVE 'P'                TO  WS-R-WARN-TYPE                ROR06075
584100        MOVE 'W'                TO  WS-R-WARN-FLAG                ROR06075
584200        PERFORM S8000-SET-WARNINGS THRU S8000-EXIT                ROR06075
584300     END-IF                                                       ROR06075
584400     IF WS-HOLD-ON-CARR-ERR                                       ROR06075
584500        MOVE 'V'                TO  WS-R-WARN-TYPE                ROR06075
584600        MOVE 'W'                TO  WS-R-WARN-FLAG                ROR06075
584700        PERFORM S8000-SET-WARNINGS THRU S8000-EXIT                ROR06075
584800     END-IF                                                       ROR06075
584900     IF WS-HOLD-ON-ADDR-GRP1-ERR                                  ROR06075
585000        MOVE 'B'                TO  WS-R-WARN-TYPE                ROR06075
585100        MOVE 'W'                TO  WS-R-WARN-FLAG                ROR06075
585200        PERFORM S8000-SET-WARNINGS THRU S8000-EXIT                ROR06075
585300     END-IF                                                       ROR06075
585400     IF WS-HOLD-ON-APO-FPO-ERR                                    ROR06075
585500        MOVE 'C'                TO  WS-R-WARN-TYPE                ROR06075
585600        MOVE 'W'                TO  WS-R-WARN-FLAG                ROR06075
585700        PERFORM S8000-SET-WARNINGS THRU S8000-EXIT                ROR06075
585800     END-IF                                                       ROR06075
585900     MOVE '#'                   TO  CORORH-R-ERROR-TYPE           ROR06075
586000     MOVE 'W'                   TO  CORORH-R-RECORD-RESPONSE-FLAG.ROR06075
586100*                                                                 ROR06075
586200* AT THE END WE POPULATE "#" BACK IN CORORH-R-ERROR-TYPE,         ROR06075
586300*  BECAUSE ITS THE VALUE THAT INDICATES TO LOOK AT NEW WARN AREA  ROR06075
586400*                                                                 ROR06075
586500*  WS-APPLE COND IS TO MAKE SURE CURRENT APPLE LOGIC WONT BREAK!! ROR06075
586600*  ONCE APPLE / PCG  MAKES CHANGES ON THEIR END TO HANDLE         ROR06075
586700*   NEW WARNING AREA , CAN GET RID OF THIS WS-APPLE CONDITION.    ROR06075
586800*                                                                 ROR06075
586900     IF WS-APPLE                                                  ROR06075
587000        IF WS-HOLD-ON-CARR-ERR          OR                        ROR06075
587100           WS-HOLD-ON-APO-FPO-ERR OR                              ROR06075
587200           WS-HOLD-ON-ADDR-GRP1-ERR                               ROR06075
587300           MOVE 'V'             TO  CORORH-R-ERROR-TYPE           ROR06075
587400           MOVE 'W'             TO  CORORH-R-RECORD-RESPONSE-FLAG ROR06075
587500        END-IF                                                    ROR06075
587600        IF WS-HOLD-ON-3PTY-ERR                                    ROR06075
587700           MOVE 'P'             TO  CORORH-R-ERROR-TYPE           ROR06075
587800           MOVE 'W'             TO  CORORH-R-RECORD-RESPONSE-FLAG ROR06075
587900        END-IF                                                    ROR06075
588000        IF WS-HOLD-ON-3PTY-ERR AND                                ROR06075
588100           (WS-HOLD-ON-CARR-ERR         OR                        ROR06075
588200            WS-HOLD-ON-APO-FPO-ERR OR                             ROR06075
588300            WS-HOLD-ON-ADDR-GRP1-ERR)                             ROR06075
588400           MOVE 'U'             TO  CORORH-R-ERROR-TYPE           ROR06075
588500           MOVE 'W'             TO  CORORH-R-RECORD-RESPONSE-FLAG ROR06075
588600        END-IF                                                    ROR06075
588700     END-IF.                                                      ROR06075
588800*                                                                 ROR06075
588801 S6100-EXIT. EXIT.                                                ROR06075
588802*---------------------------                                      ROR00060
588803*                                                                 ROR04064
588804*                                                                 ROR04064
588805 S7000-END-THE-ORDER.                                             ROR04064
588806*                                                                 ROR04064
588807     IF CORORH-SYSTEM-ID = 'I' OR 'IM'                            ROR04064
588808        IF CORORH-R-RECORD-NO-ERRORS  AND                         ROR04064
588809           WS-WARN-BASERATE-ON                                    ROR04064
588810            SET CORORH-R-RECORD-WARNING-FOUND  TO TRUE            ROR04064
588811            SET CORORH-R-WARN-BASERATE-ON      TO TRUE            ROR04064
588812        END-IF                                                    ROR04064
588813     ELSE                                                         ROR04064
588814        IF CORORH-R-RECORD-WARNING-FOUND                          ROR04064
588815          IF          CORORH-R-ERROR-TYPE = '5'                   ROR04064
588816          OR          CORORH-R-ERROR-TYPE = '8'                   ROR04064
588817          OR          CORORH-R-ERROR-TYPE = 'T'                   ROR04064
588818          MOVE 'W' TO CORORH-R-RECORD-RESPONSE-FLAG               ROR04064
588819          MOVE 'T' TO CORORH-R-ERROR-TYPE                         ROR04064
588820          ELSE                                                    ROR04064
588821           MOVE SPACES TO CORORH-R-RECORD-RESPONSE-FLAG           ROR04064
588822                          CORORH-R-ERROR-TYPE                     ROR04064
588823          END-IF                                                  ROR04064
588824        END-IF                                                    ROR04064
588825     END-IF.                                                      ROR04064
588826*                                                                 ROR04162
588827     MOVE WS-CORORH-SHIP-TO-CNTRY-CODE  TO                        ROR04162
588828             CORORH-SHIP-TO-CNTRY-CODE.                           ROR04162
588829*                                                                 ROR04064
588830* SAVE SAVED FIELDS IN TEMP STORAGE BACK TO CORORH- AREA.         ROR17111
588840     MOVE WS-ENTER-SHIP-TO-FIRM-NAME TO                           ROR17111
588850          CORORH-FIRM-NAME.                                       ROR17111
588860     MOVE WS-ENTER-SHIP-TO-ADDRESS1 TO                            ROR17111
588870          CORORH-SHIP-TO-ADDRESS-1.                               ROR17111
588880     MOVE WS-ENTER-SHIP-TO-ADDRESS2 TO                            ROR17111
588890          CORORH-SHIP-TO-ADDRESS-2.                               ROR17111
588900     MOVE WS-ENTER-SHIP-TO-ADDRESS3 TO                            ROR17111
589000          CORORH-SHIP-TO-ADDRESS-3.                               ROR17111
589100     MOVE WS-ENTER-SHIP-TO-CITY TO                                ROR17111
589200          CORORH-SHIP-TO-CITY.                                    ROR17111
589300     MOVE WS-ENTER-SHIP-TO-STATE  TO                              ROR17111
589400          CORORH-SHIP-TO-STATE.                                   ROR17111
589500     MOVE WS-ENTER-SHIP-TO-ZIP TO                                 ROR17111
589600          CORORH-SHIP-TO-ZIP.                                     ROR17111
589700     MOVE CORORH-SHIP-TO-CNTRY-CODE TO                            ROR17111
589800          WS-ENTER-TO-COUNTRY-CODE.                               ROR17111
589801                                                                  ROR17111
589802     IF WS-DLI-SCHEDULED                                          ROR04064
589803     PERFORM 990-TERMINATE-DLI.                                   ROR04064
589804*                                                                 ROR04064
589805     IF LINK-IN                                                   ROR04064
589806       MOVE CORORH-LU62-ORDER-REQUEST TO RCV-BUFFER-AREA          ROR04064
589807        MOVE RCV-BUFFER-AREA                                      ROR04064
589808                             TO  DFHCOMMAREA (1:EIBCALEN)         ROR04064
589809                EXEC CICS RETURN                                  ROR04064
589810                END-EXEC.                                         ROR04064
589811*                                                                 ROR04064
589812     GOBACK.                                                      ROR04064
589813*                                                                 ROR04064
589814*                                                                 ROR04064
589815 S7000-EXIT.    EXIT.                                             ROR04064
589816*                                                                 ROR04064
589817*                                                                 ROR04064
589818*                                                                         
589819 S8000-SET-WARNINGS.                                              ROR06075
589820*                                                                 ROR06075
589830     IF CORORH-R-WARN-CODE-1 GREATER THAN SPACES                  ROR06075
589840        IF CORORH-R-WARN-CODE-1 EQUAL WS-R-WARN-CODE              ROR06075
589850           GO TO S8000-EXIT                                       ROR06075
589860        ELSE                                                      ROR06075
589870           NEXT SENTENCE                                          ROR06075
589880        END-IF                                                    ROR06075
589890     ELSE                                                         ROR06075
589900        MOVE WS-R-WARN-CODE TO CORORH-R-WARN-CODE-1               ROR06075
590000        GO TO S8000-EXIT                                          ROR06075
590100     END-IF.                                                      ROR06075
590200*                                                                 ROR06075
590300     IF CORORH-R-WARN-CODE-2 GREATER THAN SPACES                  ROR06075
590400        IF CORORH-R-WARN-CODE-2 EQUAL WS-R-WARN-CODE              ROR06075
590500           GO TO S8000-EXIT                                       ROR06075
590600        ELSE                                                      ROR06075
590700           NEXT SENTENCE                                          ROR06075
590800        END-IF                                                    ROR06075
590900     ELSE                                                         ROR06075
591000        MOVE WS-R-WARN-CODE TO CORORH-R-WARN-CODE-2               ROR06075
591100        GO TO S8000-EXIT                                          ROR06075
591200     END-IF.                                                      ROR06075
591300*                                                                 ROR06075
591400     IF CORORH-R-WARN-CODE-3 GREATER THAN SPACES                  ROR06075
591500        IF CORORH-R-WARN-CODE-3 EQUAL WS-R-WARN-CODE              ROR06075
591600           GO TO S8000-EXIT                                       ROR06075
591700        ELSE                                                      ROR06075
591800           NEXT SENTENCE                                          ROR06075
591900        END-IF                                                    ROR06075
592000     ELSE                                                         ROR06075
592100        MOVE WS-R-WARN-CODE TO CORORH-R-WARN-CODE-3               ROR06075
592200        GO TO S8000-EXIT                                          ROR06075
592300     END-IF.                                                      ROR06075
592400*                                                                 ROR06075
592500     IF CORORH-R-WARN-CODE-4 GREATER THAN SPACES                  ROR06075
592600        IF CORORH-R-WARN-CODE-4 EQUAL WS-R-WARN-CODE              ROR06075
592700           GO TO S8000-EXIT                                       ROR06075
592800        ELSE                                                      ROR06075
592900           NEXT SENTENCE                                          ROR06075
593000        END-IF                                                    ROR06075
593100     ELSE                                                         ROR06075
593200        MOVE WS-R-WARN-CODE TO CORORH-R-WARN-CODE-4               ROR06075
593300        GO TO S8000-EXIT                                          ROR06075
593400     END-IF.                                                      ROR06075
593500*                                                                 ROR06075
593600     IF CORORH-R-WARN-CODE-5 GREATER THAN SPACES                  ROR06075
593700        IF CORORH-R-WARN-CODE-5 EQUAL WS-R-WARN-CODE              ROR06075
593800           GO TO S8000-EXIT                                       ROR06075
593900        ELSE                                                      ROR06075
594000           NEXT SENTENCE                                          ROR06075
594100        END-IF                                                    ROR06075
594200     ELSE                                                         ROR06075
594300        MOVE WS-R-WARN-CODE TO CORORH-R-WARN-CODE-5               ROR06075
594400        GO TO S8000-EXIT                                          ROR06075
594500     END-IF.                                                      ROR06075
594600*                                                                 ROR06075
594700     IF CORORH-R-WARN-CODE-6 GREATER THAN SPACES                  ROR06075
594800        IF CORORH-R-WARN-CODE-6 EQUAL WS-R-WARN-CODE              ROR06075
594900           GO TO S8000-EXIT                                       ROR06075
595000        ELSE                                                      ROR06075
595100           NEXT SENTENCE                                          ROR06075
595200        END-IF                                                    ROR06075
595300     ELSE                                                         ROR06075
595400        MOVE WS-R-WARN-CODE TO CORORH-R-WARN-CODE-6               ROR06075
595500        GO TO S8000-EXIT                                          ROR06075
595600     END-IF.                                                      ROR06075
595700*                                                                 ROR06075
595800     IF CORORH-R-WARN-CODE-7 GREATER THAN SPACES                  ROR06075
595900        IF CORORH-R-WARN-CODE-7 EQUAL WS-R-WARN-CODE              ROR06075
596000           GO TO S8000-EXIT                                       ROR06075
596100        ELSE                                                      ROR06075
596200           NEXT SENTENCE                                          ROR06075
596300        END-IF                                                    ROR06075
596400     ELSE                                                         ROR06075
596500        MOVE WS-R-WARN-CODE TO CORORH-R-WARN-CODE-7               ROR06075
596600        GO TO S8000-EXIT                                          ROR06075
596700     END-IF.                                                      ROR06075
596800*                                                                 ROR06075
596900     IF CORORH-R-WARN-CODE-8 GREATER THAN SPACES                  ROR06075
597000        IF CORORH-R-WARN-CODE-8 EQUAL WS-R-WARN-CODE              ROR06075
597100           GO TO S8000-EXIT                                       ROR06075
597200        ELSE                                                      ROR06075
597300           NEXT SENTENCE                                          ROR06075
597400        END-IF                                                    ROR06075
597500     ELSE                                                         ROR06075
597600        MOVE WS-R-WARN-CODE TO CORORH-R-WARN-CODE-8               ROR06075
597700        GO TO S8000-EXIT                                          ROR06075
597800     END-IF.                                                      ROR06075
597900*                                                                 ROR06075
598000     IF CORORH-R-WARN-CODE-9 GREATER THAN SPACES                  ROR06075
598100        IF CORORH-R-WARN-CODE-9 EQUAL WS-R-WARN-CODE              ROR06075
598200           GO TO S8000-EXIT                                       ROR06075
598300        ELSE                                                      ROR06075
598400           NEXT SENTENCE                                          ROR06075
598500        END-IF                                                    ROR06075
598600     ELSE                                                         ROR06075
598700        MOVE WS-R-WARN-CODE TO CORORH-R-WARN-CODE-9               ROR06075
598800        GO TO S8000-EXIT                                          ROR06075
598900     END-IF.                                                      ROR06075
599000*                                                                 ROR06075
599100     IF CORORH-R-WARN-CODE-10 GREATER THAN SPACES                 ROR06075
599200        IF CORORH-R-WARN-CODE-10 EQUAL WS-R-WARN-CODE             ROR06075
599300           GO TO S8000-EXIT                                       ROR06075
599400        ELSE                                                      ROR06075
599500           NEXT SENTENCE                                          ROR06075
599600        END-IF                                                    ROR06075
599700     ELSE                                                         ROR06075
599800        MOVE WS-R-WARN-CODE TO CORORH-R-WARN-CODE-10              ROR06075
599900        GO TO S8000-EXIT                                          ROR06075
600000     END-IF.                                                      ROR06075
600100*                                                                 ROR06075
600200     IF CORORH-R-WARN-CODE-11 GREATER THAN SPACES                 ROR06075
600300        IF CORORH-R-WARN-CODE-11 EQUAL WS-R-WARN-CODE             ROR06075
600400           GO TO S8000-EXIT                                       ROR06075
600500        ELSE                                                      ROR06075
600600           NEXT SENTENCE                                          ROR06075
600700        END-IF                                                    ROR06075
600800     ELSE                                                         ROR06075
600900        MOVE WS-R-WARN-CODE TO CORORH-R-WARN-CODE-11              ROR06075
601000        GO TO S8000-EXIT                                          ROR06075
601100     END-IF.                                                      ROR06075
601200*                                                                 ROR06075
601300     IF CORORH-R-WARN-CODE-12 GREATER THAN SPACES                 ROR06075
601400        IF CORORH-R-WARN-CODE-12 EQUAL WS-R-WARN-CODE             ROR06075
601500           GO TO S8000-EXIT                                       ROR06075
601600        ELSE                                                      ROR06075
601700           NEXT SENTENCE                                          ROR06075
601800        END-IF                                                    ROR06075
601900     ELSE                                                         ROR06075
602000        MOVE WS-R-WARN-CODE TO CORORH-R-WARN-CODE-12              ROR06075
602100        GO TO S8000-EXIT                                          ROR06075
602200     END-IF.                                                      ROR06075
602300*                                                                 ROR06075
602400     IF CORORH-R-WARN-CODE-13 GREATER THAN SPACES                 ROR06075
602500        IF CORORH-R-WARN-CODE-13 EQUAL WS-R-WARN-CODE             ROR06075
602600           GO TO S8000-EXIT                                       ROR06075
602700        ELSE                                                      ROR06075
602800           NEXT SENTENCE                                          ROR06075
602900        END-IF                                                    ROR06075
603000     ELSE                                                         ROR06075
603100        MOVE WS-R-WARN-CODE TO CORORH-R-WARN-CODE-13              ROR06075
603200        GO TO S8000-EXIT                                          ROR06075
603300     END-IF.                                                      ROR06075
603400*                                                                 ROR06075
603500     IF CORORH-R-WARN-CODE-14 GREATER THAN SPACES                 ROR06075
603600        IF CORORH-R-WARN-CODE-14 EQUAL WS-R-WARN-CODE             ROR06075
603700           GO TO S8000-EXIT                                       ROR06075
603800        ELSE                                                      ROR06075
603900           NEXT SENTENCE                                          ROR06075
604000        END-IF                                                    ROR06075
604100     ELSE                                                         ROR06075
604200        MOVE WS-R-WARN-CODE TO CORORH-R-WARN-CODE-14              ROR06075
604300        GO TO S8000-EXIT                                          ROR06075
604400     END-IF.                                                      ROR06075
604500*                                                                 ROR06075
604600     IF CORORH-R-WARN-CODE-15 GREATER THAN SPACES                 ROR06075
604700        IF CORORH-R-WARN-CODE-15 EQUAL WS-R-WARN-CODE             ROR06075
604800           GO TO S8000-EXIT                                       ROR06075
604900        ELSE                                                      ROR06075
605000           NEXT SENTENCE                                          ROR06075
605100        END-IF                                                    ROR06075
605200     ELSE                                                         ROR06075
605300        MOVE WS-R-WARN-CODE TO CORORH-R-WARN-CODE-15              ROR06075
605400        GO TO S8000-EXIT                                          ROR06075
605500     END-IF.                                                      ROR06075
605600*                                                                 ROR06075
605700 S8000-EXIT. EXIT.                                                ROR06075
605800*                                                                 ROR06075
605801*                                                                 ROR06075
605802*                                                                         
605803 500-CHECK-FLOORING.                                              MCV94181
605804*                                                                 MCV94181
605805     IF NOT WS-DLI-SCHEDULED                                      MCV94181
605806        PERFORM 980-SCHEDULE-DLI.                                 MCV94181
605807*                                                                 MCV94181
605808     MOVE CORORH-COMPANY-CODE         TO  WS-CUSHED-CO            PXP95004
605809     MOVE WS-CUST-BR-NBR              TO  WS-CUSHED-BR            MCV94181
605810     MOVE WS-CUST-NUMBER              TO  WS-CUSHED-CUST.         MCV94181
605811     MOVE WS-CUST-SUFFIX              TO  WS-CUSADR-SUFFIX.       MCV94181
605812*                                                                 MCV94181
605813     PERFORM 1002-GU-CUSADR                                       MCV94181
605814*                                                                 MCV94181
605815     IF WS-CUSADR-NORESP AND NOT CUA-ADDR-DELETE                  MCV94181
605816        IF CUA-FLOOR-TERMS NUMERIC                                MCV94181
605817           MOVE CUA-FLOOR-TERMS       TO  WS-FLOOR-TERMS          MCV94181
605818        ELSE                                                      MCV94181
605819           MOVE +350                  TO  WS-FLOOR-TERMS          MCV94181
605820        END-IF                                                    MCV94181
605821        MOVE CUA-FLOOR-NBR            TO  WS-CUSHED-BR-CUST       MCV94181
605822        PERFORM 1000-GU-CUSHED                                    MCV94181
605823        IF WS-CUSHED-NOTFND OR CU-DELETE                          MCV94181
605824           MOVE 'R'                   TO  WS-LU6ORH-ERROR-SW      MCV94181
605825        END-IF                                                    MCV94181
605826     ELSE                                                         MCV94181
605827        MOVE 'R'                      TO  WS-LU6ORH-ERROR-SW.     MCV94181
605828*                                                                 ROR00080
605829     IF TC-USA                                                    SXG03305
605830        IF WS-LU6ORH-ERROR-ALL-OK                                 SXG03305
605831           PERFORM S1070-GET-BILLTO-ADDRESS-US  THRU S1070-EXIT   SXG03305
605832        END-IF                                                    SXG03305
605833     ELSE                                                         SXG03305
605834       IF TB-CO-VAL-EXP-COMPL-OK                                  SXG03305
605835        IF WS-LU6ORH-ERROR-ALL-OK                                 SXG03305
605836           AND CORORH-COMPANY-CODE NOT EQUAL TO 'MD'              SXG03305
605837           PERFORM S1071-GET-BILLTOEXP-NON-US   THRU S1071-EXIT   SXG03305
605838        END-IF                                                    SXG03305
605839       END-IF                                                     SXG03305
605840     END-IF.                                                      SXG03305
605841*                                                                         
605842 500-EXIT.                                                        ROR00080
605843*                                                                         
605844*--------------------------                                               
605845*                                                                         
605846 581-FILL-RATE-LSB.                                               PWL96284
605847*                                                                         
605848     MOVE '0'                       TO  WS-BP-REC-SEQ             PWL96284
605849     MOVE WS-CUST-BR-NBR            TO  WS-BP-BR-NBR              PWL96284
605850     MOVE TC-COMPANY                TO  WS-BP-COMPANY             PWL96284
605851     PERFORM       S5500-READ-BPMAST THRU S5500-EXIT              ROR02344
605852     IF WS-BP-NORESP                                              PWL96284
605853        MOVE     BP-BR-NBR-INV      TO WS-INVENTORY-BR            PWL96284
605854     ELSE                                                         PWL96284
605855        MOVE     WS-CUST-BR-NBR     TO WS-INVENTORY-BR.           PWL96284
605856                                                                          
           IF WS-BP-NORESP AND BP-BR-NBR-INV > SPACES AND               AYB22266
              CUA-SHIP-FROM EQUAL ZEROS OR SPACES AND                   AYB22266
              (TC-COMPANY = 'DE' OR 'UK')                               AYB22266
              MOVE     BP-BR-NBR-INV      TO ORSH-BR-NBR-SHIP-FROM      AYB22266
           END-IF.                                                      AYB22266
                                                                        AYB22266
605857     PERFORM 581A-GET-LEGITMATE-SHP-BR.                           PWL96284
605858     MOVE WS-BR-NBR-SHIP-FROM TO ORH-CUA-SHIP-FROM.               PWL96284
605859*                                                                         
605860*581A-GET-LEGITMATE-SHP-BR.                                       PWL96284
605861     COPY ORSLSPBR REPLACING                                      PWL96284
605862          WS-CUA-SHIP-FROM    BY WS-BR-NBR-SHIP-FROM              PWL96284
605863**                                                                PWL97031
605864* THIS HEADER PROGRAM WILL NOT EXECUTE PARAGRAPH 581I- IN         PWL97031
605865* COPYBOOK ORSLSPBR AND THERE IS NO 960-COMPUTE-AVAILABLE AND     PWL97031
605866* 1552-GU-INSBRN IN THE PROGRAM THEREFORE REPLACE THEM WITH BLANK PWL97031
605867**                                                                PWL97031
605868          ==PERFORM 960-COMPUTE-AVAILABLE== BY ====               PWL97031
605869          ==PERFORM 1552-GU-INSBRN== BY ====                      PWL97031
605870          WS-BR-NBR-SHIP-FROM BY ORSH-BR-NBR-SHIP-FROM.           PWL96284
605871*                                                                         
605872*                                                                 RMF95207
605873 980-SCHEDULE-DLI.                                                        
605874*                                                                         
605875*---  SCHEDULE DLI                                                        
605876*                                                                         
605877     CALL 'CBLTDLI' USING        PCB                                      
605878                                 WS-PSB-NAME                              
605879                                 ADDRESS OF DLIUIB.                       
605880*                                                                         
605881*    WHILE TRYING TO SCHEDULE....IF  NOT NORMAL RESP....          ROR00199
605882*    IF ITS  FIRST TIME..INSTEAD OF ABENDING..SEND AN  ERROR 'E3' ROR00199
605883*     IF NOT FIRST TIME.. ABEND CODE..''U980'' &  ERROR  ''E3''   ROR00199
605884**************                                                    ROR00199
605885     IF NOT FCNORESP                                              ROR00199
605886        IF ITS-FIRST-TIME-SCHEDULING                              ROR00199
605887           MOVE '3'          TO WS-LU6ORH-ERROR-SW                ROR00199
605888           PERFORM S1000-SET-ERRORS THRU S1000-EXIT               ROR02128
605889           PERFORM S7000-END-THE-ORDER                            ROR04064
605890        ELSE                                                      ROR00199
605891           MOVE 'U980'                TO  WS-ABCODE               ROR00199
605892           MOVE UIBRCODE              TO  WS-STATUS               ROR00199
605893           MOVE '3'                   TO  WS-ABEND-ERROR-SW       ROR00199
605894           MOVE UIBFCTR               TO  WS-ABEND-DLI-STS        ROR00199
605895           MOVE 'DLI-SCHD'            TO  WS-ABEND-FILE-NAME      ROR00199
605896           PERFORM 999-ABEND                                      ROR00199
605897        END-IF                                                    ROR00199
605898     END-IF.                                                      ROR00199
605899     SET  ITS-NOT-FIRST-TIME-SCHEDULING TO TRUE                   ROR00199
605900*                                                                         
605901     SET ADDRESS OF PCB-PTRS          TO  UIBPCBAL                        
605902     SET ADDRESS OF CUPCB             TO  CUPCB-PTR                       
605903     SET ADDRESS OF ORPCB             TO  ORPCB-PTR                       
605904     SET ADDRESS OF INPCB-PART        TO  INPCB-PART-PTR          DXO99330
605905     SET ADDRESS OF VNPCB             TO  VNPCB-PTR               DXO99330
605906     SET ADDRESS OF EMPCB-SLM         TO  EMPCB-PTR               DXO99330
605907     SET ADDRESS OF ORPCB-CUST-ORD-NBR                            DXO99330
605908                                  TO  ORPCB-CUST-ORDER-PTR.       DXO99330
605909     MOVE 'Y'                         TO  WS-DLI-SCHEDULED-SW.            
605910*                                                                 ROR00199
605911*    WHILE TRYING TO SCHEDULE....IF  NORMAL RESP..                ROR00199
605912*    IF ITS  FIRST TIME..CHECK DATABASE'S AVAILABILITY...         ROR00199
605913*     IF ALL OF THEM ARE NOT AVAILABLE ..ERROR  ''E3'' !!!        ROR00199
605914*    IF NOT FIRST TIME..DONT  CHECK DATABASE'S AVAILABILITY !!    ROR00199
605915**************                                                    ROR00199
605916     IF CHECK-DATABASE-AVAIL-YES                                  ROR00199
605917        SET  CHECK-DATABASE-AVAIL-NO  TO  TRUE                    ROR00199
605918        PERFORM 982-CHECK-DATABASE-AVAIL                          ROR00199
605919        IF NOT WS-DATABASES-AVAILABLE                             ROR00199
605920           MOVE '3'                   TO  WS-LU6ORH-ERROR-SW      ROR00199
605921           PERFORM S1000-SET-ERRORS THRU S1000-EXIT               ROR02128
605922           PERFORM S7000-END-THE-ORDER.                           ROR04064
605923*                                                                 ROR00199
605924 COPY DBAVAILR.                                                   ROR00199
605925*                                                                         
605926 990-TERMINATE-DLI.                                                       
605927*                                                                         
605928*---  TERMINATE DLI                                                       
605929*                                                                         
605930     CALL 'CBLTDLI'               USING  TERM                             
605931*                                                                         
605932     MOVE 'N'                         TO  WS-DLI-SCHEDULED-SW.            
605933*                                                                         
605934 999-ABEND.                                                               
605935*                                                                         
605936*---  DATA BASE CALL ABEND                                                
605937*                                                                         
605938     MOVE WS-ABEND-ERROR-SW           TO  WS-LU6ORH-ERROR-SW.     ELB93350
605939     MOVE WS-ABEND-INFORMATION        TO  CORORH-FILLER-AREA.     PXP95004
605940     MOVE EIBRCODE                    TO  WS-ABEND-ERROR-CODE     MCV94145
605941     MOVE EIBRSRCE                    TO  WS-ABEND-RESOURCE       MCV94145
605942     MOVE EIBRESP                     TO  WS-ABEND-RESPONSE       MCV94145
605943     MOVE EIBRESP2                    TO  WS-ABEND-RESPONSE2      MCV94145
605944     MOVE EIBFN                       TO  WS-ABEND-FUNCTION       MCV94145
605945*                                                                         
605946     PERFORM S1000-SET-ERRORS THRU S1000-EXIT.                    ROR02128
605947*                                                                         
605948     PERFORM S7000-END-THE-ORDER.                                 ROR04064
605949*                                                                 ROR99350
605950     COPY RWSCKHD.                                                FVB00101
605951*                                                                 FVB00101
605952 7025-READ-RWLHDS.                                                FVB00101
605953     EXEC CICS READ                                               FVB00101
605954          FILE   (WS-HDS-FILE-NAME)                               FVB00101
605955          INTO   (RWRHDS)                                         FVB00101
605956          LENGTH (WS-HDS-IO-REC-LENGTH)                           FVB00101
605957          RIDFLD (WS-RWRHDS-KEY)                                  FVB00101
605958          RESP   (WS-EIBRESP)                                     FVB00101
605959          END-EXEC.                                               FVB00101
605960                                                                  FVB00101
605961     IF WS-EIB-NORESP                                             FVB00101
605962         MOVE 'Y'                TO WS-HDS-IO-SW                  FVB00101
605963     ELSE                                                         FVB00101
605964         MOVE 'N'                TO WS-HDS-IO-SW.                 FVB00101
605965*                                                                         
605966*Z9000-ZIPBR.                       COPY SYXZIPBR.                MCV93334
605967 Z9000-ZIPBR.                                                             
605968     COPY SYXZPBRC REPLACING                                              
605969                  WS-COMPANY           BY ORH-COMPANY             PWL96284
605970                  WS-STATE-CODE        BY CORORH-SHIP-TO-STATE    PWL96284
605971                  WS-POSTAL-CODES      BY ORH-POSTAL-CODES.       PWL96284
605972*                                                                         
605973 F4000-VERIFY-CC-CODE.              COPY FRTCHK.                  JJD95137
605974*                                                                         
605975 F4070-READ-FED-FILE.                                             JJD95137
605976*                                                                 JJD95137
605977     MOVE WS-FED-MAXLEN         TO WS-FED-REC-LENGTH.             JJD95137
605978*                                                                 JJD95137
605979     EXEC CICS READ                                               JJD95137
605980          FILE   (WS-FED-FILE-NAME)                               JJD95137
605981          RIDFLD (WS-FED-RECORD-KEY)                              JJD95137
605982          INTO   (FEDEX-REC)                                      JJD95137
605983          LENGTH (WS-FED-REC-LENGTH)                              JJD95137
605984          RESP   (WS-EIBRESP)                                     JJD95137
605985          END-EXEC.                                               JJD95137
605986*                                                                 JJD95137
605987     IF WS-EIB-NORESP                                             JJD95137
605988        MOVE 'Y'                 TO  WS-FED-IO-SW                 JJD95137
605989     ELSE                                                         JJD95137
605990        IF WS-EIB-NOTFND                                          JJD95137
605991           MOVE 'N'              TO  WS-FED-IO-SW                 JJD95137
605992        ELSE                                                      JJD95137
605993           MOVE 'RFED'           TO  WS-ABCODE                    JJD95137
605994           PERFORM 999-ABEND.                                     JJD95137
605995*                                                                 JJD95137
605996 F4070-EXIT. EXIT.                                                JJD95137
605997*                                                                 JJD95137
605998 F4080-READ-ORLZONE.                                              JJD95137
605999*                                                                 JJD95137
606000     MOVE WS-ZNE-MAXLEN          TO  WS-ZNE-REC-LENGTH.           JJD95137
606001*                                                                 JJD95137
606002     EXEC CICS READ                                               JJD95137
606003          FILE   (WS-ZNE-FILE-NAME)                               JJD95137
606004          LENGTH (WS-ZNE-REC-LENGTH)                              JJD95137
606005          INTO   (ZNE-ORRZNE)                                     JJD95137
606006          RIDFLD (WS-ZNE-RECORD-KEY)                              JJD95137
606007          RESP   (WS-EIBRESP)                                     JJD95137
606008          END-EXEC.                                               JJD95137
606009*                                                                 JJD95137
606010     IF WS-EIB-NORESP                                             JJD95137
606011        MOVE 'Y'                 TO  WS-ZNE-IO-SW                 JJD95137
606012        MOVE ZNE-ZONE            TO  WS-ZONE                      JJD95137
606013     ELSE                                                         JJD95137
606014        IF WS-EIB-NOTFND                                          JJD95137
606015           MOVE 'N'              TO  WS-ZNE-IO-SW                 JJD95137
606016        ELSE                                                      JJD95137
606017           MOVE 'RZNE'           TO  WS-ABCODE                    JJD95137
606018           PERFORM 999-ABEND.                                     JJD95137
606019*                                                                 JJD95137
606020 F4080-EXIT.                                                      JJD95137
606021     EXIT.                                                        JJD95137
606022*                                                                         
606023*                                                                         
606024 9300-FORMAT-CCYYMMDD.                                            ROK98106
606025     COPY CFL014.                                                 ROK98106
606026 9300-EXIT.                                                       ROK98106
606027     EXIT.                                                        ROK98106
606028*                                                                         
606029*                                                                 ROR05314
606030 1000-GENERIC-SECURITY.                                           ROR05314
606040*                                                                 ROR05314
606050     MOVE CORORH-COMPANY      TO    TB-SEC-CO.                    ROR05314
606060     MOVE CORORH-OPER-ID      TO    TB-SEC-OPID.                  ROR05314
606070     CALL 'SYU510' USING TB-SEC-TABLE-IA.                         ROR05314
606080*                                                                 ROR05314
606090*                                                                 ROR05314
606100 1000-GENERIC-SECURITY-EXIT. EXIT.                                ROR05314
606101*                                                                 ROR05314
606102 1000-GU-CUSHED.                                                          
606103     MOVE '4'  TO  WS-ABEND-ERROR-SW.                             ELB93342
606104                                    COPY CUIO1000.                        
606105     MOVE WS-CUSHED-IO-SW             TO  WS-ABEND-DLI-STS.       ELB93350
606106     MOVE 'CUSHED  '                  TO  WS-ABEND-FILE-NAME.     ELB93350
606107     IF  WS-CUSHED-IO-SW = 'Y'                                    TEH00259
606108         MOVE SPACE                   TO WS-ABEND-ERROR-SW.       TEH00259
606109*                                                                         
606110 1002-GU-CUSADR.                                                  MCV94181
606111     MOVE '6'  TO  WS-ABEND-ERROR-SW.                             ELB93342
606112                                    COPY CUIO1002.                MCV95136
606113     MOVE WS-CUSADR-IO-SW             TO  WS-ABEND-DLI-STS.       ELB93350
606114     MOVE 'CUSADR  '                  TO  WS-ABEND-FILE-NAME.     ELB93350
606115     IF  WS-CUSADR-IO-SW = 'Y'                                    TEH00259
606116         MOVE SPACE                   TO WS-ABEND-ERROR-SW.       TEH00259
606117*                                                                         
606118 1004-GU-CUSBRN.                                                          
606119     MOVE '5'  TO  WS-ABEND-ERROR-SW.                             ELB93342
606120                                    COPY CUIO1004.                MCV95136
606121     MOVE WS-CUSBRN-IO-SW             TO  WS-ABEND-DLI-STS.       ELB93350
606122     MOVE 'CUSBRN  '                  TO  WS-ABEND-FILE-NAME.     ELB93350
606123     IF  WS-CUSBRN-IO-SW = 'Y'                                    TEH00259
606124         MOVE SPACE                   TO WS-ABEND-ERROR-SW.       TEH00259
606125*                                                                         
606126 1010-GU-CUSMSC.                                                  ROR99015
606127     COPY CUIO1010.                                               ROR99015
606128*                                                                 ROR99015
606129*                                                                 ROR99135
606130 1066-GNP-CUSMSC.                                                 ROR99135
606131     COPY CUIO1066.                                               ROR99135
606132*                                                                 ROR99135
606133 1201-GU-CUSHEDOF.                                                TEH04167
606134     COPY CUIO1201.                                               TEH04167
606135*                                                                 TEH04167
606136 1332-ISRT-ORSHED.                                                        
606137     MOVE '7'  TO  WS-ABEND-ERROR-SW.                             ELB93342
606138                                    COPY ORIO1332.                        
606139     MOVE WS-ORSHED-IO-SW             TO  WS-ABEND-DLI-STS.       ELB93350
606140     MOVE 'ORSHED  '                  TO  WS-ABEND-FILE-NAME.     ELB93350
606141     IF  WS-ORSHED-IO-SW = 'Y'                                    TEH00259
606142         MOVE SPACE                   TO WS-ABEND-ERROR-SW.       TEH00259
606143*                                                                         
606144 1333-ISRT-ORSHEDOF.                                              TEH02015
606145     MOVE '7'  TO WS-ABEND-ERROR-SW.                              TEH02015
606146                                    COPY ORIO1333.                TEH02015
606147     MOVE WS-ORSHEDOF-IO-SW           TO  WS-ABEND-DLI-STS.       TEH02015
606148     MOVE 'ORSHEDOF'                  TO  WS-ABEND-FILE-NAME.     TEH02015
606149     IF  WS-ORSHEDOF-IO-SW = 'Y'                                  TEH02015
606150         MOVE SPACE                   TO WS-ABEND-ERROR-SW.       TEH02015
606151*                                                                 TEH02015
606152 1348-ISRT-ORSSTO.                                                        
606153     MOVE '8'  TO  WS-ABEND-ERROR-SW.                             ELB93342
606154                                    COPY ORIO1348.                        
606155     MOVE WS-ORSSTO-IO-SW             TO  WS-ABEND-DLI-STS.       ELB93350
606156     MOVE 'ORSSTO  '                  TO  WS-ABEND-FILE-NAME.     ELB93350
606157     IF  WS-ORSSTO-IO-SW = 'Y'                                    TEH00259
606158         MOVE SPACE                   TO WS-ABEND-ERROR-SW.       TEH00259
606159*                                                                         
606160 1334-ISRT-ORSSHH.                                                        
606161     MOVE '9'  TO  WS-ABEND-ERROR-SW.                             ELB93342
606162                                    COPY ORIO1334.                        
606163     MOVE WS-ORSSHH-IO-SW             TO  WS-ABEND-DLI-STS.       ELB93350
606164     MOVE 'ORSSHH  '                  TO  WS-ABEND-FILE-NAME.     ELB93350
606165     IF  WS-ORSSHH-IO-SW = 'Y'                                    TEH00259
606166         MOVE SPACE                   TO WS-ABEND-ERROR-SW.       TEH00259
606167*                                                                         
606168 1335-ISRT-ORSSHHOF.                                              TEH02015
606169     MOVE '9'  TO WS-ABEND-ERROR-SW.                              TEH02015
606170                                    COPY ORIO1335.                TEH02015
606171     MOVE WS-ORSSHHOF-IO-SW           TO  WS-ABEND-DLI-STS.       TEH02015
606172     MOVE 'ORSSHHOF'                  TO  WS-ABEND-FILE-NAME.     TEH02015
606173     IF  WS-ORSSHHOF-IO-SW = 'Y'                                  TEH02015
606174         MOVE SPACE                   TO WS-ABEND-ERROR-SW.       TEH02015
606175*                                                                 TEH02015
606176 1600-GU-EMSHED.                                                  ROR11124
606177     MOVE 'E'  TO  WS-ABEND-ERROR-SW.                             ROR11124
606178                                    COPY EMIO1600.                ROR11124
606179     MOVE WS-EMSHED-SLM-IO-SW         TO  WS-ABEND-DLI-STS.       ROR11124
606180     MOVE 'EMSHED  '                  TO  WS-ABEND-FILE-NAME.     ROR11124
606190     IF  WS-EMSHED-SLM-IO-SW = 'Y'                                ROR11124
606200         MOVE SPACE                   TO WS-ABEND-ERROR-SW.       ROR11124
606300*                                                                 ROR11124
606400 1200-GU-ORSHED.                 COPY ORIO1200.                   ROR17111
606500 1202-GU-ORSSHH.                 COPY ORIO1202.                   ROR17111
606501 1207-GU-ORSSTO.                 COPY ORIO1207.                   ROR17111
606502*A1000-NEXUS-TAX-ROUTINE.                                         ROR99015
606503     COPY SASNEXUS.                                               ROR99015
606504*                                                                 ROR99015
606505 750-READ-BP-RECORD.                                              ROR99015
606506*                                                                 ROR99015
606507     MOVE WS-BP-MAXLEN           TO  WS-BP-REC-LENGTH.            ROR99015
606508*                                                                 ROR99015
606509     EXEC CICS READ                                               ROR99015
606510          FILE   (WS-BP-FILE-NAME)                                ROR99015
606511          LENGTH (WS-BP-REC-LENGTH)                               ROR99015
606512          INTO   (BP-BPRMST)                                      ROR99015
606513          RIDFLD (WS-BP-KEY)                                      ROR99015
606514          RESP   (WS-EIBRESP)                                     ROR99015
606515          END-EXEC.                                               ROR99015
606516*                                                                 ROR99015
606517     IF WS-EIB-NORESP                                             ROR99015
606518        MOVE 'Y'                 TO  WS-BP-IO-SW                  ROR99015
606519     ELSE                                                         ROR99015
606520        MOVE 'N'                 TO  WS-BP-IO-SW.                 ROR99015
606521*                                                                 ROR99015
606522 750-EXIT.                                                        ROR99015
606523*                                                                 ROR99350
      *----------------------------------------------------------------*SS123265
      *BIF DEEDIT PROVIDES THE BUILT-IN FUNCTION DEEDIT.IT SPECIFIES   *SS123265
      *THAT ALPHABETIC AND SPECIAL CHARACTERS ARE REMOVED FROM AN      *SS123265
      *EBCDIC DATA FIELD, AND THE REMAINING DIGITS RIGHT-ALIGNED AND   *SS123265
      *PADDED TO THE LEFT WITH ZEROS AS NECESSARY.                     *SS123265
      *THIS PARA IS TO AUTOMATICALLY APPEND LEADING ZEROES IN          *SS123265
      *3RD PARTY ACCT NUMBER VARIABLE.                                 *SS123265
      *----------------------------------------------------------------*SS123265
       755-INCLUDE-LEADING-ZEROES.                                      SS123265
                                                                        SS123265
           EXEC CICS BIF DEEDIT                                         SS123265
                FIELD (WS-THPTY-ACCT-NBR)                               SS123265
                LENGTH(12)                                              SS123265
           END-EXEC.                                                    SS123265
           MOVE WS-THPTY-ACCT-NBR    TO WWT3ACT-THPTY-ACCT-NBR          SS123265
                                        CORORH-THIRD-PARTY-FRT-ACCOUNT. SS123265
                                                                        SS123265
       755-EXIT.                                                        SS123265
           EXIT.                                                        SS123265
606600                                                                          
606700 760-FETCH-WWT3ACT.                                               TKC05031
606800     PERFORM 990-DB2-AVAILABILITY.                                RPM02110
606900     IF NOT WS-DB2-AVAIL                                          RPM02110
607000        MOVE 'Y'                 TO WS-ERROR-SW                   RPM02110
607100        MOVE '1'                 TO WS-LU6ORH-ERROR-SW            RPM02110
607200        MOVE 'F1'                TO WS-LU6ORH-ERROR-FLAG          RPM02110
607300        GO                       TO 760-EXIT.                     RPM02110
607400                                                                          
607500     MOVE ' '                    TO WS-WWT3ACT-IO-SW              TKC05031
607600     MOVE TC-COMPANY             TO WWT3ACT-CO-CD                 TKC05031
607700     MOVE CORORH-BR-NBR          TO WWT3ACT-CUST-BR-NBR           TKC05031
607800     MOVE CORORH-CUST-NBR        TO WWT3ACT-CUST-NBR              TKC05031
607900     MOVE CORORH-THIRD-PARTY-FRT-ACCOUNT                          RPM02110
608000                                 TO WWT3ACT-THPTY-ACCT-NBR        TKC05031
608100     IF  WS-TRUE-UPS                                              ROR04036
608200        MOVE 'UPS'               TO WWT3ACT-CARR-ID               TKC05031
608300     ELSE                                                         ROR04036
608400        MOVE TB-CARRIER          TO WWT3ACT-CARR-ID.              TKC05031
608500                                                                          
608600     INSPECT WWT3ACT-THPTY-ACCT-NBR                               TKC05031
608700        REPLACING ALL LOW-VALUES BY SPACES                        RPM02110
608800                                                                  BIM02238
608900     IF  WS-TRUE-UPS                                              BIM02238
609000     AND CU-3RD-PRTY-BYPASS-UPS                                   BIM02238
609100         GO                      TO 760-EXIT.                     BIM02238
609200     IF  WS-RPS                                                   BIM02238
609300     AND CU-3RD-PRTY-BYPASS-RPS                                   BIM02238
609400         GO                      TO 760-EXIT.                     BIM02238
609500     IF  WS-BAX                                                   BIM02238
609600     AND CU-3RD-PRTY-BYPASS-BAX                                   BIM02238
609700         GO                      TO 760-EXIT.                     BIM02238
609800                                                                  RPM02110
609900     EXEC SQL                                                     RPM02110
610000       SELECT   THPTY_ACCT_NBR,                                   TKC05031
610100                CARR_ID                                           TKC05031
610200         INTO  :WWT3ACT-THPTY-ACCT-NBR,                           TKC05031
610300               :WWT3ACT-CARR-ID                                   TKC05031
610400         FROM   THPTY_ASG_ACCT                                    TKC05031
610800        WHERE   CO_CD           = :WWT3ACT-CO-CD          AND     TKC05031
610900                CUST_BR_NBR     = :WWT3ACT-CUST-BR-NBR    AND     TKC05031
611000                CUST_NBR        = :WWT3ACT-CUST-NBR       AND     TKC05031
611100                THPTY_ACCT_NBR  = :WWT3ACT-THPTY-ACCT-NBR AND     TKC05031
611200                CARR_ID         = :WWT3ACT-CARR-ID                TKC05031
611210        FETCH FIRST 1 ROW ONLY                                    TKC05031
611300     END-EXEC.                                                    RPM02110
611400                                                                  RPM02110
611500     IF SQLCODE = DB2-NORESP                                      RPM02110
611600        MOVE 'Y'                 TO WS-WWT3ACT-IO-SW              TKC05031
611700     ELSE                                                         RPM02110
611800     IF SQLCODE = DB2-NOT-FOUND  OR                               RPM02110
611900        SQLCODE = DB2-END-OF-FILE                                 RPM02110
612000        MOVE 'Y'                 TO WS-ERROR-SW                   RPM02110
612100        MOVE 'N'                 TO WS-WWT3ACT-IO-SW              TKC05031
612200        MOVE 'P'                 TO WS-LU6ORH-ERROR-SW            RPM02110
612300     ELSE                                                         RPM02110
612400        MOVE 'Y'                 TO WS-ERROR-SW                   RPM02110
612500        MOVE 'E'                 TO WS-WWT3ACT-IO-SW              TKC05031
612600        MOVE '3'                 TO WS-LU6ORH-ERROR-SW            RPM02110
612700        MOVE 'F3'                TO WS-LU6ORH-ERROR-FLAG          RPM02110
612800        MOVE '(760-) PROBLEM W/FETCH'                             RPM02110
612900                                 TO SYWDB2-EXTRA-MESSAGE-1        RPM02110
613000        MOVE 'SQLCODE='          TO SYWDB2-EXTRA-MESSAGE-2        RPM02110
613100        MOVE SQLCODE             TO SYWDB2-EXTRA-MESSAGE-2(9:9)   RPM02110
613200        PERFORM 990-SQL-MESSAGE.                                  RPM02110
613300                                                                          
613400 760-EXIT.                                                        SXG04030
613500     EXIT.                                                        RPM02110
613600                                                                          
613700*                                                                 ROR05167
613800 P030-CHECK-FRT-FORWARDER.                                        ROR05167
613900*                                                                 ROR05167
614000     MOVE WS-FFRMST-MAXLEN          TO WS-FFRMST-REC-LENGTH.      ROR05167
614100                                                                  ROR05167
614200     EXEC CICS READ                                               ROR05167
614300          FILE     (WS-FFRMST-FILE-NAME)                          ROR05167
614400          RIDFLD   (WS-FFRMST-KEY)                                ROR05167
614500          LENGTH   (WS-FFRMST-REC-LENGTH)                         ROR05167
614600          INTO     (FREIGHT-FORWARDER-RECORD)                     ROR05167
614700          RESP     (WS-EIBRESP)                                   ROR05167
614800          END-EXEC.                                               ROR05167
614900                                                                  ROR05167
615000     IF WS-EIB-NORESP                                             ROR05167
615100        SET WS-FFRMST-NORESP TO TRUE                              ROR05167
615200        IF FFR-ACTIVE                                             ROR05167
615300           MOVE 'Y' TO WS-ACTIVE-FFR-SW                           ROR05167
615400        ELSE                                                      ROR05167
615500           MOVE 'N' TO WS-ACTIVE-FFR-SW                           ROR05167
615600     ELSE                                                         ROR05167
615700        SET WS-FFRMST-NOTFND TO TRUE.                             ROR05167
615800*                                                                 ROR05167
615900 P030-EXIT.                                                       ROR05167
616000     EXIT.                                                        ROR05167
616001*                                                                 ROR05167
616002*                                                                 ROR06075
616003*P040-CHECK-UK-CARRIER.                                           ROR06075
616004     COPY ORSUKCAR.                                               ROR06075
616005 P041-VALIDATE-CARRIER.                                           ROR06194
616006     COPY WHSUKCC.                                                ROR06194
616007*                                                                 ROR06075
616008 P041-READ-ORLPEB.                                                ROR06075
616009*                                                                 ROR06075
616010     EXEC CICS READ                                               ROR06075
616020          FILE   (WS-ORP-FILE-NAME)                               ROR06075
616030          LENGTH (WS-ORP-PCR-RECLEN)                              ROR06075
616040          INTO   (ORP-POSTCODE-RECORD)                            ROR06075
616050          RIDFLD (ORP-PCR-KEY)                                    ROR06075
616060          RESP   (WS-EIBRESP)                                     ROR06075
616070     END-EXEC.                                                    ROR06075
616080*                                                                 ROR06075
616090 P041-READ-ORLPEB-EXIT.                                           ROR06075
616100     EXIT.                                                        ROR06075
616200*                                                                 ROR06117
616300*V100-CLEANUP-TEXT.                                               ROR06117
616400* ***********************************************************     ROR06117
616500*    SWEEP TEXT FIELD FOR INVALID EBCDIC CHARACTERS.              ROR06117
616600* ***********************************************************     ROR06117
616601     COPY SYSCHAR.                                                ROR06117
616602                                                                          
616603*P020-CHECK-HOLD-SEQUENCE.                                        ABM18216
616604     COPY ORSHLDSQ.                                               ABM18216
616605*990-DB2-AVAILABILITY.                                            RPM02110
616606*990-SQL-MESSAGE.                                                 RPM02110
616607     COPY SYXDB2EC.                                               RPM02110
616608*SYSZIP-000-VALIDATE.                                             ROR06194
616609     COPY SYSZIP.                                                 ROR06194
      *CR2243-COPYBOOK EXTENDED SO HAVING EXTENSO SO LOGIC              RYK20276
      *READ-EXTEND-SO.                                                  RYK20276
           COPY EXTENDSO.                                               RYK20276
